[
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Notting Hill, London, England, U.K.<p>Our web application is at the heart of our busy and successful e-commerce business; every day it serves millions of product images and handles thousands of purchases, but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and deployed on Amazon Web Services; we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, at the moment we have a mix of Linux and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. Our developers are generalizing specialists whose typical day may include refining an algorithm, writing a tricky integration test, tuning a SQL query, and discussing feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles.</p><p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homeware, and lifestyle categories, many familiar from the high street. The company has about 80 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828531", 
        "user": "squirrel"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">AllTrails and AllSnow\n<a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a> <a href=\"http://allsnow.com\" rel=\"nofollow\">http://allsnow.com</a><p>FULLTIME Rails / iOS / Android Engineers / Designers</p><p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B</p><p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping and snowboarding benefits, anyone?</p><p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (try searching for 'Hiking'). We also have the #1 Snow sports app on iPhone.</p><p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book, and a core committer to Homebrew on the team. We're looking for exceptional full stack Rails and mobile developers (Android and iOS) and designers.</p><p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you! <a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or jobs@alltrails.com</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828528", 
        "user": "ipster"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Loci Controls - <a href=\"http://www.locicontrols.com\" rel=\"nofollow\">http://www.locicontrols.com</a> - Boston, MA<p>We are looking for: Backend Software Engineer * Data Scientist</p><p>Loci Controls is developing real time control systems to extract energy from waste in landfills.  Many landfills use methane from waste to generate and sell electricity to the power grid. We have developed custom hardware to measure and control the extraction of methane, and have successfully deployed our technology at a pilot site south of Boston.  We are coupling connected devices and data analytics to increase the electricity output at these power plants, and you can be an integral part of the team.</p><p>We are currently working out of the Bolt (bolt.io) space in downtown Boston. It is a great office with great people, a ton of rapid prototyping equipment, idea paint conference rooms, full kitchen, and free coffee and beer. Come check it out!</p><p>------------------------------------------------------------</p><p>Backend Software Engineer</p><p>Blend open-source technology with our custom hardware to deliver real time data to customers quickly and efficiently. Build a robust interface between the control hardware and the web so that not a single data point is lost. And archive data so that it can be accessed years from now.  You will lay the groundwork for some of the most advanced statistical models ever developed in the industry.\nResponsibilities:</p><p>* Build database and web server applications that scale to store and retrieve an enormous amount of data</p><p>* Define/build an API to feed real-time data to an analytics engine and into a customer-facing interface</p><p>* Develop debugging and monitoring systems customized for a single piece of hardware\n* Diagnose and solve hard problems as we deploy and scale</p><p>* Gain an understanding of the market to see the impact of the tools you develop</p><p>Requirements:</p><p>* Deep understanding of Linux file system architecture</p><p>* Knowledge of cloud hosting and storage services (AWS, etc.)</p><p>* Proficient in at least one of the following: Java, Ruby, Python, C/C++, or PHP</p><p>* Experience in databases such as MySQL, PostgreSQL, MongoDB, Hadoop, or Couchbase</p><p>------------------------------------------------------------</p><p>Data Scientist</p><p>Correlate data from thousands of connected devices to build mathematical models of complex natural phenomena.  Develop state estimation and control models based on real world measurements, and oversee the implementation of those models across our network of devices.  Be a part of the core team in a world-class technology organization.</p><p>Responsibilities:</p><p>* Mine large amounts of data for insights into complex and highly variable systems</p><p>* Build mathematical models that incorporate predictive analytics and self-learning control algorithms so we are constantly improving our performance</p><p>* Work closely with our designers and engineers to implement your ideas in the real world</p><p>* Develop the IP and proprietary models that will maintain our competitive edge</p><p>Requirements:</p><p>* Expert knowledge of statistical data modeling tools and mathematical software (R, MATLAB, Mathematica, etc.)</p><p>* Experience building web applications and server side frameworks that can bring your models to life (Ruby, NodeJS, Scala, etc.)</p><p>* Passion for debugging and iterating to make robust code and models</p><p>* Self-starter: learn new languages and techniques on the fly to account for new problems</p><p>To apply, please send a resume and a description of yourself to andy@locicontrols.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3584308, 
        "location": "Boston, MA", 
        "lon": -71.0597732, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828523", 
        "user": "andy_campanella"
    }, 
    {
        "address": "Montreal, QC, Canada", 
        "country": "CA", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Auto123 - Montreal, Canada - 2 Backend and 1 Frontend Developers<p>== Who we are ==</p><p>We're a team of 10 highly-trained but still fun developers building a new car dealership web platform that's going to power the web sites of our hundreds of clients across Canada.</p><p>We're working closely with a product team (marketing, design) and a production team (HTML programmers).</p><p>== Why it's interesting? ==</p><p>- Build a high-performance responsive web framework that is heavily customizable</p><p>- Connect to 10 legacy DBs and render a page under 50 ms</p><p>- Build a platform, work on API usability and interact with users to improve it</p><p>- Work on the automated deployment and monitoring of hundreds of web sites and web applications each week</p><p>If your pupils dilated at least once while reading, it would be interesting for both of us to work together :-)</p><p>== How we do it ==</p><p>- The infra team uses puppet, Fabric, nginx, and uWSGI.</p><p>- The backend team uses Django, celery, PostgreSQL, redis, memcached.</p><p>- The frontend team uses SASS, Compass, Backbone.js, and a heavily modified version of Twitter Bootstrap.</p><p>We love code reviews, daily standup meetings, campfire, contributing to open source, and paying for education (code school anyone?).</p><p>We hate long meetings, code without test, vendors selling things we did not build yet.</p><p>== Perks ==</p><p>- A ping pong table and some nerf guns (if that's your thing).</p><p>- Research and Development (we have a research grant with McGill University)</p><p>- A big office with wooden floors, brick and stone walls, located in the Old Montreal.</p><p>- Boring but important stuff like health insurance!</p><p>If you are interested, contact me at bdagenais@auto123.com with your resume and optionally, your github profile. Bonus points for bribes like github stars on my personal (<a href=\"https://github.com/bartdag/\" rel=\"nofollow\">https://github.com/bartdag/</a>) or industrial repositories (<a href=\"https://github.com/auto123/\" rel=\"nofollow\">https://github.com/auto123/</a>).</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 45.5086699, 
        "location": "Montreal, Canada", 
        "lon": -73.55399249999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828479", 
        "user": "St-Clock"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">If you could work anywhere, what would you do?<p>- Wouldn't you want to work towards genuinely making the world a better place?</p><p>- Wouldn't you want to work in a close-knit team alongside some of the brightest engineers in the industry?</p><p>- Wouldn't you want to work on solving interesting problems that haven't been solved before?</p><p>---</p><p>At Khan Academy, I truly believe that you can find all of those things and more. We're a small, 50-person nonprofit tech startup making a big difference in the world. A few weeks ago, we found this great story through the fascinating blog \"Humans of New York\" – please take a moment to read it:</p><p><a href=\"http://www.humansofnewyork.com/post/64412654576/i-struck-up-a-conversation-with-him-and-he\" rel=\"nofollow\">http://www.humansofnewyork.com/post/64412654576/i-struck-up-...</a></p><p>This is just one story, but every month we hear about hundreds of lives that we've transformed, and there are thousands more we don't hear about.</p><p>Lots of people know us for Sal's videos, but we also have hundreds of videos by other teachers and a huge library of math practice exercises. Our 100,000+ practice problems have been done over 1.5 billion times total. That's a huge number.</p><p>This gives us the ability to study learning in a way that no one has previously been able to do. We've run tests which show that students learn more when they're advanced quicker by a custom machine-learning algorithm [1]. As I write this we're running dozens of A/B tests to learn what we can do to make people learn more, from testing how review scheduling affects accuracy to simply testing different teaching styles.</p><p>Whether you're a machine learning guru or you take pride in perfecting UI details for a dropdown menu [2], we have something for you. You'll be working alongside a small team with the best in the business – though we have \"celebrity\" devs like jQuery creator John Resig and Google's first employee (and former Director of Technology) Craig Silverstein, we have many more you haven't heard of but who are just as awesome.</p><p>---</p><p>I'm going to put in a special plug for mobile: Around 20% of our traffic comes from phones and tablets but we have only two people (me and one other person) working on our apps right now. Our iOS app is fairly basic, but it already has a few million downloads. We want to make it awesome. If you're a mobile developer we can build a great team around, <i>please</i> reach out. You can't find this sort of opportunity in very many places.</p><p>We're hiring engineers (web, mobile, data science), product designers, a community manager, and more. Oh, and if you want to have a great summer (or fall or spring) building real features for real users, we're hiring interns too.</p><p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https://www.khanacademy.org/careers</a> directly (say you saw us on HN!) or feel free to email me at alpert+HN@khanacademy.org with any questions.</p><p>[1]: <a href=\"http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning\" rel=\"nofollow\">http://derandomized.com/post/51729670543/khan-academy-machin...</a></p><p>[2]: <a href=\"http://bjk5.com/post/44698559168/breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http://bjk5.com/post/44698559168/breaking-down-amazons-mega-...</a></p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827556", 
        "user": "spicyj"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">iOS Engineer - Quizlet (<a href=\"http://quizlet.com/jobs/ios-engineer\" rel=\"nofollow\">http://quizlet.com/jobs/ios-engineer</a>) - San Francisco, CA<p>We're looking for someone to start and lead our iOS team as our first iOS engineer. We've put together a killer team across web, infrastructure, android, design, support, but iOS is still open. We would love someone strong enough to lead a team that should grow to 3-4 in the next 6-9 months.</p><p>Quizlet helps students practice what they're learning. Students absolutely adore us, just read the twitter search for Quizlet. Quizlet is a top 100 Website in the U.S. (20m uniques/mo), and during school our current iOS app is always in the top 2-3 for education. We are one of the few education companies succeeded in going directly to students, as opposed to selling through schools and districts. We have big plans for building learning tools that truly empower kids and make them enjoy the learning process.</p><p>Applications to jobs@quizlet.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828510", 
        "user": "asuth"
    }, 
    {
        "address": "Irvine, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Oculus VR - <a href=\"https://careers.oculusvr.com/\" rel=\"nofollow\">https://careers.oculusvr.com/</a> - Irvine, CA<p>Help us bring Virtual Reality back! Oculus is up to around 60 people (primarily engineers), and we are expanding quickly. In addition to a huge variety of positions in Irvine, CA, Oculus is looking for software engineers in Dallas, Tx.</p><p>A few of the positions that are especially important to us right now are:</p><p>* Systems and Drivers Engineer - We're looking for people interested in designing and writing cross platform interfaces and drivers for hardware we're building.</p><p>* Senior Android Engineer - We're looking for experts in kernel, system level, and/or graphics programming on Android in both Dallas and Irvine.</p><p>* Embedded Systems Engineer - We need hardware hackers in Irvine to help define, prototype, and program the systems going into future projects.</p><p>* Computer Vision Engineer - We're looking for engineers with a strong 3d math background and experience with computer vision research and algorithms.</p><p>* Senior Audio Engineer - We're looking for an audio expert with experience with positional audio and HRTFs.</p><p>The full set of job listings you can apply to is at <a href=\"https://careers.oculusvr.com/\" rel=\"nofollow\">https://careers.oculusvr.com/</a></p><p>You can also email me directly at nrp@oculusvr.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 33.6839473, 
        "location": "Irvine, CA", 
        "lon": -117.7946942, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827976", 
        "user": "nrp"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Factual is currently hiring engineers and data lovers of all levels in the SF Bay Area, Los Angeles, and Shanghai.<p>Factual’s location platform enriches mobile location signals with definitive global data, enabling personalized and contextually relevant mobile experiences. Built from billions of inputs, the data is constantly updated by Factual’s real-time data stack. We were recently named one of \"50 Disruptive Companies in 2013\" by MIT Technology Review. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Trulia, and Newsweek.</p><p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. A great example is one of our most recent products, Geopulse Audience, which stands at the intersection of high quality places data and large scale analysis of user geo-data: <a href=\"http://www.factual.com/products/geopulse-audience\" rel=\"nofollow\">http://www.factual.com/products/geopulse-audience</a> .</p><p>If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure (<a href=\"http://www.factual.com/jobs/clojure\" rel=\"nofollow\">http://www.factual.com/jobs/clojure</a>), machine learning, NLP, algorithm design, or Hadoop.</p><p>You can email me personally at jake@factual.com, or view our job postings and apply directly via Jobvite:</p><p>Los Angeles/SF Bay Area Software engineer: \n<a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&amp;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&amp;s=Hackernews</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828472", 
        "user": "jboggan"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Justin.tv / San Francisco / Full-stack engineer.<p>Two years ago Justin.tv created Twitch, a website that's become the most successful application of live streaming video so far.  Now we're working on doing the same thing again, for a different niche.  We have access to the impressive resources of the Twitch juggernaut, but Justin.tv is still a small and largely independent group, so we get to make our own rules when we want to get things done quickly.  It's easily the most fun I've had in my career, and I think the other guys on our team would say the same.</p><p>Contact: bill@justin.tv</p><p>More information: <a href=\"http://www.jobscore.com/jobs/justintv/full-stack-software-engineer/barWKYuJ0r47u0eJe9fLhG?name=LinkedIn&amp;sid=69\" rel=\"nofollow\">http://www.jobscore.com/jobs/justintv/full-stack-software-en...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827663", 
        "user": "abstractbill"
    }, 
    {
        "address": "Bellevue, WA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Planetary Resources - Bellevue, WA - Full time<p>Planetary Resources, Inc (PRI), the asteroid mining company, is seeking a Flight Software and Ground Software Engineer (a combined role) for the development of innovative spaceflight products and support systems.</p><p>PRI’s vision is to mine near-Earth asteroids for raw materials, ranging from water to precious metals through the rapid development of innovative and cost-effective exploration technologies. Resource extraction from asteroids will deliver multiple benefits to humanity and grow to be valued at tens of billions of dollars annually. The effort will tap into the high concentration of precious materials found on asteroids and will provide a foundation for further space exploration and a sustainable supply of raw materials to the ever-growing population on Earth.</p><p>As a software engineer, you will be responsible for creating the software products that enable PRI to deploy and operate state of the art robotic spacecraft. These software products cover the full spectrum of platforms and applications, from mission critical assembly-level code running on an embedded microprocessor to cloud-based high performance data processing.</p><p>Most work is in C++.  Experience in any of: C, Javascript, Python, SQL, Assembly for x86, ARM, or microcontrollers helps.</p><p>Apply online: <a href=\"http://www.planetaryresources.com/careers/\" rel=\"nofollow\">http://www.planetaryresources.com/careers/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.610377, 
        "location": "Bellevue, WA", 
        "lon": -122.2006786, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828070", 
        "user": "typpo"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Weft - <a href=\"http://weft.io\" rel=\"nofollow\">http://weft.io</a> - Boston MA. INTERN or REMOTE are both welcome!<p></p><pre><code>  ===========================\n  ====== What we do =========\n  ===========================</code></pre>\nWe're Waze for Cargo. Building hardware to put inside of shipping containers so our customers get realtime visibility into their supply chain. We're then taking the info we get from the hardware and figuring out where the bottlenecks in the supply chain are, predicting whether or not a shipment is going to make it to its destination on time, and dynamically rerouting/rescheduling shipments so that we can optimize the system as a whole. Really neat stuff.<p></p><pre><code>  ===========================\n  ===== How we do it ========\n  ===========================</code></pre>\nWeb stack -&gt; clojure (immutant) + HANA (really scary database on crack) -- we use middleman + enlive (and a bit of hiccup) for templating<p>Algorithms -&gt; a dizzying mixture of oldschool and newschool techniques ;-)</p><p>Hardware -&gt; prototyped with arduino, still using atmel uC but no longer arduino-ey. Manufacture-ready. In the process of sourcing for large scale manufacturing. Have some pilots running.</p><p></p><pre><code>  ===========================\n  ====== And the rest =======\n  ===========================</code></pre>\nWe've got some very interesting partners and customers (ranging from telcos to enterprise software providers to regional and international logistics companies).<p>Looking for help at every point in the system (hardware, firmware, frontend, backend, algorithms, mobile, etc).\nIf this sounds interesting, please shoot me an email at marc@weft.io!</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827564", 
        "user": "speek"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SEEKING WORK -freelance/remote -\nSkills:\n - ASP.NET\n - NodeJS \n - SQL Server\n - PostgreSQL\n - HTML5\n - Javascript\n - CSS\n Contact mac1175@gmail.com for more info.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828534", 
        "user": "mac1175"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">PagerDuty - San Francisco and Toronto<p>We're growing, our customer base is growing, and the number of interesting technical problems are growing. We have an obsession with building highly available and reliable services for our customers. I'm specifically hiring for infrastructure automation engineers, but we're hiring at every layer of the stack. We are also looking for a strong leader to head up our backend engineering team in SF. You can ping me directly if interested or apply at pagerduty.com/jobs</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828507", 
        "user": "arupchak"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Codeable (<a href=\"https://codeable.io\" rel=\"nofollow\">https://codeable.io</a>) - REMOTE<p>We're looking for a seasoned Rails developer with extensive knowledge not only on Rails but on building APIs in particular. Our product is an online outsourcing platform for WordPress, called Codeable. It's built from two main components: AngularJS for the frontend (yes, we're building a single page app) and Rails as the API endpoint.</p><p>With everything we do, we strive for quality, so we have a full money-back guarantee to clients and all our contractors are hand-picked to ensure only the best guys are working on small tasks that WordPress-based website owners get solutions to their problems in a timely manner and the solution is the best possible.</p><p>Requirements:\n- You love programming\n- You love learning new and exciting technologies and approaches\n- You practice TDD\n- You don't compromise when it comes to quality of code\n- You're keen on Scrum/Agile approach to development\n- You have an internet connection :)\n- You're a team player, there's no \"me\" at Codeable\n- A Skype account since we'll do most of the communication with it</p><p>Why work for Codeable?\n- We offer a competitive salary\n- We're a small, but passionate team of developers\n- Your work will have an immediate and measurable impact\n- You can work from home, favourite coffee bar or anywhere you prefer\n- We follow agile methodology, so you won't be bothered during sprints\n- You'll have a say in most tech decisions we make</p><p>Our tech stack:\n- Rails API backend (with the most commonly used gems, such as Devise)\n- AngularJS frontend with SCSS stylesheets\n- Hosted on Heroku + our own servers\n- Websockets for realtime browser to service communication\n- RSpec for testing + continuous integration\n- Paypal + Paymill for payment processing\n- Redis, PostgreSQL for data storage</p><p>Send an application to tomaz@codeable.io and include your past, Rails-related references</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828397", 
        "user": "tzaman"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">FULLTIME - Software Engineers in San Francisco, CA\nRentlytics, Inc - <a href=\"http://rentlytics.com\" rel=\"nofollow\">http://rentlytics.com</a><p>Apartment Investors are overwhelmed by their data, and the giants are focused on big-data solutions, but reality says otherwise.  Most investment funds have a small data problem, they cannot make sense of 100's of megabytes of data.  That is why off-the-shelf business intelligence solutions misses the problem completely.  We're developing the solution our customers have been clamoring for.</p><p>Join our team of 5 people, and come make a big difference in an industry of dinosaurs.  Our existing customers are all very happy, and we have a ton more waiting for their rollout of the software.  We use Python/Django/Postgres on the backend and CoffeeScript with Backbone.Marionette on the frontend.  Our team is based in SF, but we're happy to relocate you.</p><p>Get in touch: phil@rentlytics.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828443", 
        "user": "pplante"
    }, 
    {
        "address": "Berlin, Germany", 
        "country": "DE", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Berlin, Germany (local only)<p>Red Pineapple Media GmbH</p><p>PHP DEVELOPER / Laravel</p><p>We're a Berlin-based online advertising company seeking a skilled PHP backend developer. We're looking for someone to help us build a new video advertising product for the mobile, desktop and gaming markets. You'll be working in an international team in one of the top European startup cities.</p><p>We're using a modern web development stack powered by PHP's recent renaissance. Familiarity with the Laravel 4 framework is a big plus, but PHP developers experienced in other modern web frameworks are encouraged to apply as well.</p><p>Other than Laravel, the technologies we use include PHPUnit, EC2, Vagrant, Backbone and ExtJS.</p><p>Contact: echo 'bmFiaWxhQHJlZHBpbmVhcHBsZW1lZGlhLmNvbQo=' | openssl base64 -d</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.52000659999999, 
        "location": "Berlin", 
        "lon": 13.404954, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828458", 
        "user": "loevborg"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - REMOTE (We're a small distributed team of 16 people (5 engineers) across the US, UK, Hong Kong, Taiwan, Sweden and Australia)<p>We'd love for you to come join Buffer for the fun ride. We have over 1.1 million users and our annual run rate is over $2m. There are some super interesting challenges ahead, as we focus on Buffer for Business.\nWe're looking to expand our engineering team with the following open positions.</p><p></p><pre><code>    * Reliability Hacker (Devops engineer) \n    * Happiness (Support) Engineer\n    * Backend Hacker\n</code></pre>\nHere are some key stats about our technology and scale.<p></p><pre><code>    - we have over 150k monthly active users. \n    - 8000+ API clients. Most popular: Feedly, IFTTT, Pocket, Instapaper \n    - we release changes several times a day - we have an entirely data-driven process, \n      with Einstein and Buffer-Metrics, our custom built a/b testing and \n      metrics tracking framework. \n    - Some of the tech we work with: PHP, Python, MongoDB, AWS (Elastic \n      Beanstalk, Elasticache, SQS), Backbone.js, Grunt.js, Android, iOS.\n    - More stats and stack details here:\n      http://overflow.bufferapp.com/2013/08/01/scaling-buffer-in-2013/\n</code></pre>\nWe're a small team of driven hackers and happiness heroes (our support people). Just like you, we're excited and passionate about engineering challenges and have some interesting architecture and scaling problems we work on.<p>If you're interested in coming on board, you’ll:</p><p></p><pre><code>    - work closely with Sunil on technical architecture and Joel on product. \n    - ship to thousands of users and iterate quickly \n    - work with our metrics team to make smart changes \n    - be friendly and comfortable talking directly to customers on issues and features \n    - be a happy, positive-minded and kind person who has a great approach in dealing \n      with others \n    - be a Buffer user \n    - be anywhere in the world, and if you'd like, you have help and support from us \n      to move to where you want to be \n    - have experience working with another startup or building side projects \n      before (would be awesome, it’s cool if not)\n</code></pre>\nSome aspects of Buffer culture that makes us a little different:<p></p><pre><code>    - we are totally transparent. We raised $450k, we currently have over 1.1 \n      million users and generate $195k/mo. Ask me anything else! \n    - within the company, all salaries and equity are open and we have a formula \n      for the distribution. \n    - we're all very focused on self improvement \n    - we have daily standups where we discuss our current improvements. This could \n      be waking up earlier, starting public speaking, blogging, exercise, learning \n      a language, etc. \n    - here's our culture deck: http://www.slideshare.net/bufferapp/buffer-culture-03\n</code></pre>\nSalary: 88k-110k depending on location (living costs) and experience. (<a href=\"http://99u.com/articles/15527/the-age-of-salary-transparency\" rel=\"nofollow\">http://99u.com/articles/15527/the-age-of-salary-transparency</a>)<p>Equity: 0.5-1%</p><p>If this sounds fun, let's chat. Send me a note about yourself, why you’re interested in Buffer, and any relevant links (Github profile, projects and background): <a href=\"http://jobs.bufferapp.com\" rel=\"nofollow\">http://jobs.bufferapp.com</a></p><p>- Email our CTO Sunil thenexthacker@bufferapp.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Hong Kong, Taiwan,", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827856", 
        "user": "leowidrich"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">The Social Gaming Company / London / Full-time / Python / Team Leader<p>This is a great opportunity to work with a team that are using interesting technology to work on interesting problems. The main pre-requisite is a song grasp of Python. The more background you have in data mining the better. There's an expectation that you'll already have worked with a lot of different technologies just because it's the sort of thing that interests you. It's a great chance to put your stamp on a product and solve technical issues in the way that you think is best.</p><p>I've been working with them on a part time basis for a couple of years now. They're growing and unfortunately I'm unable to meet their needs (due to other obligations). They need someone to come in and take ownership of the product and help them build a development team around it.</p><p>They're great people to work with; passionate, reasonable and realistic. They understand the challenges of software and working with data - especially other people's.</p><p>More information about the role is provided on their site [0]. You could either contact them directly, or if you'd prefer to hear more details from me, you can contact me through the information in my profile.</p><p>[0] <a href=\"http://thesocialgamingcompany.com/careers.html\" rel=\"nofollow\">http://thesocialgamingcompany.com/careers.html</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828385", 
        "user": "aidos"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">42Floors (<a href=\"http://42floors.com/\" rel=\"nofollow\">http://42floors.com/</a>)<p>San Francisco, CA</p><p>We're looking for extremely talented people to help us bring the commercial real estate industry into the 21st century.</p><p>Hiring experienced full stack engineers, back-end engineers, inside salespeople, and account managers. (Apply: <a href=\"http://42floors.com/jobs\" rel=\"nofollow\">http://42floors.com/jobs</a>)</p><p>All positions are full time, SF-based.</p><p>YC W12, 17 full time employees, $18m in funding from NEA, Bessemer, Thrive, SV Angel, etc. (<a href=\"http://42floors.com/investors\" rel=\"nofollow\">http://42floors.com/investors</a>)</p><p>Learn more about us here: <a href=\"http://42floors.com/press\" rel=\"nofollow\">http://42floors.com/press</a> or email me with any questions!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828345", 
        "user": "gatsby"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">London, UK -part time/intern (sorry, no remote work, and we can't help with visas)<p>NBCUniversal - Research Assistant, Data Science &amp; Predictive Analytics.</p><p>We're no startup. We're the special operations team for the corporate world.</p><p>We're hunting for engaging problems and opportunities to create real value for our marketing, sales, and research teams throughout our international businesses (television, movies, news, and home entertainment).</p><p>You'll be helping us on a variety of problems - little ones like writing a script to hack a third party's website and collect info on our products, to large ones like creating a model that can show our products value through time. In all cases you'll be working closely with the a senior engineer and either senior corporate management or a business unit in TV, film, or news. A typical week might look like this:</p><p>* Meet with the head of sales for a UK TV channel, learn about a problem they're facing trying to get an accurate value for advertisement slots.</p><p>* Discuss what you learned with the rest of team. Someone suggests that a nearest-neighbors regression on data from the marketing team might help.</p><p>* A senior dev helps you implement the algorithm and a UI for the sales team to use it.</p><p>* Spend some time with the sales team to see if it's creating any value, look for improvements.</p><p>What we use (We list this to tell you what we're like, not to tell you what languages we expect to see on a CV):</p><p>* Racket. We're big fans lisp and functional programming.</p><p>* Bash. We create a lot of value with small dirty hacky shell scripts, and we aren't shy about it.</p><p>* Whatever gets the job done, and whatever we think might be fun to use. Python, R, Javascript, Hadoop, EC2. We even wrote code in Fortran once (we don't like to talk about it.)</p><p>Who we're looking for:</p><p>Most importantly, you should be an intelligent problem solver who wants to apply whatever programming and maths knowledge you have to real world problems. We're not fussed about what languages are on your CV.</p><p>You have some familiarity with functional programming, machine learning, and linux/bash scripting, and you're eager for a chance to use it on real-world problems with support from other programmers. Given the predictive modeling angle, you're probably studying or have studied maths, stats, or even physics.</p><p>These are two assistant/internship positions for students looking for experience while doing their degree. Alternatively, if you can take on several projects in a full time role, please get in touch, too. We're pretty flexible.</p><p>Interested? My contact details are in my profile. Get in touch. I'd love to hear from you.</p><p>Apologies if you've contacted me before from outside London and I didn't get back to you. :(  If you contacted me from London and didn't hear back, please do so again!</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828195", 
        "user": "mebassett"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Octopart - <a href=\"http://octopart.com\" rel=\"nofollow\">http://octopart.com</a> - NYC<p>We're the electronic parts search engine that is opening up all technical product data on our website and via API to enable the next generation of hardware design tools.</p><p>We're a team of 9, we're based in Manhattan, and we've been profitable since 2010.</p><p>We're looking for a JavaScript and/or Python expert with at least an interest in electronic components. Tell us about yourself: jobs@octopart.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828265", 
        "user": "sam"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">edo Interactive - Chicago/Nashville - <a href=\"http://edo.theresumator.com/\" rel=\"nofollow\">http://edo.theresumator.com/</a><p></p><pre><code>  * Data Warehouse Engineer, Nashville - Hadoop and Pentaho\n  * Analytics Manager, Chicago - marketing models and model governance,\n    lead team of 3-5 analysts\n  * Data Scientist, Chicago\n  * Data Analysts, Nashville or Chicago (interns should be welcome - working on it)\n</code></pre>\nWork with gobs of anonymized credit/debit card transaction data, using Hadoop/Hive/Impala, Postgres, Pentaho, R, Tableau, etc.<p>We're a 100-person funded startup providing an easy way to personalize offers and make them automatically available through credit or debit cards and mobile devices. We work with major national advertisers, and with 180+ banks and three of the top six card issuers. TechCrunch called us the anti-Groupon - we take the hassle out of deals. See how it works at <a href=\"http://www.edointeractive.com/type/product-demos/\" rel=\"nofollow\">http://www.edointeractive.com/type/product-demos/</a> .</p><p>Apply at the website above or email me (not all these specific roles are posted yet) - say you came from HN. Happy to answer questions at jennifer.berk at edointeractive.com.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828508", 
        "user": "jcberk"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">San Francisco, CA - Zenbox. Software Engineer. [LOCAL | RELOCATE OK]<p>We're a YC company wrangling SaaS to work together (as they should), starting by bringing the biggest apps our customers use right into Gmail. We've been growing our team over the past few months, and looking to add even more awesome people. We work with dozens of API's to show our users profiles of their customers without having to jump out of the email flow - imagine having <a href=\"http://www.youtube.com/watch?v=WtzqRSlgqkw\" rel=\"nofollow\">http://www.youtube.com/watch?v=WtzqRSlgqkw</a> available when helping customers.</p><p>Thousands of people use it every day for hours on end, and are happy to pay for it to make sure they can continue using it. But there's still so much polish and improvement possible.</p><p>We also spend time improving our tooling, and tools for other developers. As one example we've recently vastly improved the source-map capabilities of the ClojureScript compiler and added reified keywords to the runtime to make ClojureScript a better citizen on the web. We do it because we want to give back to the communities that have enabled us, because it helps us, and because it's interesting.</p><p>Looking for an engineer who loves the craft, who cares about building product, and is excited about helping customers. We're building a team that's able to reduce complexity others balk at into simple, easy to reason about system, so we can continue to move quickly and delight both customers and ourselves.</p><p>This is both UI and backend work.</p><p>Languages: Clojure, Clojurescript, Javascript. sean @ zenboxapp <a href=\"https://www.zenboxapp.com\" rel=\"nofollow\">https://www.zenboxapp.com</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827958", 
        "user": "sgrove"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Austin, TX | San Francisco, CA | New York City, NY -- Full Time<p>Bazaarvoice is something you interact with daily if you ever shop online. Come help us build services that are used by over 450m unique people per month. We're 100% cloud, operating in three AWS regions, and our internal cloud tools gives Netflix a run for their money (and are itching for you to help open source).</p><p>We're hiring for just about every engineering position: developers, devops, dev managers, QA, etc.</p><p>Contact me if you have questions about BV, questions about positions, or just want to chat tech: victor@bazaarvoice.com | @victortrac</p><p>View our open positions: <a href=\"http://keepaustinbazaar.com/\" rel=\"nofollow\">http://keepaustinbazaar.com/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828483", 
        "user": "victortrac"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Custommade (<a href=\"http://www.custommade.com/\" rel=\"nofollow\">http://www.custommade.com/</a>) - Cambridge, MA<p>Full-time devs. Frontend Backbone.js / jquery. Backend Python work, would likely be working with Django. Looking for more senior people, as well as a tech lead for the team. Also, QA people.</p><p>We're a two-sided marketplace that does matchmaking between professional artisans / craftsmen and buyers. You post your dreams, we find someone to make it real. People come up with some crazy ideas like a custom made quidditch set / proposal ring: <a href=\"http://blog.custommade.com/portfolio/a-very-harry-potter-proposal/\" rel=\"nofollow\">http://blog.custommade.com/portfolio/a-very-harry-potter-pro...</a> Or and r2d2 engagement ring: <a href=\"http://blog.custommade.com/portfolio/r2d2-engagement-ring/\" rel=\"nofollow\">http://blog.custommade.com/portfolio/r2d2-engagement-ring/</a> Or a portal one: <a href=\"http://blog.custommade.com/portfolio/not-your-typical-engagement-ring-custom-jewelry-for-gamers/\" rel=\"nofollow\">http://blog.custommade.com/portfolio/not-your-typical-engage...</a> We're a small, tightly knit eng team. Boilerplate about stack / team here: <a href=\"http://engineering.custommade.com\" rel=\"nofollow\">http://engineering.custommade.com</a> Various Engineering Positions open: <a href=\"http://www.custommade.com/careers/\" rel=\"nofollow\">http://www.custommade.com/careers/</a></p><p>-------------------</p><p>We're funded by Google Ventures and a ton of others: <a href=\"http://www.crunchbase.com/company/custommade-ventures\" rel=\"nofollow\">http://www.crunchbase.com/company/custommade-ventures</a> so paying you well is not an issue. We recently raised an 18 million series B! We're growing, and with that comes scaling challenges. But it's all part of the fun. We have a great team and a great environment that focuses on customers and product development. When I'm working on product stuff, I get to collaborate with product / UX / support people day to day to build a product that meets a real business need, and makes everyone happy. But when I just need to bang out some code, people leave me alone. When I'm working on platform or architectural stuff, I get great advice and feedback from my coworkers. Expressing opinions and having discussion is encouraged. Friday afternoons are refactoring / innovation day to scratch your good code itch. Work / life balance is great. Bureaucracy is at a minimum.</p><p>Devs get a macbook pro, a huge thunderbolt display, and an Aeron chair.</p><p>We love contributing to Open Source, here is a list of what we've released so far, with more to come: <a href=\"https://github.com/SawdustSoftware\" rel=\"nofollow\">https://github.com/SawdustSoftware</a> We also regularly participate in and sponsor the Boston Python group, which is the largest python user group in the world. I've spoken there twice so far. We also often help stream the event for them, check it out here: <a href=\"http://www.youtube.com/bostonpython/\" rel=\"nofollow\">http://www.youtube.com/bostonpython/</a> Tech blog here: <a href=\"http://engineering.custommade.com/sawdustsoftware/\" rel=\"nofollow\">http://engineering.custommade.com/sawdustsoftware/</a></p><p>You're a low-ego programmer who is always learning, has pushed code to production innumerable times, and doesn't cringe at the prospect of collaborating with a team of non-techies every so often. You know the modern web stack well, and specialize in at least one part of it. Get in touch with our hiring person at ellen -at- custommade-dot-kom. Let her know \nthat \"Mali\" sent you.</p><p>==================</p><p>If you have any eng-related questions, you can figure out how to get to my email.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827638", 
        "user": "makmanalp"
    }, 
    {
        "address": "Detroit, MI, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Benzinga is looking for a Django developer, a front end dev, and a Drupal dev either REMOTE or local full-time in Detroit, MI.<p>We're a financial media company, a poor man's - lest we say everyday man's - Bloomberg competitor, and a financial product SaaS all forged together into a powerful trident that is attacking the high seas of Wall Street in a relentless pursuit of transparency.</p><p>And conquer we shall! We've grown 100% quarter over quarter all this year. Our team has surged to 30+ people and the waves of revenue washed together to form a rushing roar with just one of our products going from nothing to $100k/month in just 9 months.</p><p>Being a media company we find our way into all kinds of cool stuff. Our office is furnished with things like a $3000 high-end bed that was sent to us to review. We got to talk to and get pictures with Warren Buffett and Lloyd Blankfein (CEO of Goldman Sachs)  when they came to Detroit last week.</p><p>But, you interject, finance is one of the toughest startup seas to sail upon! The old boys club runs an ironclad ship with no visible decks for boarding. Avast! We've built a battering ram of a business in just a few short years that has pummeled its way deep into the heart of Wall Street. Old Ironsides has warmed itself to Benzinga and once a taste the thirst cannot be quenched.</p><p>We've recently became Microsoft's premier finance partner alongside 3 other  companies, all worth over a billion dollars and established for years. As of this Christmas season we will be installed by default on 500 million desktops and tablets via Windows 8 Finance. No download necessary. That's right mateys, we're in the source code.</p><p>And if you happen to trade or invest yourself you'll find us inside almost all of the major brokerages in the US.</p><p>So, where do you fit in this rigging, you swashbuckling scalawag? Well, our team is crazy ambitious, motivated, and experienced with shaking shit up. If you know your tech, and want on deck this is the place to do it. Your exact technical background and language of choice doesn't matter as much as your motivation and your ability to adapt quickly. We are a young team and we're especially looking for sailors who've got some salt in their whiskers who can help us scale from millions to hundreds of millions.</p><p>Why be a ninja when you can be a pirate? This ship is forging a new course, send an email to dev-us@benzinga.com to board!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.331427, 
        "location": "Detroit, MI", 
        "lon": -83.0457538, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827787", 
        "user": "adambratt"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Binpress (500Startups '13) - <a href=\"http://www.binpress.com/jobs\" rel=\"nofollow\">http://www.binpress.com/jobs</a> - Mountain View, CA<p>Binpress provides a platform for developers to build profitable businesses from working on their open-source projects in the same mold as MySQL, Redhat, Magento and other commercial open-source solutions.</p><p>We are based in Mountain View and backed by 500startups and other respectables seed funds/Angels.</p><p>THE POSITIONS:</p><p>* Head of growth - We need someone with proven past experience in growing users and revenue through multiple acquisition channels to head our growth efforts.</p><p>* Content marketer - We're looking for someone who has a knack for creating great content in all media formats, and a track record for exposing that content to the relevant audience.</p><p>Positions are ideally onsite, but we will consider very strong applicants for remote work (at least initially - hopefully we can convince you to relocate later :)</p><p>COMPENSATION:</p><p>* A competitive salary</p><p>* A meaningful stake in the company</p><p>* Paid Health, vision and dental insurance.</p><p>* A chance to make a major impact on the company's future and success.</p><p>If you are interested in open-source and believe open-source developers should get paid - get in touch! Send us a message indicating what position you are interested in and why you would be a good fit, or apply through the link above.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828275", 
        "user": "adambenayoun"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Rentify - London, UK<p>We're on a mission to kill off high street letting agents and all the things they stand for: high fees, tenant rip-offs, and subscale economics.</p><p>We're backed by world class investors (Balderton Capital) and have a senior leadership team comprised of bright minds from Uber, Eventbrite, NBC/Universal, Apple, and Zopa.</p><p>This time last year our team was 4 people. Now it's 25. We're aiming to be 50 by the end of 2014. Good time to join and make a difference.</p><p>We are in the market for Rails engineers (Buf will doubtless post more thorough descriptions on here), PPC managers, an office manager, and more. Feel free to reach out on here (email address in profile) or via jobs at rentify dot com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828295", 
        "user": "georgespencer"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Eponym (New York, NY, USA)<p><a href=\"http://www.eponymous.co\" rel=\"nofollow\">http://www.eponymous.co</a></p><p>We're an eyewear company looking for engineers to help architect and build our API, which powers eyeglass orders for fashion brands. We are also looking for people to help us build our whitelabel eyewear software, and iterate on new UX features - we do a lot of AngularJS.</p><p>Our stack is Python (Flask) and MongoDB [1]. Including bits of Celery, nginx, and uwsgi. We do a lot of integration with the UPS (in fact, we maintain an open-source UPS library [2]).</p><p>We're building our API and internal dashboards (which we use heavily to process orders, eyewear prescriptions, customer information, gift cards, etc.) We white-label eyewear for other fashion brands; Classic Specs and Steven Alan are some of our brands. Email me!</p><p>jay@classicspecs.com</p><p>[1] <a href=\"https://github.com/classicspecs/Flask-MongoMyAdmin\" rel=\"nofollow\">https://github.com/classicspecs/Flask-MongoMyAdmin</a></p><p>[2] <a href=\"https://github.com/classicspecs/ClassicUPS\" rel=\"nofollow\">https://github.com/classicspecs/ClassicUPS</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827665", 
        "user": "memset"
    }, 
    {
        "address": "Morrisville, NC, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">FujiFilm Medical Systems - Morrisville, NC (sorry, no remote, relocation available)<p>Help us build a client-side framework for the next generation of medical imaging and medical information applications.</p><p>We need JavaScript experts to help us build a responsive (from 4 monitors workstations down to a smart phone) content and application framework. We’re all about high-performance JavaScript. We have a team dedicated to measuring the performance of every build.</p><p>Our challenges include:</p><p>* completely removing ActiveX from the enterprise medical world.</p><p>* Writing our own, faster versions of common JavaScript UI libraries.</p><p>* Writing JavaScript that runs on one window, and manipulates the DOM on another. Did you know that, in IE, you can’t invoke a constructor defined on one window from code loaded in another?</p><p>* Creating real-time messaging systems between browser windows, desktop apps, and servers across a large geographically distributed facility.</p><p>* Sharing the single JavaScript thread in a an N-window N<i>M widget application.</i></p><p> Hitting aggressive cold and warm start times.</p><p>We’re still building the first version, a performant MVP, but when we start V2, there will be plenty of new challenges like writing 3D image viewers in NaCL and using WebGL and Canvas to display interactive radiological images.</p><p>Send me an email if you are interested. I am the hiring manager for this team.</p><p>Here is a personal address I’m using to track responses: hn-fuji@beechtreetech.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 35.823483, 
        "location": "Morrisville, NC", 
        "lon": -78.8255621, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828266", 
        "user": "euroclydon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Quid (quid.com) - San Francisco - H1B welcome<p>This place has so much potential and great momentum with huge clients like Microsoft, Samsung, Visa, etc...</p><p>Our product combines advanced data visualizations, mathematical models, and data processing techniques to generate valuable insight for our customers. With only 12 developers, every developer's contributions matter a lot (seriously).</p><p>Check out one of our network visualizations (a news network about Lady Gaga =p): <a href=\"https://quid.box.com/s/kxc7hskuzokmd3f38c0w\" rel=\"nofollow\">https://quid.box.com/s/kxc7hskuzokmd3f38c0w</a></p><p>We are looking for a variety of developers including:</p><p>* Data science developer to apply computational algorithms and statistical methods to unstructured data</p><p>* Visualization developer pushing web browsers to the limits with 10,000+ node fully interactive networks</p><p>* Full stack application developer with a Javascript specialty</p><p>* Infrastructure developers to make provisioning of entire clusters a push button experience</p><p>Apply by emailing hn@quid.com with a resume/portfolio.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827934", 
        "user": "seekely"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Nutonian, Inc. (<a href=\"http://www.nutonian.com\" rel=\"nofollow\">http://www.nutonian.com</a>) - Cambridge, MA (Local Only)<p>Web Developer: <a href=\"http://www.nutonian.com/company/careers/web-dev/\" rel=\"nofollow\">http://www.nutonian.com/company/careers/web-dev/</a></p><p>Lets just get this straight, we are modern browser zealots. That's why we only support IE8+ (and yes, we actually mean that). No more clearfixes and negative margins here! Nutonian is looking for talented web developers help build our cutting edge application using modern iterations of front end technologies (HTML5, CSS3, without modernizr!). Our application is changing how people interact with and understand their data, and we need brilliant developers to help us realize this vision. We use the following technology stack: PureCSS, Snap.svg, backbone, handlebars, gruntjs, nodejs, casperjs and phantom.</p><p>Front End Developer: <a href=\"http://www.nutonian.com/company/careers/front-end-dev/\" rel=\"nofollow\">http://www.nutonian.com/company/careers/front-end-dev/</a></p><p>We are looking for engineers to architect and build the core application logic of our flagship application which allows our customers interact with their data in ways they can only dream of today. We strive daily to create beautiful code using modern software development methods, and you should too. We are a group of intelligent and motivated people at an early stage company pushing people's understanding of what an application delivered via a web browser can be. Our current technology stack includes jquery, backbone, underscore, handlebars, nodejs, gruntjs, casper, phantomjs, C/C++, and a smattering of QT.</p><p>Feel free to send along resume's and questions to nick@nutonian.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828421", 
        "user": "nickdoesdesign"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Scribd (YC '06), San Francisco - H1B, FULL-TIME, and INTERN are all welcome<p>Scribd (\"Netflix for eBooks\", top 100 website, 35 people) is hiring talented hackers of all kinds to help us build the library of the 21st century.</p><p>We've hired SIX full-time people and TONS of interns from these \"Who is Hiring\" threads ... it really works!</p><p>We're looking for people who want to work with:</p><p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)</p><p>* Javascript (well, we use Coffeescript)</p><p>* iOS</p><p>* Machine Learning / data mining / recommendations - think Netflix prize, but for books!</p><p>* Data analysis</p><p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you. We've hired people from these threads with everywhere from 0 to 10 years of experience.</p><p>We're profitable, very well funded and have a really fun office environment (go-karts + a rock climbing wall!). Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire, and we love hiring people with entrepreneur and startup ambitions. We are also always looking for international people interested in moving to the US and can help you secure a visa.</p><p>We just launched a service that's being called the \"Netflix for books\" and are really excited about it. Read more here: <a href=\"http://wrd.cm/1dJquzz\" rel=\"nofollow\">http://wrd.cm/1dJquzz</a></p><p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827855", 
        "user": "snowmaker"
    }, 
    {
        "address": "Leeds, West Yorkshire, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">----------- Pocketworks ---------<p>A tiny 7 man team.</p><p>We're about to start our own product with funding.</p><p>----------- WHERE ----------------</p><p>Leeds, UK.</p><p>INTERN person wanted, REMOTE considered if can visit often.</p><p>----------- TECH WE LIKE AND USE ---------</p><p>Node.js</p><p>Ruby on Rails</p><p>iOS</p><p>Android</p><p>Mongo</p><p>CouchDB</p><p>Java</p><p>Angular JS</p><p>----------- SEEKING ---------</p><p>An total geek who agrees with much of following</p><p>- I expect to earn £40,000 - £60,000 with my uber skills</p><p>- I experiment with new technologies in my spare time</p><p>- I'm at home writing UI code, middle tier code, db code, libraries</p><p>- I write iOS or Android apps for kicks</p><p>- I've played with Mongo, Couch and other storage tech</p><p>- I want to play with message brokers</p><p>- I love writing HTML, javascript and CSS</p><p>- I'm far more comfortable having my code under unit test</p><p>- I hate waiting for tests to run</p><p>- Every project feels like a hackathon</p><p>- I'm avoiding contracting £££ because it's more important to work with people and make products that make a difference long term</p><p>- I don't mind getting my hands dirty and helping out on boring jobs if the company needs it</p><p>- Git is easy</p><p>- I've been doing this for 7+ years. Still loving it.</p><p>- I enjoy a beer on Fridays and bantering about software</p><p>------------ NEXT STEPS ---------</p><p>Send some stuff to tobin@pocketworks.co.uk</p><p>- Github profile</p><p>- Sample code</p><p>- List of published projects you own (open source or otherwise)</p><p>- Photo and covering letter</p><p>Cheers</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 53.801279, 
        "location": "Leeds, UK", 
        "lon": -1.548567, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828433", 
        "user": "tobinharris"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">3Gear Systems - <a href=\"http://threegear.com\" rel=\"nofollow\">http://threegear.com</a> - San Francisco, CA\nContact: jobs@threegear.com<p>Bringing the 'Minority Report' user interface to reality, without the gorilla-arm.  We're a team of three research engineers developing fundamental, finger-precise hand-tracking and gesture recognition technology.  We're looking for two more engineers to join us with experience in some of the following:</p><p>Computer graphics engineer:</p><p>- Solid understanding of the practical aspects of the computer graphics pipeline, shaders</p><p>- Comfortable with 3D math: vectors, matrices, rotations, projection, etc.</p><p>- Solid understanding of computer systems: caches, low-level optimization</p><p>- Game development background ideal, user interaction design a plus</p><p>- Comfortable with C/C++</p><p>Computer graphics / computer vision research engineer:</p><p>- Strong optimization or machine learning background</p><p>- Experience implementing algorithms on 3D geometry or 2D images</p><p>- Solid understanding of computer systems</p><p>- Research experience ideal</p><p>- Comfortable with C/C++</p><p>Contact: jobs@threegear.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828289", 
        "user": "rywang"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">I just posted a link to a facebook status of Ladar Levison [1], who says that the Dark mail Initiative has been funded, and that he will soon be looking at resumes. I assume it can be of interest to people here on HN :-).<p>[1] <a href=\"https://news.ycombinator.com/item?id=6827595\" rel=\"nofollow\">https://news.ycombinator.com/item?id=6827595</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827945", 
        "user": "p4bl0"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">London -<p>I am looking to make contact with DevOps contractors and consultants - Puppet, Chef, Python, Sys Admin.</p><p>This is for some overflow work from myself which may be kicking off in the new year.</p><p>Please get in touch at bswootton@Gmail.com for an informal chat.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828222", 
        "user": "benjaminwootton"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Dropcam, downtown San Francisco, local only.<p>- \"What's going on at home while I'm away?\"</p><p>- We're just over 50 people, raised a $30MM Series C four months ago, and launched a new camera five weeks ago.</p><p>- We make our own hardware, which is in physical retail stores. (Apple Store, etc.)</p><p>- We're working on some really interesting connected home projects.</p><p>- All the usual youthful tech company perks.</p><p>Any smart, self-motivated, and flexible engineer will fit in here (we're hiring for many, many engineering positions), but we're particularly interested in experience with iOS, the open-source hardware movement, and/or computer vision.</p><p>eden@dropcam.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828454", 
        "user": "trevyn"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">San Francisco<p>Intrans</p><p>Ruby Engineers, Android</p><p>The last 50 years has seen the reinvention of almost every major industry except for one: Trucking. Intrans is here to change that by deploying the world's first mobile platform for on-demand freight shipping.</p><p>Over $30 billion dollars a month is spent trucking freight around the US. Without trucks, the country would grind to a halt overnight. In such a massive market, it's hard to believe that the entire industry today still runs on phones and fax machines. This means hundreds of millions of dollars worth of freight capacity goes unfilled every month due to the old-school inefficiencies of the industry.\nWe are changing that. We use our location-based technology to automatically match supply and demand.</p><p>If you're ready to transform the trucking industry, send your resume and GitHub profile to jobs@intrans.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828236", 
        "user": "seanmccann"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Knewton - New York, NY (Union Square) - full-time<p>Knewton's mission is to bring personalized learning to the world.</p><p>Knewton personalizes digital course materials by figuring out exactly what a student knows and what she should do right now. Knewton provides the tools and infrastructure needed to create continuously adaptive learning applications driven by real-time proficiency estimation, activity recommendations, analytics, and more.</p><p>Knewton has been recognized globally as a \"Technology Pioneer\" (World Economic Forum in Davos), one of the world's \"50 Most Innovative Companies\" (Fast Company), and one of \"The World's 100 Most Intriguing Entrepreneurs\" (Goldman Sachs). More at <a href=\"http://www.knewton.com/about/press/\" rel=\"nofollow\">http://www.knewton.com/about/press/</a></p><p><a href=\"http://www.knewton.com/careers/\" rel=\"nofollow\">http://www.knewton.com/careers/</a></p><p>---</p><p>Some specific openings:</p><p>* Senior Database Administrator, Systems Engineering - <a href=\"http://bit.ly/19bUVXm\" rel=\"nofollow\">http://bit.ly/19bUVXm</a></p><p>* Data Analyst - <a href=\"http://bit.ly/18fkQgB\" rel=\"nofollow\">http://bit.ly/18fkQgB</a></p><p>* Senior Software Engineer - Java/NoSQL - <a href=\"http://bit.ly/17zDdkD\" rel=\"nofollow\">http://bit.ly/17zDdkD</a></p><p>* Senior Software Engineer - Natural Language Processing - <a href=\"http://bit.ly/1b8rmJD\" rel=\"nofollow\">http://bit.ly/1b8rmJD</a></p><p>* Software Engineering Internship - <a href=\"http://bit.ly/1cTBTaP\" rel=\"nofollow\">http://bit.ly/1cTBTaP</a></p><p>* Senior Product Manager, Analytics - <a href=\"http://bit.ly/InFqoH\" rel=\"nofollow\">http://bit.ly/InFqoH</a></p><p>* Product Manager, API - <a href=\"http://bit.ly/ICsXy5\" rel=\"nofollow\">http://bit.ly/ICsXy5</a></p><p>* Business Development Professional - US/UK - <a href=\"http://bit.ly/18SeNCx\" rel=\"nofollow\">http://bit.ly/18SeNCx</a></p><p>* Technical Project Manager - Content Operations - <a href=\"http://bit.ly/1jXVDwx\" rel=\"nofollow\">http://bit.ly/1jXVDwx</a></p><p>--&gt; For more follow <a href=\"http://twitter.com/knewton_jobs\" rel=\"nofollow\">http://twitter.com/knewton_jobs</a></p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827573", 
        "user": "robbiemitchell"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Adventr - New York, NY - INTERN www.adventr.tv/jobs<p>SOFTWARE ENGINEER - BACKEND</p><p>We’ve developed an online video-editing suite and API-based delivery platform to build dynamic content for the web and TV. You'll have the opportunity to help scale the system to meet with our fast-climbing demand. You’ll do things on a high level such as:\nIntegrate our playback system with ad serving partners (Aol, Youtube, Spotify, etc.)\nHelp scale our video consumption and playback system\nIntegrate with relevant e-commerce and social network backends\nContinue to scale out our analytics platform\nHelp make our product more fun and valuable to our customers</p><p>We offer competitive compensation packages including generous equity options.</p><p>Requirements</p><p>3+ years experience building products for fast growing web or mobile products</p><p>Minimum 3+ years of experience with Python/Django, Ruby/Rails, or similar web frameworks</p><p>Bonus points for experience with Flash/ActionScript3 and/or HTML5 video</p><p>Extensive knowledge of Linux/Unix command line and system tools.</p><p>BS or MS in Computer Science or related field preferred</p><p>Comfortable in a small, intense and high growth start up environment</p><p>If interested, contact jobs@adventr.tv with resume and any other relevant details and we’ll connect from there!</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828267", 
        "user": "ryen"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">San Francisco, CA<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is the most advanced advanced analytics platform ever for web &amp; mobile applications. \nWe're profitable, with millions in monthly revenue, and we're backed by Andreessen Horowitz, Sequoia Capital, and Max Levchin.</p><p>ENGINEERING POSITIONS</p><p>We have two types of engineering positions available - systems and product.</p><p>Systems engineers[1] build and scale our infrastructure, and write mostly C, C++, and Python. These are the people working on our custom datastore. \nThis position requires at least 2 years of experience writing systems software. Solid C experience is a plus.</p><p>Product engineers[2] build the parts people interact with - reporting interfaces, APIs, dataviz stuff, and more - and write mostly Python, JS, and Less.\nThis position requires at least 2 years of software engineering experience, no specialization required. Solid JS experience is a plus though.</p><p>The engineering team is still small (8), and there's a lot of interesting stuff to do. Happy to talk details.</p><p>If you are interested, drop me a line - tim@mixpanel.com.</p><p>[1]<a href=\"http://mixpanel.theresumator.com/apply/CiOzuu/Software-Engineer-Backend.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/CiOzuu/Software-Engin...</a></p><p>[2]<a href=\"http://mixpanel.theresumator.com/apply/rhQrIj/Software-Engineer-Frontend.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/rhQrIj/Software-Engin...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827893", 
        "user": "trefn"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">HackerRank - <a href=\"https://hackerrank.com/\" rel=\"nofollow\">https://hackerrank.com/</a> - Palo Alto, CA &amp; Bangalore, India.<p>About:\nBuilding the olympics of programmers. HackerRank is building an engaged community of programmers across different domains of Computer Science (AI, ML, Databases, security, etc.)</p><p>We are witnessing a growth of 32.4% in the active users month over month and the retention rates are soaring. Here's an example for the week of Oct-28 (<a href=\"http://bit.ly/18vVfpJ\" rel=\"nofollow\">http://bit.ly/18vVfpJ</a>) - % of users who come back after week-2, week-3 &amp; week-4.</p><p>\"If 30% of users return to your site after 3 weeks, you're onto something\" - Bing Gordon. And we are much more than that after 4 weeks.</p><p>Investors: \nWe are a part of YC summer batch of 2011, backed by Vinod Khosla and a team of 28 growing incredibly fast in a huge market (<a href=\"http://on.wsj.com/17stW9f\" rel=\"nofollow\">http://on.wsj.com/17stW9f</a>)</p><p>Enterprise: Our enterprise product (white-labeled version) is used by some of the top tech companies (Facebook, Amazon, Square, Palantir, Evernote, Quora, etc.) for making their interview process effective. That's how we make money right now and we are going to hit a $1M in revenue very very soon.</p><p>Hiring: We are hiring for various roles (hackers, sales, marketing, PM's) at both the places. If you're interested, please send me your online profile or resume to vivek [at] hackerrank. It'll be one of the best decisions in your life. Looking forward!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828175", 
        "user": "rvivek"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">San Francisco, CA (full-time, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a></p><p>-------------------------------------------------------</p><p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to hear from you.</p><p>Voted Educational App of the Year by Apple. Funded by Sequoia Capital.</p><p>We're hiring in lots of areas! Here are a few:</p><p>-------------------------------------------------------</p><p>* Android Engineer - <a href=\"http://mindsnacks.theresumator.com/apply/35CRVW/Android-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/35CRVW/Android-Engi...</a></p><p>* Game Designer - <a href=\"http://mindsnacks.theresumator.com/apply/19JX7q/Game-Designer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/19JX7q/Game-Designe...</a></p><p>-------------------------------------------------------</p><p>To apply, visit <a href=\"http://www.mindsnacks.com/careers\" rel=\"nofollow\">http://www.mindsnacks.com/careers</a>\nFor more info, email us at jobs@mindsnacks.com</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828138", 
        "user": "kstenerud"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Visual.ly - San Francisco, CA\nis looking for a seasoned Growth Hacker. You like working on the bleeding edge? You are comfortable whipping up code for the front-end and back-end? You are excited about growth? And like problem solving?\nHelp us build scale out our customer acquisition and learn a ton in the process!\nNote: While this is a development role, you will report to the Growth Team<p>The job\nYou contribute to the code on each level of the stack working closely with designers and fellow developers.\nYou show an eagerness to learn and a thirst for knowledge.\nYou are comfortable context switching from project to project.</p><p>You are equally comfortable talking with Marketing/Business folks as with Developers and can speak both languages.</p><p>Us\nWe're a small team of people who are dedicated and have a passion for data visualizations and infographics.\nWe're nimble. That means we're following a user-centered approach; we value people's feedback and iterate quickly.</p><p>You\nYou have an outstanding understanding of how all layers of the stack interact\nYou are knowledgable and experienced with the following languages, Javascript, PHP, HTML, API's.\nYou are experienced working with MySQL databases\nYou are well versed in the latest internet marketing techniques as well as standards (seo/sem/email)\nYou are able to think creatively to solve marketing challenges to unlock new growth channels.</p><p>Curious? Get in touch! Jobs+growth@visual.ly</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828304", 
        "user": "abreckle"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">San Francisco, CA - Full-time (no remote) - Consumer early-stage, funded<p>Vurb (<a href=\"http://vurb.com\" rel=\"nofollow\">http://vurb.com</a>) - Max Levchin funded startup - <a href=\"http://techcrunch.com/2013/02/20/contextual-content-engine-vurb-wants-to-make-the-internet-seamless\" rel=\"nofollow\">http://techcrunch.com/2013/02/20/contextual-content-engine-v...</a></p><p>We're working on search, browsing, and sharing, by connecting the services we use in a contextual way that's more usable, efficient, and social (e.g., no more having lots of windows/tabs open). We do this through unique UX/UI combined with search, machine learning, big data, and other fun technologies.</p><p>We're looking for people who are interested in:</p><p>* JavaScript (node.js, backbone.js) - generalist / full-stack development</p><p>* Search / Data Science - search / classification / ranking, machine learning, recommendations, NLP, data crawling/processing</p><p>* Mobile (iOS, Objective-C, Android) - development of native apps</p><p>We're stealth but funded by Max, Drew Houston (Dropbox), Naval Ravikant (AngelList),  Arrington (CrunchFund), and many others. If you're looking to join a small team that solves complex problems and is making something people will use daily, then come find out what we're up to.</p><p>jobs@vurb.com | <a href=\"http://vurb.com/jobs\" rel=\"nofollow\">http://vurb.com/jobs</a> | angel.co/vurb</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828242", 
        "user": "blo"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Rap Genius (YC S11) - Brooklyn, NY - <a href=\"http://rapgenius.com\" rel=\"nofollow\">http://rapgenius.com</a> – Help us build the Wall of History jobs@rapgenius.com<p>IF YOU PASS OUR TECHNICAL INTERVIEW AND RECEIVE A JOB OFFER FROM US, WE'LL GIVE YOU $1,000 CASH (even if you don't take the job!) <a href=\"http://news.rapgenius.com/2368105\" rel=\"nofollow\">http://news.rapgenius.com/2368105</a></p><p>We're one of the fastest-growing sites on the internet, we get 25MM unique visitors per month, we've raised $15m from Andreesen Horowitz, and yet our tech team is only seven people. Anyone who joins us is going to have the best of both worlds, you'll work on a product that millions love and use while getting the experience of being a part of a small team and helping define the culture.</p><p>WHO WE ARE</p><p>We're a tiny, quick-shipping team. Each of us makes product decisions and owns whole features. We're close and we all enjoy spending time together. We’re a small team because we’re picky about who joins us. We have one of the hardest technical interviews in NYC but if you make it, you’re going to be on the best team around. Our house library includes Metaprogramming in Ruby; Godel, Escher, Bach, an Eternal Golden Braid; POODR; and \"Is Justified True Belief Knowledge?\". Loving rap is not a prerequisite for working here, though an appreciation osmoses to everyone after a while.</p><p>WHAT WE'RE BUILDING</p><p>We started Rap Genius in 2009 to explain the meaning of rap lyrics, but the big vision goes beyond music and touches all of text – whether it's the Bill of Rights (<a href=\"http://news.rapgenius.com/62958\" rel=\"nofollow\">http://news.rapgenius.com/62958</a>), the Bible (<a href=\"http://poetry.rapgenius.com/237774\" rel=\"nofollow\">http://poetry.rapgenius.com/237774</a>), “The Waste Land” (<a href=\"http://poetry.rapgenius.com/83150\" rel=\"nofollow\">http://poetry.rapgenius.com/83150</a>), or the Supreme Court’s DOMA ruling (<a href=\"http://news.rapgenius.com/1910390\" rel=\"nofollow\">http://news.rapgenius.com/1910390</a>), it's all on Rap Genius (or Poetry Genius, or News Genius, or... you get the idea). One of our favorite recent examples is Junot Diaz's amazing annotations on an excerpt from his own The Brief Wondrous Life of Oscar Wao (<a href=\"http://poetry.rapgenius.com/2002590\" rel=\"nofollow\">http://poetry.rapgenius.com/2002590</a>).</p><p>BENEFITS</p><p></p><pre><code>  * Bomb salary and equity—you won't be taking a pay cut to work here\n\n  * We don't count vacation days\n\n  * Free meals in the office, free unlimited Seamless, free unlimited Fresh Direct\n\n  * Free gym in the building\n\n  * We pay your phone bill and when you join we'll upgrade you to the newest iPhone\n\n  * Laundry and shower in the office\n\n  * Free indoor bike parking\n\n  * Free health, dental, and vision benefits\n\n  * The deluxe computer setup of your choice\n\n</code></pre>\nWHAT WE'RE LOOKING FOR<p></p><pre><code>  * Experienced full-stack Rails engineers\n\n  * Front-end developers with an eye for design\n\n  * iOS devs to help build our upcoming iPhone app\n\n</code></pre>\nINTERESTED?<p>Hit us up at jobs@rapgenius.com with:</p><p></p><pre><code>  * Your name and GitHub profile, your Twitter, blog, StackOverflow account, personal website, etc.\n\n  * A cool side project you built, library you've released, or some code that's impressive\n\n  * Something brief about what you like and dislike about the technologies you've used\n\n  * Your résumé\n\n  * Apply if you live in NYC or are willing to relocate. Our office is in Williamsburg, and it's awesome.</code></pre></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828212", 
        "user": "sailormoon222"
    }, 
    {
        "address": "Toronto, ON, Canada", 
        "country": "CA", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Toronto, ShopLocket<p>ShopLocket is the fastest way to add ecommerce functionality to any web site, whether that's adding a simple shopping cart or taking preorders and charging later.</p><p>At ShopLocket, we're currently spending a lot of time on: \n- building a product that can live anywhere through the magic of third-party Javascript \n- turning our simple service into an API that other developers can build on top of \n- designing a tool that gets out of the way when it has to but be intuitive and pleasant to use when it can't - investing in automated testing so that we can adapt our codebase without (too much) stress and deploy confidently \n- giving ourselves a quantified view into how both buyers and sellers use our platform</p><p>We do our work in Rails, AngularJS, Coffeescript, Sass, deployed on Heroku; however, we're reaching that exciting stage where we're running into some of the limits of what these tools can do well.</p><p>We're looking for a VP Engineering, Backend Developer, Front-end Developer.</p><p>In exchange for your passion and expertise, we can offer a competitive salary, a great office in downtown Toronto, full benefits, and access to a variety of stimulants and depressants, where legal and appropriate.</p><p>Please get in touch: andrew@shoplocket.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 43.653226, 
        "location": "Toronto, ShopLocket", 
        "lon": -79.3831843, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828225", 
        "user": "hyfen"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Mandiant - REMOTE or located in New York or D.C. areas - I work at Mandiant, a cybersecurity company, and we need Rails and Node.js programmers for some projects we are working on.  If you're interested in chatting about it, email me at my HN username at gmail.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828221", 
        "user": "jeremymcanally"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Pusher - <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http://pusher.com/jobs</a> - London, United Kingdom<p>Pusher is a uniquely techy London company with a large and growing global user base and we are looking to hire a Lead Designer among other positions ( <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http://pusher.com/jobs</a> ).</p><p>Our company's vision is to help stop developers reinventing the wheel when it comes to software, and help them focus their time and energy into valuable and meaningful work. We’re growing quickly and there’s much to be done.</p><p>We have currently a couple of open positions:</p><p>* Lead Designer: Join us as our first in house designer and you’ll have the opportunity to evolve our brand as well as the experience of the product itself. More info @ <a href=\"http://pusher.com/jobs/lead_designer\" rel=\"nofollow\">http://pusher.com/jobs/lead_designer</a></p><p>* Platform Engineer : The current Pusher platform is only the start of our plans. We're looking for engineers who can help us build out our platform and help shape the way software is produce. More info @ <a href=\"http://pusher.com/jobs/platform_engineer\" rel=\"nofollow\">http://pusher.com/jobs/platform_engineer</a></p><p>* Mobile Support Engineer : Are you a kickass iOS &amp; Android coder? Do you get a kick out of helping people build amazing things? We're looking for an outgoing, passionate engineer who will make sure our customers build awesome mobile applications with our platform. more info @ <a href=\"http://pusher.com/jobs/mobile_support_engineer\" rel=\"nofollow\">http://pusher.com/jobs/mobile_support_engineer</a></p><p>We are also always keen to on interns (paid) and we have other open positions. <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http://pusher.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828075", 
        "user": "knes"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">AdRoll - <a href=\"http://adroll.com\" rel=\"nofollow\">http://adroll.com</a> - San Francisco (near 5th &amp; Mission). H1B welcome.<p>See our eng blog: <a href=\"http://tech.adroll.com\" rel=\"nofollow\">http://tech.adroll.com</a>. See our Chief Architect talk about our stack last week at AWS reinvent (min 33:50): <a href=\"https://www.youtube.com/watch?v=eyUalcd_Ks0\" rel=\"nofollow\">https://www.youtube.com/watch?v=eyUalcd_Ks0</a></p><p>Turns out ad tech has some of the most interesting problems you'll find anywhere. AdRoll's engineers are conquering problems in big data (HBase), machine learning (Mahout), real-time processing (Erlang/Storm/Kafka) and UX (Backbone). We make this stuff work for more than 10,000 customers. We're looking for smart, hungry folks across the board.</p><p>* This year we were named the \"Best Place To Work\" in SF (mid-sized tech). <a href=\"http://blog.adroll.com/best-places-to-work-sf-biz-times\" rel=\"nofollow\">http://blog.adroll.com/best-places-to-work-sf-biz-times</a></p><p>* We were recently ranked the fasting growing private company in California by Inc magazine: <a href=\"http://www.inc.com/profile/adroll\" rel=\"nofollow\">http://www.inc.com/profile/adroll</a></p><p>Email us at jobs.engineers@adroll.com or visit <a href=\"http://www.adroll.com/about/careers\" rel=\"nofollow\">http://www.adroll.com/about/careers</a>.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828312", 
        "user": "aaaron"
    }, 
    {
        "address": "Bournemouth, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Base - <a href=\"http://www.wearebase.com\" rel=\"nofollow\">http://www.wearebase.com</a> - Bournemouth, UK<p>We're a digital agency, looking for 1 full time senior PHP developer and 1 full time Android/iOS developer. Full details:</p><p><a href=\"http://wearebase.com/BaseJobSpecificationPHPLAMPDev.pdf\" rel=\"nofollow\">http://wearebase.com/BaseJobSpecificationPHPLAMPDev.pdf</a></p><p><a href=\"http://wearebase.com/BaseJobSpecificationAppDev.pdf\" rel=\"nofollow\">http://wearebase.com/BaseJobSpecificationAppDev.pdf</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 50.719164, 
        "location": "Bournemouth, UK", 
        "lon": -1.880769, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828196", 
        "user": "dave1010uk"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Tidal Labs is hiring a full stack web developer. NYC preferred but REMOTE OK.<p><i>Us</i></p><p>We build beautiful and powerful tools for real time collaboration and content creation, used by over 25,000 bloggers and dozens of big name brands and publishers. We're a ten-person team local to NYC that values education, personal growth, and work-life balance.</p><p><i>You</i></p><p>You're a highly motivated individual with proven and demonstrable skills in web application development and maintenance. You can build a full web app, set up a server, launch into a production environment and maintain the whole thing comfortably. You have strong communication skills and you're good on teams.</p><p><i>Technologies</i></p><p>As long as you have experience in most of these and are willing to catch up on the others you're OK to apply: PHP, mongo, JavaScript, HTML and CSS, Linux server administration, Node.js.</p><p><i>Why us</i></p><p>- market salary commensurate on experience</p><p>- health insurance</p><p>- personal growth and training budget</p><p>- almost no overtime</p><p>- work with an enthusiastic and intelligent team</p><p>- work from home 1-2 days per week</p><p><i>How to apply</i></p><p>We prefer applicants who can commute into NYC, but please apply if you feel you would be a good fit no matter where you are in the US.</p><p>Email php@tid.al with the following information:</p><p>- cover letter</p><p>- résumé</p><p>- brief description of the project you did your best work on</p><p>- brief description of the project you did your worst work on</p><p>- geographic location and your level of willingness to relocate</p><p>- desired salary</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827634", 
        "user": "bkanber"
    }, 
    {
        "address": "Chicago, IL, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Spantree - <a href=\"http://www.spantree.net/jobs\" rel=\"nofollow\">http://www.spantree.net/jobs</a> - Chicago, IL<p>We're Spantree, a small, nimble boutique consultancy based mostly in Chicago. We're looking for another smart person to join our team in the West Loop of Chicago. This candidate should enjoy learning new things and solving hard problems.</p><p>We work almost exclusively with open source software and we're not shy about jumping into third-party code to figure things out.  You should be motivated to submit pull requests and hunt down project committers on Twitter and IRC when you're stuck.</p><p>Some of our favorite day-to-day technologies include Groovy, Grails, Elasticsearch, Drools, MongoDB, Backbone.js/Marionette, CoffeeScript and Puppet.</p><p>Our clients range from small and scrappy startups to large hospital networks and software as a service providers. Historically, most of the stuff we've worked on has not been public-facing: it's either guarded behind the client's firewall, neatly tucked away as a library or jammed into the minds of the developers we've mentored. But we're starting to diversify from \"behind-the-scenes\" work to more early-stage product development.</p><p>Fundamentally, we like to work on tools that helping people make better decisions. This can take the form of a search engine to help people find interesting stuff to do on a Saturday night, a complex workflow management system for evaluating health insurance claims or a matchmaking and scheduling system to help people book face-to-face meetings at conferences.</p><p>We're looking for generalists who can quickly go from problem to working solution and communicate effectively with our peers and clients along the way. While we have a very strong technical stack already, you don't expect new hires to be an expert in everything right away.  In general, though, we're looking for people with the following qualifications:</p><p>* One or more fun languages: Ruby, Python, Groovy, Clojure, PHP, CoffeeScript, etc.</p><p>* One or more boring languages: Java, C++, C#, etc.</p><p>* One or more web frameworks: Grails, Rails, Django, SpringMVC, Play, CakePHP, etc.</p><p>* One or more databases: SQL, NoSQL, NewSQL, we like it all.</p><p>* HTML, CSS, JavaScript and at least one framework</p><p>* Git, or a colorful excuse for not knowing it.</p><p>* The typical software development toolchain: text editors, IDEs, step debuggers, issue trackers, etc.</p><p>If you'd like to learn more, please email jobs@spantree.net to  set up a Google Hangout.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 41.8781136, 
        "location": "Chicago, IL", 
        "lon": -87.6297982, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828156", 
        "user": "divideby0"
    }, 
    {
        "address": "Cupertino, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Cupertino, CA<p>Apple Inc.</p><p>Web Application Engineer</p><p>Erlang, couch, backbone, node, etc.</p><p>My team at Apple is looking for an experienced fullstack web development professional to join a small and highly productive group. The role will involve developing and implementing enterprise web applications for the Apple Retail Stores worldwide.</p><p>A bit about the requirements, skills:</p><p>- Experience with developing distributed, fault-tolerant, highly available, and concurrent systems</p><p>- Experience with HTTP, REST, and modern HTML5 web technologies</p><p>- Experience with NOSQL data stores such as CouchDB, Riak, Hadoop, etc</p><p>- Experience with languages such as Erlang, Haskel, Clojure, Scala, Go</p><p>- Experience with scripting, shell environments, and version control solutions such as Git</p><p>- Understanding of javascript application frameworks like Backbone.js, Angular.js, and Ember.js</p><p>- Must have a solid understanding of the Apple Brand</p><p>- Must have expert knowledge of modern web development practices</p><p>- Able to implement new ideas quickly</p><p>- Thrives in a dynamic and ambiguous work environment</p><p>- Strong team player with a high degree of flexibility</p><p>- Ability to work independently while maintaining a high level of efficiency</p><p>- Excellent verbal and written communication skills</p><p>- Very detail oriented and organized with a strong discipline of adhering to standards</p><p>- Excellent problem determination and resolution skills</p><p>If you are interested, please apply online via the following link.</p><p><a href=\"https://jobs.apple.com/us/search?job=21354897&amp;openJobId=21354897\" rel=\"nofollow\">https://jobs.apple.com/us/search?job=21354897&amp;openJobId=2135...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3229978, 
        "location": "Cupertino, CA", 
        "lon": -122.0321823, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827954", 
        "user": "webjobatapple"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">User Experience Developer at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http://qlicket.com</a><p>Software Engineer - Java at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http://qlicket.com</a></p><p>Executive Assistant at Qlicket | Delhi | <a href=\"http://qlicket.com\" rel=\"nofollow\">http://qlicket.com</a></p><p>INTRODUCTION TO QLICKET</p><p>Qlicket is an angel-backed technology company that focuses on deploying and monetizing WiFi hotspots in India. We have a new and highly disruptive business model to make public WiFi free in India by leveraging our patent-pending ad technology. In the last year alone, we've entered agreements that give us access to display our 100% guaranteed engagement format at over 250 locations across 50 different cities in India. We're running campaigns for some of India's most well-recognized brands, and we've now built our own WiFi hotspot using customized hardware and software that provides users with a much better public WiFi experience. Qlicket has been funded by 16 angels who are located across three continents, have provided the company $250k in total commitments, and maintain affiliations with Google, Microsoft, Boingo, One97, McKinsey, Blackstone, Bharti, TRAI, Wharton/Penn and CMU, among other organizations. Techcircle has described us as \"one of India's 10 most promising tech startups.”</p><p>USER EXPERIENCE DEVELOPER ROLE</p><p>\"Where Design Meets Code” … UX Developers take descriptions of UI layouts and screens — that are provided either verbally or through some combination of sketches, screenshots and mockups — and then convert these descriptions into flexible HTML, CSS and JavaScript files, so that the files can be appropriately rendered across major laptop, tablet and mobile browsers. UX Developers are comfortable working independently and coding in the latest front-end languages. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.</p><p>USER EXPERIENCE DEVELOPER REQUIREMENTS</p><p>- Strong HTML, CSS and JavaScript skills</p><p>- Bachelor’s degree from a top-tier university</p><p>- Ability to build what you or your teammate’s design</p><p>- Comfortable working in Adobe Photoshop and Illustrator</p><p>- A portfolio of active websites, links and self-started projects</p><p>SOFTWARE ENGINEER - JAVA ROLE</p><p>Software Engineers take descriptions of use-cases — that are provided either verbally or through some combination of UML sketches or mockup — and then convert these use-cases into required classes, along with necessary database tables, entities and unit tests. Software Engineers must be adept at converting such requirements to productive code, and must also be comfortable using jQuery or similar JavaScript frameworks to achieve restful calls using AJAX. Software Engineers may be required to write basic front-end code to complete necessary use-cases. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.</p><p>SOFTWARE ENGINEER - JAVA TECHNOLOGIES</p><p>Java 7 core, JSP 2.2+, JSF, Servlets 3+, JPA 2+, EJB 3+, JAX-RS, Tomcat 6+, MySQL/MariaDB 5+ (SQL knowledge a must), JUnit/TestNG, Maven/Ant/Gradle, JavaScript (jQuery, AJAX knowledge a must)</p><p>SOFTWARE ENGINEER - JAVA REQUIREMENTS</p><p>- Strong set of Java skills</p><p>- Bachelor's degree from a top-tier university</p><p>- Preferably, three years of relevant work experience</p><p>- A portfolio of active websites, links and self-started projects</p><p>EXECUTIVE ASSISTANT ROLE</p><p>Executive assistants support teammates who focus primarily on devising better ways to help bring every Indian online for free. You need to be quick on your feet, thoughtful, meticulous, down to earth, and most importantly, trustworthy. We are looking for someone who wants to join a highly talented team of four that is dedicated to providing reliable and free Internet access for over a billion people.</p><p>EXECUTIVE ASSISTANT RESPONSIBILITIES</p><p>- Schedule / coordinate meetings and phone calls</p><p>- Keep track of client interactions by updating our proprietary CRM database</p><p>- Save people's time (e.g., pick up lunch, order office supplies, scan docs, etc.)</p><p>EXECUTIVE ASSISTANT EXPERIENCE / SKILLS</p><p>- Prior administrative experience preferred</p><p>- Bachelor's degree from a top-tier university</p><p>- Familiarity using the calendar system in Google Apps for Business</p><p>- Comfortable with English and the idea of working at a leading tech startup</p><p>- Avid Internet user who enjoys accessing free public WiFi at venues across India</p><p>BENEFITS FOR ALL POSITIONS</p><p>- Smartphone with voice and data plan</p><p>- Laptop including external monitor and mouse</p><p>- Competitive compensation with salary and stock options</p><p>- Office with AC, bean bags and only five-minute walk to Metro</p><p>- Opportunity to learn a lot, love your work, and change the world</p><p>APPLICATION</p><p>Please send a brief email along with your links, portfolio and CV to careers@qlicket.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827892", 
        "user": "vivekrkumar"
    }, 
    {
        "address": "Salt Lake City, UT, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Salt Lake City, UT -- Lucid Software (Lucidchart / Lucidpress)<p>Lucid Software is building world class graphical applications in the browser and on mobile devices. Our first product, Lucidchart (<a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a>), is an online diagramming application with 1M+ users. We recently launched our second product, Lucidpress (<a href=\"http://www.lucidpress.com\" rel=\"nofollow\">http://www.lucidpress.com</a>), which is an online layout and design application. Lucid is a startup founded by Karl Sun, a former Google exec, and Ben Dilts, our CTO. We're profitable and rapidly growing in every dimension of the business and need people to join our team. For fun we raft river rapids on company retreats, have Friday BBQs, and eat lots of pizza. Talent and ability to learn are more important than specific skills.</p><p>BACKEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress run with various decoupled services in a Linux environment using Scala, MongoDB, AWS, and MySQL. At Lucid your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly available, secure, and scalable.</p><p>Requirements:\n  - Talent\n  - BS degree</p><p>Recommended experience:\n  - Building large products / applications\n  - Scala or Java\n  - MySQL or other relational database\n  - NoSQL databases\n  - Cloud computing (AWS)</p><p>FRONTEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress are powered by one of the largest Javascript codebases on the Internet (about 250k lines of JS), optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.</p><p>Requirements:\n  - Talent\n  - BS degree</p><p>Recommended experience:\n  - Building large products / applications\n  - Javascript \n  - Google Closure compiler/library\n  - CSS/HTML/DOM manipulation\n  - jQuery\n  - Native app development on Android and/or iOS</p><p>All applicants email resumes (and links to recent projects) to jobs@lucidchart.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7607793, 
        "location": "Lake City, UT", 
        "lon": -111.8910474, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827935", 
        "user": "dmgrow"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SEATTLE, WA. A plucky startup is dragging the manufactured goods supply chain into the 21st century.<p>Our job is to help manufacturers organize product data to help moving the goods - catalogs, inventory, supporting documentation, orders, and so on; all stand to benefit from solid data architecture with increasing accuracy, reducing cost, and real-time analytics.</p><p>WANTED: Experienced web developer - HTML/CSS/Javascript/jQuery. Backend is C#/ ASP.NET MVC.</p><p>Your first task, should you chose to accept it, is to create a wholesale catalog &amp; ordering web app on top of our existing back end data API. We expect half of the usage of our products to come through this web app (and the other half through the native apps).</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827881", 
        "user": "DenisM"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Localytics - Boston, MA - FULL-TIME, INTERN, H1B<p>Localytics offers a powerful real-time, cloud-based app analytics and marketing platform. We’re proud to help some of the world's most well-known brands like The New York Times, Microsoft, Salesforce and eBay create great mobile experiences for their customers.</p><p>Localytics was recently named one of the best places to work by The Boston Globe.  We are expanding our engineering team and have openings across all areas of our technology stack.  If you are interested in working with any of the following technologies or enjoy challenges working with big data or data visualization drop us a line at jobs@localytics.com</p><p></p><pre><code>  - Rails\n  - AngularJS\n  - D3.js\n  - MongoDB\n  - Scala\n  - AWS\n</code></pre>\nCareers page:  <a href=\"http://www.localytics.com/company/localytics-jobs/\" rel=\"nofollow\">http://www.localytics.com/company/localytics-jobs/</a><p>Recent Dev Blog post: Using AngularJS at Localytics:  <a href=\"http://www.localytics.com/blog/2013/angularjs-at-localytics/\" rel=\"nofollow\">http://www.localytics.com/blog/2013/angularjs-at-localytics/</a></p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 42.3584308, 
        "location": "Boston, MA", 
        "lon": -71.0597732, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827987", 
        "user": "abuggia"
    }, 
    {
        "address": "Charlottesville, VA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">VividCortex - Charlottesville, VA - MySQL Database Performance Management<p>Positions for both summer interns and fulltime available.</p><p><a href=\"https://vividcortex.com/jobs/\" rel=\"nofollow\">https://vividcortex.com/jobs/</a></p><p>Systems Programming</p><p>Our agents, backend systems, and infrastructure are all written in Go (it’s awesome). We are ramping up to handle a jaw-dropping amount of incoming data. Data storage involves MySQL and other technologies in a fault-tolerant, distributed environment.</p><p>Operations and System Administration</p><p>We’re hosted in Amazon AWS and looking for people who do developer and sysops types of work — writing some server software, setting up some machines, whipping up some Ansible code, and so on.</p><p>Front End Development</p><p>The web app is backed by a small amount of PHP and Symfony2, and fronted by Angular and D3.js, CSS (Less), and HTML5. There’s a lot of API interaction from JavaScript, and a complex single-page user interface with rich data visualization that’s key for making our customers rave about the experience, not just the technology. We need people who can work in Angular, D3, design, styling, and so forth.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 38.0293059, 
        "location": "Charlottesville, VA", 
        "lon": -78.47667810000002, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828099", 
        "user": "kylered"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">AcademicWorks.com - Austin TX\nSenior Rails Software Engineer\nLearn more here: <a href=\"http://www.academicworks.com/careers\" rel=\"nofollow\">http://www.academicworks.com/careers</a></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828323", 
        "user": "techscruggs"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Stackdriver - Boston, MA<p>Stackdriver is building a monitoring product focused on cloud based systems and distributed applications.  We are looking to hire engineers of all stripes to work on all parts of our application stack and also an evangelist to help get the word out speaking about us.</p><p>For the engineering positions, our stack is python on the backend with a lot of angularjs and d3.js on the frontend as well. Heavy use of cassandra, (multiple) queues, and AWS throughout.</p><p>More information is available at <a href=\"http://www.stackdriver.com/jobs/\" rel=\"nofollow\">http://www.stackdriver.com/jobs/</a> or you can email me directly at jeremy+hnjob AT stackdriver DOT com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3584308, 
        "location": "Boston, MA", 
        "lon": -71.0597732, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827684", 
        "user": "katzj"
    }, 
    {
        "address": "Portland, ME, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Likeable Local - Portland, Maine - Social Media Tools for Small Businesses<p><a href=\"http://www.likeablelocal.com/\" rel=\"nofollow\">http://www.likeablelocal.com/</a></p><p>We at Likeable Local are looking to grow our team and seeking two talented and motivated software engineers. One immediate role would be perfect for someone who is great with numbers and analytics. The other role is better suited towards someone who loves working in the front-end and loves making things look and interact beautifully- with html, javascript, and css. In both cases the engineers should love building cool things, learning, and social media.</p><p>We are in Portland, Maine which is atypical for Hacker News, but is a great place to live! We aren't looking for remote workers at this time.</p><p>We are a tech-startup-spinoff of the award-winning (NYC-based) agency Likeable Media, and we are looking for people that are willing to jump right in and be on our small team (currently 3 other full-time developers) creating features that will be visible and impactful and used immediately.</p><p>We are hard-working and smart, and we love to solve challenging problems. We use a lot of node.js, javascript, python, and django.</p><p>You love being a substantial contributor and are interested in the “full stack” of technologies from details of server configuration, back-end, front-end, and mobile platforms. You are self-disciplined, self-directed, but also detail-oriented in your communication about what choices you make and what you are doing.</p><p>Likeable Local offers an integrated software solution that allows small businesses to create, enhance and manage their social media presence. Likeable Local was founded in 2012 and has a deployed product that integrates with Facebook and Twitter. The software is sold on a subscription basis, allowing for attractive recurring revenue economics, and is in use by dentists, dry cleaners, florists, and jewelers and we continue to expand.</p><p>Interested? Email me at hugh@likeable.com and lets connect!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 43.66147100000001, 
        "location": "Portland, Maine", 
        "lon": -70.2553259, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828092", 
        "user": "hyoogle"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Cigital is hiring software security folks<p>What we do: \nWe're a software security consulting firm that helps build security into the SDLC. We work on a wide variety of projects involving static analysis, penetration testing, architecture review, threat modeling, etc. We deal mostly with the private sector and the types of applications we work with are varied from mobile to webapps to video games.</p><p>DO NOT apply directly to our website. Email your resume to dirtyb1t34@gmail.com</p><p>We're all consultants so we tend to travel a fair amount. As I said, the work is varied and you can really focus the type of work you do based on your interests and skills. It's definitely a fun place to work. The people here are really smart and there's lots of room to grow your skills. We're looking for everything from interns to principal consultants and we have positions open all over the place including:</p><p></p><pre><code>  • Northern Virginia\n  • Boston, MA\n  • Santa Clara, CA\n  • New York, NY\n  • Bloomington, IN\n  • London\n</code></pre>\nYou can read more about the jobs here: <a href=\"http://www.cigital.com/careers/jobs/\" rel=\"nofollow\">http://www.cigital.com/careers/jobs/</a><p>Cigital is hiring software security folks</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827871", 
        "user": "dirtyb1t"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">New York, NY.<p>Full Time.</p><p><a href=\"http://www.thehackerati.com\" rel=\"nofollow\">http://www.thehackerati.com</a></p><p>Software developers at all experience levels, for front end, back end, and big data. We don't care what languages you know, as long as you're highly skilled in at least one. We use agile and tend to use the same kinds of technologies that you'd see in your typical YC startup. Email me if interested:</p><p>alex.krupp@thehackerati.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827772", 
        "user": "Alex3917"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">AngularJS Jobs - Palo Alto, London, Austin, New York, Chicago<p>Front-end, AngularJS Software Engineer to Help Invent a New Category of Software\n&gt; <a href=\"https://www.angularjobs.com/posts/481-front-end-angularjs-software-engineer-to-help-invent-a-new-category-of-software\" rel=\"nofollow\">https://www.angularjobs.com/posts/481-front-end-angularjs-so...</a></p><p>Palo Alto Senior Developer Needed to Build Team and Lead Development\n&gt; <a href=\"https://www.angularjobs.com/posts/473-palo-alto-senior-developer-needed-to-build-team-and-lead-development\" rel=\"nofollow\">https://www.angularjobs.com/posts/473-palo-alto-senior-devel...</a></p><p>Build an Interactive Trade Show Display Using AngularJS\n&gt; <a href=\"https://www.angularjobs.com/posts/472-build-an-interactive-trade-show-display-using-angularjs\" rel=\"nofollow\">https://www.angularjobs.com/posts/472-build-an-interactive-t...</a></p><p>Solve Problems with AngularJS at Chicago Dev Shop\n&gt; <a href=\"https://www.angularjobs.com/posts/380-solve-problems-with-angularjs-at-chicago-dev-shop\" rel=\"nofollow\">https://www.angularjobs.com/posts/380-solve-problems-with-an...</a></p><p>Lead Front End Developer (AngularJS) with UI Experience @ Foodsitter\n&gt; <a href=\"https://www.angularjobs.com/posts/426-lead-front-end-developer-angularjs-with-ui-experience-foodsitter\" rel=\"nofollow\">https://www.angularjobs.com/posts/426-lead-front-end-develop...</a></p><p>Senior / Lead Developer with heavy UI / Application experience : FT or Freelance\n&gt; <a href=\"https://www.angularjobs.com/posts/422-senior-lead-developer-with-heavy-ui-application-experience-ft-or-freelance\" rel=\"nofollow\">https://www.angularjobs.com/posts/422-senior-lead-developer-...</a></p><p>Email your resume to brian@angularjobs.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827769", 
        "user": "BrianPetro"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SEEKING WORK - Brighton UK<p>Electronic hardware design and microcontroller programming for sensors actuators and feedback loops - interface libraries written in c, c++ and python. Microcontroller experience includes PIC dsPIC and Arduino. Previous work includes automation of high precision physics experiments as well as digital interactive entertainment applications.</p><p>website: nseymoursmith.github.io</p><p>email: nseymoursmith@gmail.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828126", 
        "user": "uween"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">AlphaSights is hiring experienced Ruby on Rails developers in LONDON, UK and NY, USA<p>AlphaSights is at the leading edge of the knowledge revolution. We help our clients get the critical insight and information they need to thrive in an ever more complex world. We’re growing fast, our clients love us and we’re a fantastic place to grow your career.</p><p><a href=\"http://www.alphasights.com/careers/positions/london/experienced-ruby-on-rails-developer\" rel=\"nofollow\">http://www.alphasights.com/careers/positions/london/experien...</a>\n<a href=\"http://www.alphasights.com/careers/positions/new-york/experienced-ruby-on-rails-developer\" rel=\"nofollow\">http://www.alphasights.com/careers/positions/new-york/experi...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828005", 
        "user": "medwezys"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Mountain View, CA (full-time) - BloomReach - <a href=\"http://bloomreach.com/\" rel=\"nofollow\">http://bloomreach.com/</a><p>BloomReach is a fast-growing startup with offices in Mountain View, CA and Bangalore, India, and we’re tackling one of the Internet’s most fundamental problems: helping leading online businesses get their high quality and relevant content found by their consumers, when and where they want it.</p><p>$41M raised from NEA, Lightspeed and Bain Capital.</p><p>We're hiring for: Software Engineer (Backend, \nData or New Grads) ---\nData Scientist ---\nEngineering Internship - Summer 2014 or Winter/Spring 2014</p><p>Get all the details here: <a href=\"http://bloomreach.com/careers/\" rel=\"nofollow\">http://bloomreach.com/careers/</a></p><p>If you have questions, feel free to email me directly at jason[at]bloomreach.com</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828189", 
        "user": "jseeba"
    }, 
    {
        "address": "Bedford, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">iRobot (<a href=\"http://www.irobot.com\" rel=\"nofollow\">http://www.irobot.com</a>) - Bedford, MA (just outside of Boston, MA)<p>Do you think robots are cool? So do we!</p><p>We're looking for smart engineers who are easy to work with. You should probably think robots are cool, but no robotics background is required. (I had no robotics background when I started at iRobot.)</p><p>iRobot is looking for software engineers, electrical engineers, and mechanical engineers.</p><p>Here are a few of our 30+ job openings:</p><p>* iOS developer</p><p>* Web designer</p><p>* Embedded software engineers\n  * We're hiring for \"big embedded\" (Linux and big cpus) and \"small embedded\" (bare-metal, small cpus)</p><p>* Software engineers for navigation and mapping</p><p>* Test engineers</p><p>* RF engineer (electrical engineer)</p><p>Check our jobs site for all positions: <a href=\"http://www.irobot.com/us/Company/Careers.aspx\" rel=\"nofollow\">http://www.irobot.com/us/Company/Careers.aspx</a></p><p>Email me directly if you'd like to know more: csvec@irobot.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.4906231, 
        "location": "Bedford, MA", 
        "lon": -71.2760089, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827669", 
        "user": "svec"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Tubular Labs - Mountain View, CA\n<a href=\"http://tubularlabs.com\" rel=\"nofollow\">http://tubularlabs.com</a><p>We're helping creators and brands understand online video (YouTube) to know and grow their audience.  We bring our expertise in big data to make it understandable for the creator.</p><p>We've raise a Series A round and continue to build our our team of great engineers.  The short version of what we have open today is:</p><p>Full-stack engineer\n* Python\n* AngularJS\n* MySQL, Hadoop, Redis</p><p>DevOps\n* AWS, MySQL, Hadoop, Redis</p><p>Contact me for more details or to apply:  david@tubularlabs.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827701", 
        "user": "koblas"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">ënimai - www.enimai.com - Mountain View CA - Full Time, no remote work.<p>We believe our technology will fundamentally change how we approach computing.</p><p>Yourself: Generalist who can become a specialist given time. Self starter and mostly importantly a finisher - pick something up and deliver without supervision. You will be a manager with a team size of one - you. You will need to pick the next problem on the way to achieve our goals and solve it. You could be working on our custom OS twiddling GPIOs or you could be writing Scala on the backend or polishing off our iOS app. You will need to hold a lot of complexity in your head and have solid CS fundamentals.</p><p>Google may not have all the questions to your answers, github may not have any such sample code and Stack Overflow may have a vaguely related question with no replies.</p><p>Team: ex-(Apple, Facebook, Google, Jawbone, Lab126, NASA, Samsung). Approximately 1/3rd of the team are PhDs (or PhDs on “pause”) in various fields (Math, Physics, CS etc).</p><p>Apply at <a href=\"http://enimai.theresumator.com/\" rel=\"nofollow\">http://enimai.theresumator.com/</a> or email stdin@enimai.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828033", 
        "user": "magic_at_enimai"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Amsterdam, the Netherlands. No remote work – must be able and willing to work at our Amsterdam office.<p>Silk (www.silk.co) is looking for Javascript, TypeScript and Haskell engineers.</p><p>We're building a product that makes it easy for people to create sites with content that is easy to query, visualize and share. On a deeper level, our vision is to bring the semantic web to the masses and build an amazing company around that.</p><p>We're working on many interesting and challenging problems, with a custom-built Haskell graph-database on the back-end and a cutting-edge Functional Reactive client-side framework in Javascript on the front-end.</p><p>Silk is well-funded by top-tier VCs (NEA and Atomico) and we're located in the city center of Amsterdam.</p><p>For more info &amp; open positions: <a href=\"http://jobs.silk.co/\" rel=\"nofollow\">http://jobs.silk.co/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827586", 
        "user": "salar"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">KeepSafe - San Francisco - H1B welcome<p>We're looking to hire Android develpers and iPhone developers.</p><p>-- The company --</p><p>KeepSafe wants to solve the consumer privacy problems. We work to empower every user to be in control of their data. To do this, we need to make Privacy and Security Technology easy to apply for the average user on all popular platforms.</p><p>Our first product is a vault for Android and iPhone. Over 15 million customers use this product and but our plans are much bigger than that.\nHappy to share more in person: zouhair AT getkeepsafe DOT com</p><p>We're a team of 9, all of us write code. We raised Series A from Floodgate and SV Angel in July.</p><p>-- Jobs : Mobile developer (Android or iOS or both) --</p><p>Your job is to build easy-to-use apps that make privacy, encryption and security technology useful for average users. We are looking for ambitious developers who will take KeepSafe from to 150 million users.</p><p>Requirements:</p><p></p><pre><code>  * Excellent knowledge of the framework including the limits\n  * Sound understanding of programming fundamentals\n  * Strong programming skills. Code speaks stronger than degrees.\n</code></pre>\nBenefits:<p></p><pre><code>  * Market salary \n  * Meaningful equity\n  * Medical, Dental, Vision</code></pre></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827869", 
        "user": "zmb"
    }, 
    {
        "address": "Fremont, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Fremont, CA - EFI. Software Engineer. [LOCAL | H1B  OK]<p>We are looking for a Software Engineer with Web design and programming experience for our Fiery Product Engineering team.   You will work with a team of very talented engineers to design, build, and support world class products including advanced server applications.  The right candidate must be highly motivated and enthusiastic about learning and adopting new technologies.</p><p>looking for someone with \n· Experience of front-end development with AJAX, JavaScript, CSS, and HTML\n· Familiarity with C++, Python, or similar language\n· Experience on web frameworks such as Ruby on Rails</p><p>you can email me directly at ritesh.noronha@efi.com</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.5482697, 
        "location": "Fremont, CA", 
        "lon": -121.9885719, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828044", 
        "user": "icycold"
    }, 
    {
        "address": "Oxford, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">mySociety.org - REMOTE (anywhere in the UK) or Oxford, UK<p>Few non-profits really respect software engineering skills. mySociety is a successful, open source social enterprise that was built by, and is still driven by passionate technologists. And we're supported by big name donors with an understanding of technology, like Google.org and Omidyar Network, so we pay grown up wages.</p><p>We’re looking for developers with the skills and passion to help people open up closed governments, get their streets fixed, and put pressure on errant politicians.</p><p>* Languages - Python, Ruby and Perl</p><p>* Culture - non hierarchical, self-directed, passionate about good code, keen to make a difference</p><p><a href=\"http://mysocietyltd.theresumator.com/apply/J0R4BQ/Web-Developer.html\" rel=\"nofollow\">http://mysocietyltd.theresumator.com/apply/J0R4BQ/Web-Develo...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.7520209, 
        "location": "Oxford, UK", 
        "lon": -1.2577263, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828213", 
        "user": "steiny"
    }, 
    {
        "address": "Columbia, MD, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Columbia, MD – H1B, FULL-TIME, INTERN<p>We're a small company in the Maryland suburbs revolutionizing how states manage Medicaid information. This is an exploding niche, we're growing like a Chia pet on steroids, and we have a bright future ahead of us but we need your help to build it!</p><p>We're looking for .NET software engineers with 'SOLID' C# skills and experience with MVC, NoSQL, HTML5, and JavaScript frameworks such as Knockout or Angular. Knowledge of domain-driven design (DDD), service-oriented architecture (SOA) and other enterprise crap is a plus. Experience with RavenDB is a huge plus. If you don't know any of this stuff, that's fine too – just love to code.</p><p>We have flexible working hours, a casual dress code, and you can work from home a day a week. We use the latest tools (we've been using Visual Studio 2013 for a while) and all developers have an SSD in their machine.</p><p>Please e-mail any questions, comments, or your resume to ubiquitous.croak@gmail.com.</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 39.2037144, 
        "location": "Columbia, MD", 
        "lon": -76.86104619999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828350", 
        "user": "ubiquitouscroak"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Citymapper (London, UK)<p>We're looking for great people first and foremost, but here are some of the things we make:</p><p>* Client experiences that people love. We have iOS, Android, and web apps.</p><p>* An omnivorous transport data processor. We fuse together loads of data sources (of wildly varying quality) to give people the information they need in a growing number of cities around the world. We use a lot of Python.</p><p>* A fast, scalable stable of servers. We have a large user base which relies on us to give them snappy answers every day. We use Saltstack.</p><p>* A psychic city brain. We're digging up patterns in urban data to tell people the answers they need to know about their commute before they know the questions.</p><p>If you want to help us with these things and other yet-to-be revealed madcap schemes, we want to hear from you!</p><p><a href=\"http://citymapper.com/jobs\" rel=\"nofollow\">http://citymapper.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827708", 
        "user": "EmilLondon"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">[INTERN] 6 months- Bangalore<p>Software development engineer: php, python, mysql, memcache, less, css3, html5</p><p>Email: hnu@gooval.com</p><p>About Us: We are working on developing \"Quora for discussion\". With 6 patents filed and seed funding, we have begun the journey to become the next big thing.</p><p>We are looking for interns who are passionate about coding and interested in building scalable systems.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828086", 
        "user": "rrpadhy"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">uSwitch.com -- London, UK. <a href=\"http://www.uswitch.com/\" rel=\"nofollow\">http://www.uswitch.com/</a>\nWe're a comparison website for insurance, broadband, mobiles, gas/energy providers and finance services.<p>------------</p><p>Hiring:</p><p>Backend, Frontend and DevOps - full time.\nWe're looking for experienced developers to expand our team and help us deliver new products.</p><p>------------</p><p>Tech stack:</p><p>Backend: Apache, nginx, Varnish, puppet, capistrano, Ruby (Sinatra and RoR), PHP (mostly legacy - we're moving away from it), Clojure, MySQL, mongoDB, R, Hadoop</p><p>Frontend: Responsive HTML5, JS / CoffeeScript, HAML / Twig</p><p>------------</p><p>About us:</p><p>* regular dev catchups across all teams / show &amp; tell to share experience</p><p>* we host / sponsor / attend hackathons and conferences</p><p>* we maintain healthy work/life balance - no extra long hours, weekends are for you to relax after a beer on a Friday in the office / local pub</p><p>* we deploy to production multiple times a day</p><p>* we'll give you the tools you need to do your job (Macbook or other machine of your choice, whatever software you need) and help you progress (budget for conferences, books and time to learn new tech)</p><p>------------</p><p>About you:</p><p>* able to own a problem and work with others towards a solution</p><p>* you're open minded and flexible - you can pick up new skills / languages</p><p>* you can work well in a team environment (occasional remote work is ok, but we're mostly in the office)</p><p>* skilled at table tennis or table football (optional)</p><p>* comfortable in *nix</p><p>------------</p><p>Next steps:</p><p>Contact me directly - tomasz.tomczyk@uswitch.com - I'm a developer in one of the teams you could be joining, tell me about yourself (whatever you think represents you best) and ideally let's meet up - will give you a tour of our new London Bridge office and talk about the projects we've been working on.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827836", 
        "user": "tomasztomczyk"
    }, 
    {
        "address": "Oslo, Norway", 
        "country": "NO", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">mCASH - Oslo, Norway<p>Payments done right. We integrate with banks, merchants, webshops and apps to allow purchases and person-to-person transfers. We launch in Norway early next year together with several big chains and have plans for several other countries. We have a licence to operate from the Financial Supervisory Authorities of Norway (EU-based). We're 17 people and growing, last transaction value (June this year) of $18m USD, serious financial backing in place. Our owners and board of directors include Harald Andersen (founder of Point, Northern Europe’s largest provider of payment card terminals) as well as Rune Fjeldstad (former CEO of Nets, which operates the debit card infrastructure of Norway and Denmark).</p><p>Product video: <a href=\"http://youtu.be/VkIM6BFiWaA\" rel=\"nofollow\">http://youtu.be/VkIM6BFiWaA</a></p><p>We have a strong team on backend development (Python + Google App Engine) and merchant/bank integration, but so far development of our app has been outsourced. We now need to bring this effort in-house.</p><p>We're looking for an expert iOS and/or Android developer to head up our app development. This is a rare opportunity to completely re-think a whole class of human interactions--people pay for stuff every day. Now you have the opportunity to redesign and reengineer that experience. You will be given free reins. You may choose to build on or to scrap our existing codebase. You will have strong opinions about how the app should look and feel, and will make consensus-based decisions together with our graphic designer and our backend and systems developers. We have the funding available to make additional hires to work together with you, or hire in consultants, as needed.</p><p>Salary: 450k-800k NOK = 75K-130K USD / year + benefits (paid vacation, pension saving program, etc.).</p><p>Ownership: Stock options for 0.6-1.5% of the company.</p><p>Please email jobs@mcash.no to apply.</p><p>We are also scaling up on backend/systems programming and integration with banks/merchants. See <a href=\"http://mcash.no/jobs\" rel=\"nofollow\">http://mcash.no/jobs</a> for more details (these will be brought up to date with respect to compensation soon).</p><p>(An English website is not up just yet, but we have several non-Norwegian-speaking employees and most communication internally is in English. Ask us anything. Norwegian site at <a href=\"http://mcash.no\" rel=\"nofollow\">http://mcash.no</a> )</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 59.9138688, 
        "location": "Oslo, Norway", 
        "lon": 10.7522454, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827706", 
        "user": "dagss"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Sleepio -- London, UK<p>We're a digital sleep improvement program, clinically proven to help overcome long term poor sleep.</p><p>Hiring: CTO, Product Lead, Bus dev.\n<a href=\"http://www.sleepio.com/jobs\" rel=\"nofollow\">http://www.sleepio.com/jobs</a></p><p>Drop me a line direct if you want to hear more: peter@sleepio.com (co-founder)</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827859", 
        "user": "phames"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">awe.sm (<a href=\"http://totally.awe.sm\" rel=\"nofollow\">http://totally.awe.sm</a>) - San Francisco, CA<p>awe.sm is a small, tight-knit team of hackers building social media insight tools on top of busy APIs and years of data. We do closed loop social attribution allowing our customers to understand the real value of their social activity. Our team is a family, and we're looking for dedicated engineers to grow with.</p><p>Our engineering culture embraces data-driven decision making, failing fast, and abiding by the UNIX philosophy: building small, powerful tools with clean interfaces. We live on our internal IRC server, collaboratively building bots to manage our systems and provide stress relief.</p><p>We're seeking an operations engineer to help us grow our engineering culture while being the champion of uptime and deploy automation. Experience in architecting systems is a plus, we value operational insight for building reliable systems on unreliable clouds.</p><p><a href=\"http://totally.awe.sm/jobs\" rel=\"nofollow\">http://totally.awe.sm/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828043", 
        "user": "tso"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">LONDON, UK. Wigwamm. Building apps for real estate professionals.<p>Seeking co-founder. We build cool sh*t. Led by someone with serious domain experience, our team of four needs one more in a senior technical role.</p><p>Call Rayhan for a quick chat if you're interested: 077 952 73 552.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827909", 
        "user": "rayhano"
    }, 
    {
        "address": "Pune, Maharashtra, India", 
        "country": "IN", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Pune, India - Fulltime.<p>Co-Founder of Styloot.com here.</p><p>Styloot.com, is a visual search engine for fashion. At 1.2 Million SKUs and 4000+ brands, we carry slightly more women apparel than Amazon and twice as many shoes as Zappos. Our patented technology already powers some of the largest media and commerce companies of the world.</p><p>We are looking to hire Python, Javascript and Front End developers.</p><p>You will be working directly with the product and will be making decisions that directly influence the site.</p><p>You must love coding and should be at home with fellow hackers - everything else we can work around.</p><p>You must have a github repo that you are proud of.</p><p>Email us if interested - jobs at styloot.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 18.5204303, 
        "location": "Pune, India", 
        "lon": 73.8567437, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827747", 
        "user": "styloot"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Full-time UI Developer in Singapore<p>Company : Pirate3D (Kickstarter funded 3D printing company)</p><p>Technologies : Ember.js, Android, iOS.</p><p>Instructions : Pass the challenge. We fly you to Singapore as soon as possible.</p><p>Challenge : <a href=\"http://pirate3d.com/challenges/#ui1\" rel=\"nofollow\">http://pirate3d.com/challenges/#ui1</a></p><p>Keyword H1B : we can get you a work visa in a few days.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827733", 
        "user": "kaielvin"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">High Tech Campus, Eindhoven, Netherlands<p>1.) Full stack full responsive mobile web developer &amp;\n2.) Full stack IOS developer</p><p>Izooble - find what matters -</p><p>Izooble is a energetic young team which has one common goal; to change the way we search, find, discover and purchase products based on personalized recommendations from your network free off advertisements and without privacy issues.</p><p>Our goal is to become the world's leading Social Discovery Platform for products, where only relevant personalized products will surface in your stream and search results based on the experience from the people you follow on specific content in your network.</p><p>We are hiring a hands on full stack mobile web engineer for a full responsive mobile web application - Full Time · Remote OK · Eindhoven · Software Engineer · Back End Programming · Full Stack Development · Full-Stack Web Development · HTML5 &amp; CSS3\n&amp; \nWe are looking for a hands on full stack IOS developer\nFull Time - Remote OK · Eindhoven · Software Engineer · iOS Development · Ruby on Rails -</p><p>Please apply on angelist <a href=\"https://angel.co/izooble-find-what-matters/jobs\" rel=\"nofollow\">https://angel.co/izooble-find-what-matters/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Tech Campus, Eindhoven,", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6828025", 
        "user": "Izooble"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">15gifts \nBRIGHTON, UK\n( <a href=\"http://www.15gifts.com\" rel=\"nofollow\">http://www.15gifts.com</a> )<p>Front End Developer.</p><p>The company is growing rapidly and our technology already powers some of the largest corporations and SME’s in the UK including Virgin Media, Orange, T-Mobile and The Times.</p><p>We understand the appeal of freelancing for a developer so we strive to bring that same level of freedom and creativity into the role, whilst also offering a vested stake in a very exciting company.</p><p>We are looking for a talented and creative Front End Developer to help bring innovative, engaging and beautiful user interfaces to life. Working directly with our experienced back-end engineers, in-house designers and the clients themselves, this is an opportunity to influence the business in a highly visible role.</p><p>Although a sophisticated decision algorithm is at the heart of our platform, we are equally obsessed with interface design and user experience — trying to achieve pixel perfection with every integration.</p><p>Brighton, London or Europe (remote) considered.</p><p>More info on the role here: <a href=\"http://www.wiredsussex.com/jobs/JobSearchResult.asp?Item=12834\" rel=\"nofollow\">http://www.wiredsussex.com/jobs/JobSearchResult.asp?Item=128...</a></p><p>Please drop us a line at hello@15gifts.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827968", 
        "user": "fujikowa"
    }, 
    {
        "address": "Auburn Hills, MI, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Delphi Automotive, LLP - <a href=\"http://delphi.com/\" rel=\"nofollow\">http://delphi.com/</a> - Auburn Hills, MI\nI work in the cluster division and I'm one of the leads on Cadillac CUE.  We're looking for C and C++ folks who also are experienced with electronics.  We work on some seriously cool new technology.  Automobiles are rapidly increasing cockpit technology with more advanced center stack displays and clusters.  You may also get to do a bit of robotics as some of our software controls needles and dials too.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.6875323, 
        "location": "Auburn Hills, MI", 
        "lon": -83.2341028, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828135", 
        "user": "EricMayo"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Seven Bridges Genomics -- Cambridge, MA<p><a href=\"http://careers.stackoverflow.com/jobs/44260/genomic-data-engineer-seven-bridges-genomics\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/44260/genomic-data-eng...</a>\n<a href=\"http://careers.stackoverflow.com/jobs/44259/core-r-d-developer-seven-bridges-genomics\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/44259/core-r-d-develop...</a></p><p>We are doing exciting things at the cutting edge of bioinformatics; see the job listings for more details. Other job postings (for scientists and non-scientists) are listed at jobs.sbgenomics.com.</p><p>H1B candidates are welcome.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828037", 
        "user": "SBG_jobs"
    }, 
    {
        "address": "Richmond, VA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Launch Media Network - <a href=\"http://www.launchpowered.com/\" rel=\"nofollow\">http://www.launchpowered.com/</a> - Richmond, VA - INTERN, REMOTE, Various Positions<p>At Launch Powered we are building next generation platforms that allow passionate people to share their interests. We are a private equity funded company with huge plans and we're build our team to make those plans a reality. Our initial focus is in video games with our Guild Launch <a href=\"http://www.guildlaunch.com\" rel=\"nofollow\">http://www.guildlaunch.com</a> and GameSkinny <a href=\"http://www.gameskinny.com\" rel=\"nofollow\">http://www.gameskinny.com</a> sites.</p><p>We are looking for writers/content creator interns, marketing folks, UI designers and PHP developers to help us build our platforms as we expand in gaming and explore other verticals. Local is preferred for the developer and marketing positions and remote, especially in key areas like Austin, San Francisco, Atlanta and New York is preferred for writers and content creators.</p><p>Send your info to IAmAwesomeSauce@guildlaunch.com.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.5407246, 
        "location": "Richmond, VA", 
        "lon": -77.4360481, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827766", 
        "user": "StephenGL"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">FT, remote/in office, mountain view ca.<p>Mirantis.com is a leading OpenStack company - looking for cloud architects, technical project managers, deployment engineers and developers.</p><p>Posting from phone so please forgive the short post. Come check us out we have some amazing projects going on right now</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6827986", 
        "user": "samstave"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Delphi Automotive is looking for software architects.  We work on cutting edge automobile electronics and software.  Many automakers are moving toward smarter center displays and display clusters.  Much of the work is embedded C and C++.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828104", 
        "user": "EricMayo"
    }, 
    {
        "address": "Berlin, Germany", 
        "country": "DE", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Berlin, Germany<p>Compass Security is looking for Penetration Testers/Security Consultants. More Information: <a href=\"http://www.csnc.ch/de/profil/security-analyst-de.html\" rel=\"nofollow\">http://www.csnc.ch/de/profil/security-analyst-de.html</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.52000659999999, 
        "location": "Berlin", 
        "lon": 13.404954, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6827939", 
        "user": "iron"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#5a5a5a\">UXP Systems is hiring in our R&amp;D team in our Toronto HQ. We're growing to meet the demand from our rapidly growing customer base. We have multiple open positions for Java developers, Web developers (JS/HTML5/CSS), and mobile developers for iOS and Android. Please visit our corporate site, uxpsystems.com and send your profile to careers@uxpsystems.com.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6828042", 
        "user": "mnejadsattary"
    }
]