[
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">KeepSafe - San Francisco - H1B welcome<p>We're looking to hire Android develpers and iPhone developers.</p><p>-- The company --</p><p>KeepSafe wants to solve the consumer privacy problems. We work to empower every user to be in control of their data. To do this, we need to make Privacy and Security Technology easy to apply for the average user on all popular platforms.</p><p>Our first product is a vault for Android and iPhone. Over 20 million customers use this product and but our plans are much bigger than that. Happy to share more in person: zouhair AT getkeepsafe DOT com</p><p>We're a team of 9, all of us write code. We raised Series A from Floodgate and SV Angel in July.</p><p>-- Jobs : Mobile developer (Android or iOS or both) --</p><p>Your job is to build easy-to-use apps that make privacy, encryption and security technology useful for average users. We are looking for ambitious developers who will take KeepSafe from 20 to 100 million users.</p><p>Requirements:</p><p></p><pre><code>  * Excellent knowledge of the framework including the limits\n  * Sound understanding of programming fundamentals\n  * Strong programming skills. Code speaks stronger than degrees.\n</code></pre>\nBenefits:<p></p><pre><code>  * Market salary \n  * Meaningful equity\n  * Medical, Dental, Vision</code></pre></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996410", 
        "user": "zmb"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Hi all,<p>As you're planning your New Year's resolutions, consider: if you could work anywhere, what would you do?</p><p>- Wouldn't you want to work towards <i>really</i> making the world a better place?</p><p>- Wouldn't you want to work with a top-notch team alongside some of the brightest engineers in the industry?</p><p>- Wouldn't you want to work on solving interesting problems that haven't been solved before?</p><p>---</p><p>At Khan Academy, I truly believe that you can find all of those things and more. We're a small, 50-person non-profit tech startup making a big difference in the world. Here's a testimonial we received just last night:</p><p><i>December 31, 2013</i></p><p><i>I have recently turned thirteen, and accompanied by your proficient and efficient teaching style, I have successfully advanced into multi-variable calculus. When I was 9 I began Calculus. However when I started these courses, I was capable of grasping these concepts in a deep level of intuition. Now I am advancing into Green's Theorem, Triple Integrals, Divergence, Curl, Gradient, and Partial Derivatives. In essence, I would just like to say thank you for providing this revolutionary interconnected education interface. Hopefully I will be taking the AP Calculus examinations soon!</i></p><p><i>Thank you for everything!</i></p><p>How cool is that? Think of how many similar students are born to learn advanced math and science but never get the chance. We're working to change this. This letter is one story; every month we hear about hundreds more lives like this that we've totally transformed.</p><p>We're starting to do a big mobile push. Around 20% of our traffic comes from phones and tablets but we have only two mobile devs right now. We're totally overhauling our iOS app; if you join us now you can build large parts of a product that's guaranteed to have millions of users. If you are (or you know) a mobile developer we can build a great team around, <i>please reach out</i>. You can't find this sort of opportunity in very many places.</p><p>Lots of people know us for Sal's videos, but we also have hundreds of videos by other teachers and a huge library of interactive exercises. Our 100,000+ math problems have been done over 1.5 billion times total. That's a huge number.</p><p>With this scale, we're able to study learning in a way that no one has previously been able to do. We've run tests which show that students learn more when they're advanced quicker by a custom machine-learning algorithm [1]. Right now we have dozens of A/B tests running to help us understand what we can do to make people learn more, such as testing how Socratic-style lectures affect engagement. (We're also beginning to release anonymized data to interested researchers.)</p><p>Whether you're a machine learning guru or you take pride in perfecting UI details for a dropdown menu [2], we have something for you. You'll be working alongside a small team with the best in the business – though we have \"celebrity\" devs like jQuery creator John Resig and Google's first employee (and former Director of Technology) Craig Silverstein, we have many more you haven't heard of but who are just as awesome.</p><p>We really have a great team and culture. We use (and contribute to) new technology [3], we invest heavily in mentoring interns (and full-timers) [4], we have lots of fun at and around work [5], and even though we're a non-profit, we pay well too.</p><p>---</p><p>As I said above, mobile is a big priority for us and we're doing everything we can to find great mobile devs.</p><p>We're hiring engineers (frontend, backend, mobile, data science), product designers, a community manager, and more. And if you want to have an amazing summer (or fall or spring) building real features for real users, we're hiring interns too.</p><p>Please apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https://www.khanacademy.org/careers</a> directly (say you saw us on HN!), but if you have questions, feel free to ask here or to email me at alpert+HN@khanacademy.org.</p><p>Thanks for reading; have a great 2014!</p><p>[1]: <a href=\"http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning\" rel=\"nofollow\">http://derandomized.com/post/51729670543/khan-academy-machin...</a></p><p>[2]: <a href=\"http://bjk5.com/post/44698559168/breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http://bjk5.com/post/44698559168/breaking-down-amazons-mega-...</a></p><p>[3]: <a href=\"http://joelburget.com/backbone-to-react/\" rel=\"nofollow\">http://joelburget.com/backbone-to-react/</a> (sorry about the background, but there are dinosaur pictures!)</p><p>[4]: <a href=\"http://bjk5.com/post/71559049069/the-most-common-feedback-we-give-dev-interns\" rel=\"nofollow\">http://bjk5.com/post/71559049069/the-most-common-feedback-we...</a></p><p>[5]: <a href=\"http://life.khanacademy.org/\" rel=\"nofollow\">http://life.khanacademy.org/</a></p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995058", 
        "user": "spicyj"
    }, 
    {
        "address": "Bellevue, WA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Planetary Resources - Bellevue, WA - Full time<p>Planetary Resources, Inc (PRI), the asteroid mining company, is seeking a Flight Software and Ground Software Engineer (a combined role) for the development of innovative spaceflight products and support systems.</p><p>PRI’s vision is to mine near-Earth asteroids for raw materials, ranging from water to precious metals through the rapid development of innovative and cost-effective exploration technologies. Resource extraction from asteroids will deliver multiple benefits to humanity and grow to be valued at tens of billions of dollars annually. The effort will tap into the high concentration of precious materials found on asteroids and will provide a foundation for further space exploration and a sustainable supply of raw materials to the ever-growing population on Earth.</p><p>As a software engineer, you will be responsible for creating the software products that enable PRI to deploy and operate state of the art robotic spacecraft. These software products cover the full spectrum of platforms and applications, from mission critical assembly-level code running on an embedded microprocessor to cloud-based high performance data processing.</p><p>Most work is in C++. Experience in any of: C, Javascript, Python, SQL, Assembly for x86, ARM, or microcontrollers helps.</p><p>Apply online: <a href=\"http://www.planetaryresources.com/careers/\" rel=\"nofollow\">http://www.planetaryresources.com/careers/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.610377, 
        "location": "Bellevue, WA", 
        "lon": -122.2006786, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995653", 
        "user": "typpo"
    }, 
    {
        "address": "Menlo Park, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Transcriptic: Full-stack developer (emphasis on frontend)<p>Menlo Park, CA</p><p>Transcriptic is \"Amazon Web Services\" for the life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic's central, highly automated 'biocenter' in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We're building a long-term company to completely change the way life science research and development is done.</p><p>We're looking for a highly talented full-stack web developer. On top of our robotic workcells is a slew of internal services as well as a Rails app that acts as our lab information management system and customer-facing UI. Challenges range from building rich, interactive interfaces for composing protocols to presenting analytical data generated by the lab back to the user. We use d3, Backbone, and some CoffeeScript today, but you'd be free to choose your own tools and libraries.</p><p>We're a small startup (you'd be #10), but well funded and have customers. You'd be able to work on interesting science and hard technology in a really small, all technical team with lots of freedom and resources.</p><p>A biology background is preferred but not strictly necessary for outstanding people.</p><p>Recent coverage: <a href=\"http://theverge.com/2013/12/18/5216738/inside-transcriptic-the-secret-robot-lab-that's-shaking-up-science\" rel=\"nofollow\">http://theverge.com/2013/12/18/5216738/inside-transcriptic-t...</a></p><p>team at transcriptic.com</p><p><a href=\"https://www.transcriptic.com/\" rel=\"nofollow\">https://www.transcriptic.com/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4538274, 
        "location": "Menlo Park, CA", 
        "lon": -122.1821871, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995668", 
        "user": "frisco"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Webflow (YC S13) - Mountain View, CA or Remote - Full time<p>At Webflow, we're creating a killer web design platform. We make it easy to create and launch incredibly-custom, responsive websites (and soon, web applications) using our in-browser editor. Our mission is to empower designers/agencies/entrepreneurs/mygrandma to create beautiful and functional web experiences, without having to learn all the crazy ins and outs of web development.</p><p>We are building really advanced frontend tools in HTML5/CSS3/JavaScript (+ Angular/Knockout/VanillaJS/Node/Mongo/etc), and are looking for experienced front-end hackers who have a strong sense of design and a passion for creating amazing and precise tools. Our entire front-end dev team is composed of designers who have fallen in love with programming, so if that describes you, we should talk!</p><p>Here's an example of the kinds of tools you'd help us build: <a href=\"http://playground.webflow.com/\" rel=\"nofollow\">http://playground.webflow.com/</a></p><p>We're also looking for a world-class web designer to join our team full-time. Your job would be to use Webflow for a living, build sites for clients, create awesome case studies for others to learn from, and overall help us make Webflow more awesome. We already have over 60,000 web designers using our platform, and you would be their #1 champion.</p><p>We're well-funded by awesome investors and generating healthy revenue, so we're in this for the long haul. We have awesome perks and benefits, we work sane hours, have a lot of fun, and have great compensation (salary + equity) to boot. If you want to get in on the ground floor of changing the face of web development, this is where you should be.</p><p>If you're interested, I'd love to have a chat. Shoot me a note to vlad@webflow.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996330", 
        "user": "callmevlad"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">London, UK / REMOTE --<p>Futurescaper Ltd. is hiring a top-notch D3 &amp; data visualisation expert to help improve and open-source our network-graphing subsystems. We are a small but rapidly growing startup that produces bespoke collective intelligence platforms for a wide variety of clients. You'll work with a fun bunch of people, taking the lead on a high-profile open-source project that should create a real stir when it's released.</p><p>This is a 3 month contract with the option to extend to a permanent position if both parties desire. London / UK locations preferred, but if you have the right portfolio and are willing to work around our timezone, we'll work with people anywhere.</p><p>Send CV and enquiries to: jobs@futurescaper.com\nSee more about the company and the job at: <a href=\"http://www.futurescaper.com/#contact\" rel=\"nofollow\">http://www.futurescaper.com/#contact</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996156", 
        "user": "nkoren"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">DICOM Grid - Phoenix AZ, or REMOTE - JavaScript Developer<p>DICOM Grid, a SaaS start-up in the healthcare technology field, is looking for a JavaScript developer to maintain and enhance DICOM Grid’s front-end medical image sharing and reading web application. You will report to the Director of Dev Ops.</p><p>Familiarity with modern front-end web development is essential, including but not limited to HTML5, CSS, JavaScript, LESS, JQuery, Underscore, Handlebars, Backbone. Experience working in the medical industry (DICOM, HL7, PACS, etc.) would be a bonus, but is not required. The ideal candidate would be able to work independently with minimal supervision, and be enthusiastic about keeping up-to-date with the latest web technologies.</p><p>The team is distributed with team members working remotely in Phoenix, Los Angeles, Boston, and New York.</p><p>Position Responsibilities</p><p>- Plan, evaluate, implement, test and document new features and bug fixes for the DICOM Grid web application.</p><p>- Work with other development team members to integrate with backend services.</p><p>- Work with DevOps to deploy code into our production and UAT environments.</p><p>- Work with customers and professional services to gather requirements.</p><p>- Conform to company standard operating procedures.</p><p>What qualifies you to join?</p><p>- A combination of a college degree in CS, Math, Physics, or related, relevant work experience, and/or a strong open source portfolio.</p><p>- General interest in the healthcare field.</p><p>- Strong communication and interpersonal skills.</p><p>- High enthusiasm and desire to work on an entrepreneurial team.</p><p>- Roll-up-the sleeves attitude is a must.</p><p>- Meticulous attention to detail with strong organization skills</p><p>- Heavy emphasis will be placed on problem solving skills, personal initiative and good people management/relationship skills. Sense of humor is mandatory.</p><p>Logistics</p><p>- This is virtual position, you must be able to work from home effectively</p><p>- Base salary and stock options depend on experience; health insurance, paid holidays and vacation are part of the package.</p><p>Send your resume along with links to your StackOverflow, GitHub profiles, etc. to pfreeman+hn@dicomgrid.com. For bonus points, include a solution to the following short task, including code in JavaScript or the frontend language of your choice: given a JSON object conforming to the schema { value: ..., collapsed: (true|false), children: [...] }, where children is an array of objects conforming to the same schema, and a function render taking values to DOM elements, layout the information for read-only display, with the ability to expand/collapse individual nodes. The aim of the exercise is to demonstrate familiarity with Javascript, so a very basic UI is all that is needed.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996284", 
        "user": "paf31"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Factual is currently hiring engineers and data lovers of all levels in the SF Bay Area, Los Angeles, and Shanghai.<p>Factual’s location platform enriches mobile location signals with definitive global data, enabling personalized and contextually relevant mobile experiences. Built from billions of inputs, the data is constantly updated by Factual’s real-time data stack. We were recently named one of \"50 Disruptive Companies in 2013\" by MIT Technology Review. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Trulia, and Newsweek.</p><p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. A great example is one of our most recent products, Geopulse Audience, which stands at the intersection of high quality places data and large scale analysis of user geo-data: <a href=\"http://www.factual.com/products/geopulse-audience\" rel=\"nofollow\">http://www.factual.com/products/geopulse-audience</a> .\nIf you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure (<a href=\"http://www.factual.com/jobs/clojure\" rel=\"nofollow\">http://www.factual.com/jobs/clojure</a>), machine learning, NLP, algorithm design, or Hadoop.</p><p>You can email me personally at jake@factual.com, or view our job postings and apply directly via Jobvite:</p><p>Los Angeles/SF Bay Area Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&amp;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&amp;s=Hackernews</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996077", 
        "user": "jboggan"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">REMOTE, relocation to Germany possible if desired.<p>Eyeo, the company behind Adblock Plus, is looking for web developers, Android developers, C++ developers and DevOps engineers.</p><p>We're in the middle of changing the world of online advertising for the better, and there's lots of work to do. We're also experimenting with new, supplementary ways of content monetisation.</p><p>What we do is disruptive and controversial, and we've had our share of bad press in the past. Much of it lies, but there's also legitimate criticism we need to address. We do this by being as open as we can possibly be, which is what we believe we ought to do anyway. Mozilla is pretty close to what we want Eyeo to be, and we'll get there.</p><p>Drop me a line at felix@adblockplus.org if you're up for all this, I'd love to hear from you. Please include a list of notable open source projects you are contributing to or have contributed to. We're an open source project, so that'd be a big plus.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995241", 
        "user": "fhd2"
    }, 
    {
        "address": "Grand Rapids, MI, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Mutually Human - Grand Rapids, Michigan  (INTERN yes, REMOTE/H1B no)<p><a href=\"http://www.mutuallyhuman.com/\" rel=\"nofollow\">http://www.mutuallyhuman.com/</a></p><p>---------------------------------------</p><p>We are a small team passionate about making people's lives better through software.</p><p>A little bit about us:</p><p></p><pre><code>  - We write custom software of all shapes and sizes for clients all over the US\n\n  - Though everyone here is fluent in Ruby, we don't artificially limit ourselves.\n    In the past few months, I've worked with Objective-C, Backbone.js (inside\n    PhoneGap), Angular.js, Ruby (of course) and a little bit of Java and C#.\n\n  - We practice a sustainable pace. We recognize that we each have lives,\n    activities, and families outside of work. Late nights and &gt; 40 hour weeks are\n    rare by design.\n\n  - We're agile, but not dogmatic about it. Our process evolves to suit our needs.\n\n  - We offer competitive salaries, health/vision/dental insurance, quarterly profit\n    sharing, retirement + match, weekly catered lunches, and a top-floor office\n    with snacks, guitars, and your choice of standing or sitting desks.\n</code></pre>\nA little bit about Grand Rapids:<p></p><pre><code>  - 2.5 hours from Chicago and Detroit, less than an hour to the beach.\n\n  - Lots of great beer. Founders Brewery (a mile from our office) has 3 beers in\n    the Beer Advocate top 15. HopCat is a “World Class” bar on BA.\n    Just look here: http://beeradvocate.com/beerfly/city/43\n\n  - If you’re renting anything larger than a breadbox in the Bay Area or NYC,\n    you can afford a house here. I bought a nice house with a mortgage payment\n    30% lower than the rent of my 1 bedroom apartment in Mountain View.\n\n  - A growing technology and startup community.\n</code></pre>\nA little bit about you:<p></p><pre><code>  - You love writing software, and you have a few years of experience doing it.\n\n  - You learn new stuff quickly. You’ve used a lot of technologies, but you’re not\n    afraid to use more. It would be nice if you use and love Ruby, but not required.\n\n  - You believe software is written for humans, not computers.\n\n  - You want to come into work every day and enjoy the people you work with.\n</code></pre>\nI'm a software craftsman on this awesome team. If you're interested, send me your resume/CV and a little bit about why you’re interested:<p>ej@mutuallyhuman.com</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 42.9633599, 
        "location": "Grand Rapids, Michigan", 
        "lon": -85.6680863, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995211", 
        "user": "ejdyksen"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">The Wikimedia Foundation :)<p>We make sure the tech behind Wikipedia and sister projects is up and running smoothly. A rather high number-of-users/supporting-staff ratio. <i>All</i> the work we do is  public and open source (<a href=\"https://git.wikimedia.org/\" rel=\"nofollow\">https://git.wikimedia.org/</a>). You get to work with other paid staff from all around the world, as well as wonderful volunteers. We are about 200 people now, and have an office in San Francisco (although more than half the staff is remote).</p><p>Various positions listed at <a href=\"https://jobs.wikimedia.org\" rel=\"nofollow\">https://jobs.wikimedia.org</a> :)</p><p>Both remote workers and people seeking H1B are welcome (Do check the particular job posting to confirm)</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995408", 
        "user": "yuvipanda"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Clever - San Francisco, CA - Full time &amp; Summer Intern<p>Clever helps schools bring digital learning to the classroom. We take care of the massive amount of data that needs to move behind the scenes, letting schools focus on using technology to improve learning.</p><p>We're hiring engineers - full-stack generalists, as well as specialists in security and infrastructure/high availability.</p><p>Join a small team (15, half engineers) that's on to something big. Over 1/9 schools in the US use Clever today. Most development is in Javascript, Python &amp; Go.</p><p>Learn more &amp; apply online: <a href=\"https://getclever.com/about\" rel=\"nofollow\">https://getclever.com/about</a> or send me an email if you have questions (dan@, I'm cofounder/head of product)</p><p>(Just realized we don't have an internship opening posted - just apply for the \"Full-stack\" position &amp; mention that you're interested in an internship in your email!)</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995976", 
        "user": "2arrs2ells"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Software developer, Stat.io - Cambridge UK, or REMOTE<p>We aim to allow users to understand the socio-economics of any location, from the population of a country to the crime rate of a postcode. Organisations can then use this data to improve their decision-making, whether it's businesses making strategic sales and marketing decisions, NGOs trying to understand a country, or somebody else entirely.</p><p>The two main technical challenges we face are:</p><p>* Importing data from many different sources, from APIs to Excel files, and understanding their structure. For instance, given an Excel file, we need to determine the structure of any tables, such as which columns represent a location. We also want to pick up as much metadata as possible, such as a description of the dataset.</p><p>* Designing a UI that allows users to find what they're looking for, and then making that UI fast (we're currently up to about 10,000,000 datasets and 200,000,000 data points)</p><p>Our technology stack:</p><p>* Postgres + PostGIS to store the data we've imported</p><p>* Elasticsearch for... search</p><p>* Python code to import data from the original source to our database (with a tiny bit of Redis for some basic queueing)</p><p>* A thin PHP web application to display the data (probably soon to be replaced by node.js)</p><p>Things we like:</p><p>* Test-driven development and good test coverage (when it makes sense -- sometimes, it's better to manually test a very thin UI than to keep worrying about brittle UI tests)</p><p>* Releasing early and often. We deploy features as they're ready, and try to break work down to small pieces.</p><p>* Doing the simplest thing that could possibly work. Rather than planning for every possibility up front, we implement something small but useful to start with, and then iterate and refactor as necessary.</p><p>What we're looking for:</p><p>We were founded in Cambridge last year, and we're now working towards a product covering public data for the UK.</p><p>We're looking for a software developer to join us, initially part-time for £1,000 a month + stock option plan. We're joining Microsoft Ventures in London from February 2013, so you can join us in Cambridge or London, or work remotely.</p><p>If you have any questions, feel free to get in touch: contact@stat.io. If you'd like to apply, please send us a CV and a paragraph describing why you're interested.</p><p>You can find out more about us on our website: <a href=\"http://www.stat.io/\" rel=\"nofollow\">http://www.stat.io/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995088", 
        "user": "mwilliamson"
    }, 
    {
        "address": "Kent, WA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Blue Origin - Kent, WA - Full Time<p>Blue Origin is developing technologies to enable private human access to space at dramatically lower cost and increased reliability. We're looking for top-notch people who are passionate about space and our mission. We have multiple openings for software engineers with a variety of skillsets. C++, Java and Python are the primary languages, but we also do lots of work with other technologies to supplement: Angular, Bootstrap, GWT, Spring, Neo4J, MongoDB and AWS to name a few. We're looking for both experienced folks and new graduates looking to gain experience.</p><p>Visit us at <a href=\"http://www.blueorigin.com\" rel=\"nofollow\">http://www.blueorigin.com</a> -- some of our positions are listed and some are unlisted, so don't hesitate to contact us even if you don't see an exact match.</p><p>Send us your resume: jobs@blueorigin.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.3809335, 
        "location": "Kent, WA", 
        "lon": -122.2348431, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995962", 
        "user": "thematt"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Planetary (<a href=\"http://planetary.io\" rel=\"nofollow\">http://planetary.io</a>) - REMOTE, New York, NY or St. Louis, MO.<p>Looking to hire a head of Business Development. You'll help seek out potential leads, bring in new clients, and close new contracts.</p><p>We are a young design and development agency; you'd have the opportunity to really drive the direction and growth of the company. Technical or design experience is a huge plus.</p><p>--</p><p>At Planetary, we have designed and developed just about everything there is to design and develop — games for a Super Bowl campaign, internal apps for startups, point-of-sale applications for large national brands and dozens of issues for a number of periodicals. In doing so, we've learned the particularities of each different medium, but more importantly, we've gained a sublime handle on how to partner with our clients and become an integral, valuable part of their design and development process.</p><p>Whether for small brands, large brands, medium brands, brands without a brand, all the work we've done in the past few years has been intent on providing a talented team, clear communication, plain expectations and flawless execution. That's what you can expect from Planetary. Strong design and quality development with an unrivaled attention to detail.</p><p>--</p><p>If you're interested, send me a little blurb about yourself along with any relevant links or information (résumé, Github, Dribbble, etc.) and why you're interested: team@planetary.io</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995731", 
        "user": "endtwist"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Entelo - San Francisco (SOMA), CA - Full-time - <a href=\"http://www.entelo.com/\" rel=\"nofollow\">http://www.entelo.com/</a><p>Entelo allows recruiters to search for the most talented people across the web. With over 300 million social profiles in its database, powerful search to surface relevant candidates and patent-pending technology to help discover candidates who may be open to new opportunities, Entelo dramatically improves your ability to find the right talent. Our easy-to-use collaborative tools help streamline the recruiting process and allow recruiters to spend time more effectively and efficiently.</p><p>Our team is small, but growing so you'll play an integral role in building something meaningful. We work hard while respecting that our colleagues have well-rounded lives, and we strive for a diverse, welcoming, and respectful environment. We have over 90 customers including Box, Yelp, Square and Groupon and recently announced our series A round of funding <a href=\"http://techcrunch.com/2013/06/19/entelo-the-big-data-recruiting-platform-used-by-box-yelp-and-square-lands-3-5m-from-battery-and-menlo/\" rel=\"nofollow\">http://techcrunch.com/2013/06/19/entelo-the-big-data-recruit...</a></p><p>Some of our perks include 100% coverage of employee health care premiums, $300 noise-canceling headphone allowance, and 1:1 matching for donations to non-profits.</p><p>Current openings:\nEngineering (Data): <a href=\"http://www.entelo.com/careers/engineering/data_engineer\" rel=\"nofollow\">http://www.entelo.com/careers/engineering/data_engineer</a></p><p>Engineering (Full-Stack): <a href=\"http://www.entelo.com/careers/engineering/full_stack\" rel=\"nofollow\">http://www.entelo.com/careers/engineering/full_stack</a></p><p>Sales: <a href=\"http://www.entelo.com/careers/sales/inside_account_executive\" rel=\"nofollow\">http://www.entelo.com/careers/sales/inside_account_executive</a></p><p>Customer Success: <a href=\"http://www.entelo.com/careers/customer_success/director\" rel=\"nofollow\">http://www.entelo.com/careers/customer_success/director</a></p><p>We just moved into a beautiful open office in SOMA right across from the 4th and King Cal-Train station and near AT&amp;T Park.</p><p>I'm the founder and you can email me directly at jon at entelo dot com or call me at 310-351-7275.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995705", 
        "user": "jonbischke"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Hightower, New York NY (REMOTE, H1B)<p><a href=\"http://www.gethightower.com\" rel=\"nofollow\">http://www.gethightower.com</a></p><p>Ground floor opportunity at a commercial real estate software startup :)</p><p>Commercial real estate (CRE) is one of the largest parts of our economy ($7T in U.S. asset value) but incredibly underserved by technology. We've actually met teams using different color sheets of paper to manage and track their sales pipeline. One of our investors described the opportunity as \"finding the proverbial lost tribe in the amazon\" [1]. If reimagining this world sounds interesting, come talk to us – we've got a product in market, just closed a 2.1M seed round, and are hiring engineer #1.</p><p>Our stack is Rails + AngularJS. We've been using AngularJS since day 1 and love it (and have paid it forward in some pull requests). Our development workflow is simple and robust – Trello for task management, CircleCI for continuous integration, and deployment to Heroku.</p><p>The product is a collaboration and workflow platform for CRE leasing teams. Our goals are to dramatically increase their operational efficiency with a purpose built web + mobile experience, and to leverage the underlying data to deliver performance insights to insititutional owners.</p><p>Hightower is being actively piloted by some of the biggest names in CRE, and we've raised a 2.1M seed round led by BVP and Thrive Capital with participation from a host of amazing angels and VC including Aaron Levie, Lee Linden, David Tisch and Gary Vaynerhuck. Our founding team is Brandon Weber (CEO – CMU graduate and former VP @ CBRE), Niall Smart (CTO, formerly founder of YC W09 company Echodio, which sold to RealNetworks) and Donald DeSantis (CDO, formerly founder of LIFFFT, early Redfin employee).</p><p>We're hiring engineer #1. Knowledge of CRE is not a pre-requisite. In fact, possibly the less you know on that front, the better :) You should have deep experience with any or all of: Rails, Backbone, Angular, Ember, Django, Node -- and a strong history of building product at startups. Meaningful equity + cash compensation is on offer for the right person.</p><p>Drop me a line to learn more – niall.smart (at) gethightower.com.</p><p>Happy new year!</p><p>[1] <a href=\"http://www.bvp.com/blog/hightower-poised-modernize-commercial-real-estate-business\" rel=\"nofollow\">http://www.bvp.com/blog/hightower-poised-modernize-commercia...</a>\n[2] <a href=\"http://www.pehub.com/2013/12/hightower-secures-2-12-mln-in-seed-financing/\" rel=\"nofollow\">http://www.pehub.com/2013/12/hightower-secures-2-12-mln-in-s...</a></p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995835", 
        "user": "niallsmart"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Secret: HALF-TIME/INTERN/REMOTE<p>Hey, HN. One of you is perfect for this idea.</p><p>I am a serial entrepreneur who is currently trapped in the body of a freelance contractor. I have a relatively stable 40 hour a week project, and incoming projects as well that I generally can't take due to lack of resources (time, the most precious one)</p><p>So here's the idea.\nYou. Are interesting and have some experience in coding (webapps, mobile, whatever) would be a coding apprentice.\nI would give you a guaranteed 20 hour a week gig for now, and flex additional work as it comes in and you are available.</p><p>You would work on entrepreneurial ideas and contracts and get paid for doing so. If something took off the ground we could negotiate revenue/equity, but no matter what you will be getting paid.</p><p>Here is what you get.\nMoney\nFreedom and Flexibility (need the day off to deal with a hangover because you are in college and its friday?)\nReal World Education\nAbility to become a killer coder\nand whatever else. i'm pretty flexible</p><p>Languages?\nPython/Ruby Obj-C Javascript\nYou name it.\nIf you can show competency in some language I currently do, then we can work together and you can get paid to learn and become an expert at any other languages as required.</p><p>About me, your 'boss'.\nLate 20s. Been in and out of various startups. Started ideas from scratch. Reasonably connected in the 'valley'. No stranger to a term sheet. I have done hiring for a YC company.  Been on both the business and engineering side of places.</p><p>Currently living in NYC (manhattan) with enough room for you to come clock hours, but you can be remote as well, or both.\nI have been travelling a lot because it means that working 9-5 EST is a much more reasonable 12-8 or even sometimes 9pm - 5am.</p><p>I like tinkering with OSS and hardware too, obsessed with gadgets.</p><p>Long story short, you will get paid to learn how to code in the real world, become an entrepreneur or freelancer (or both) and then hopefully be able to repeat this process.</p><p>You'll get hands on attention and code reviews without some PM breathing down your neck. (unless you are working on a project that requires it).</p><p>We'll figure out a good hourly rate, and when you are working on a project that is paid, probably double it. And then fall back to the normal rate when we are working on whatever random ideas I want to incubate.</p><p>email hn0114@boun.cr with a little bit about yourself, a resume if you have it, and most importantly either a github or code sample.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995358", 
        "user": "bound008"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Vurb (<a href=\"http://vurb.com\" rel=\"nofollow\">http://vurb.com</a>) - San Francisco, CA - Full-time (no remote)<p>Max Levchin funded, early-stage consumer startup - <a href=\"http://techcrunch.com/2013/02/20/contextual-content-engine-vurb-wants-to-make-the-internet-seamless\" rel=\"nofollow\">http://techcrunch.com/2013/02/20/contextual-content-engine-v...</a></p><p>We're working on search, browsing, and sharing, by connecting the services we use in a contextual way that's more usable, efficient, and social (e.g., no more having lots of windows/tabs open). We do this through unique UX/UI combined with search, machine learning, big data, and more.</p><p>Engineering Positions:</p><p>* JavaScript (node.js, backbone.js) - generalist / full-stack development</p><p>* Search / Data Science - search / classification / ranking, machine learning, recommendations, NLP, data crawling/processing</p><p>We're stealth but funded by Max, Drew Houston (Dropbox), Naval Ravikant (AngelList), Arrington (CrunchFund), and many others. If you're looking to join a small team that solves complex problems and is making something people will use daily, then come find out what we're up to.</p><p>jobs@vurb.com | <a href=\"http://vurb.com/jobs\" rel=\"nofollow\">http://vurb.com/jobs</a> | angel.co/vurb</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996233", 
        "user": "blo"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Amicus (S12) - New York City (FULLTIME, INTERN, H1B)<p>Write Code That Empowers Changemakers.</p><p>Do you have an irrepressible need to have a positive social impact on the world? Do you like solving difficult technical challenges? If so, Amicus might be the right place for you.</p><p>Organizations have used Amicus to win marriage equality, protect public education, and fight for economic justice. By enabling great causes to do what they do, better, Amicus impacts hundreds of millions of lives in fundamental ways.</p><p>We're a team of 14 in SoHo, New York City, and are hiring senior Rubyists, senior Javascripters, and full stack devs. Our mission is social impact, but we take our tech seriously. Check our our latest open source project here: <a href=\"http://www.enddash.com/\" rel=\"nofollow\">http://www.enddash.com/</a></p><p>Find out more about us here: <a href=\"http://amicushq.com/\" rel=\"nofollow\">http://amicushq.com/</a></p><p>If you're interested in joining, head to <a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a></p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995340", 
        "user": "sethbannon"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">WebAction (www.webaction.com) in Downtown Palo Alto - Full Time Hiring Front End Web Developers, Platform Engineers, and Application Developers \nJobs@WebAction.com<p>WebAction is a company based in the San Francisco Bay Area, providing an end-to-end platform that aims to enable the next generation of real-time, data driven applications. Founded by a team of Silicon Valley veterans with proven track records, WebAction is backed by some of the most respected names in Silicon Valley. We're also well funded (recently raised $11m Series B by a private equity firm with a $15 billion fund).</p><p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates. Our office is also a short walk from some great restaurants and coffee spots on University Avenue in Downtown Palo Alto.</p><p>For the front-end position, we ask that you have the skills to contribute to a user interface and data visualization dashboard built on top of real-time, big data applications. Having an eye for user interaction design is a plus.</p><p>These are some of the tools you can work with:</p><p>-backbone.js</p><p>-jQuery</p><p>-HTML5/CSS3</p><p>-D3.js</p><p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to implement a scalable, highly optimized data management infrastructure. For those of you interested in scalable, low latency data platforms, working at WebAction is an opportunity to work on one yourself. The following skills are desirable:</p><p>-Large-scale distributed systems</p><p>-Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper),</p><p>- Data Serialization (Avro / Thrift / Protocol Buffers)</p><p>- NoSQL / BigData (MongoDB / Cassandra / HBase),</p><p>-Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries</p><p>For the Application Development position, please follow the link to our detailed description of the role:\n<a href=\"http://www.glassdoor.com/job-listing/JV.htm?jl=887065158&amp;..\" rel=\"nofollow\">http://www.glassdoor.com/job-listing/JV.htm?jl=887065158&amp;..</a>.</p><p>If this sounds like you, shoot us an e-mail at jobs@WebAction.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995997", 
        "user": "capkutay"
    }, 
    {
        "address": "Hillsboro, OR, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">My team at Intel is hiring people in the Hillsboro, Oregon area to work on ChromeOS.  We're working on enabling support in ChromeOS for each new Intel processor and chipset, optimizing performance and power usage, and adding new features to ChromeOS to take full advantage of new platform functionality.<p>We're looking for folks who enjoy working anywhere in the software stack, from the Linux kernel up through the browser and everywhere in between, including drivers, X, Mesa, OpenGL, rendering, video, and audio.  ChromeOS is an Open Source project; previous experience with development and technical communication in an Open Source environment will carry a lot of weight.</p><p>For the full job postings with all the details, see <a href=\"http://jobs.intel.com/job/Hillsboro-ChromeOS-Integration-Software-Engineer-Job-OR-97006/22543800/\" rel=\"nofollow\">http://jobs.intel.com/job/Hillsboro-ChromeOS-Integration-Sof...</a> and <a href=\"http://jobs.intel.com/job/Hillsboro-Chrome-OS-Validation-Engineer-Job-OR-97006/31066200/\" rel=\"nofollow\">http://jobs.intel.com/job/Hillsboro-Chrome-OS-Validation-Eng...</a> .  Feel free to contact me using the email address in my profile; I'm Intel's ChromeOS architect, and I can also put you in contact with the hiring manager for any non-technical questions about the positions.  We're primarily seeking permanent hires, but if you're interested in an internship, contact me and we'll see what we can do.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 45.5228939, 
        "location": "Hillsboro, Oregon", 
        "lon": -122.989827, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995901", 
        "user": "JoshTriplett"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">YPlan (London &amp; New York): Python engineers.<p>The back-end team here at YPlan is responsible for the API that the apps talk to, the internal CMS, the various websites, the event partner site, and programming support for the data science team, so basically everything code that isn't a smartphone app.</p><p>The team and business are growing rapidly and we are looking for top notch Python developers to help us develop and improve our tech stack. You will get to work on a variety of problems and technologies, help shape the future direction of our tech, and have plenty of room for taking on more responsibility over time.</p><p>Must have:</p><p>- Solid Python experience.</p><p>- Ability to work with minimal supervision.</p><p>Very nice:</p><p>- Django.</p><p>- SQL, preferably MySQL.</p><p>- JavaScript &amp; CSS.</p><p>- Chef.</p><p>Bonus round:</p><p>- Go.</p><p>- Clojure.</p><p>- High scalability.</p><p>- Big data.</p><p>- Network admin experience.</p><p>If you think you are up to the challenge ping me an email to viktoras at yplanapp.com or apply online at <a href=\"https://yplanapp.com/jobs\" rel=\"nofollow\">https://yplanapp.com/jobs</a></p><p>What's YPlan? Check [1] and [2] and [3] for description and some awards.</p><p>[1] <a href=\"http://mashable.com/2013/10/14/yplan-app/\" rel=\"nofollow\">http://mashable.com/2013/10/14/yplan-app/</a></p><p>[2] <a href=\"http://startups.co.uk/tonights-going-out-app-yplan-triumphs-at-2013-startups-awards/\" rel=\"nofollow\">http://startups.co.uk/tonights-going-out-app-yplan-triumphs-...</a></p><p>[3] <a href=\"http://www.forbes.com/sites/natalierobehmed/2013/12/16/the-hottest-global-startups-of-2013/\" rel=\"nofollow\">http://www.forbes.com/sites/natalierobehmed/2013/12/16/the-h...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996290", 
        "user": "ViktorasJucikas"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Localytics - Boston, MA - FULL-TIME, INTERN, H1B<p>Localytics is hiring:</p><p></p><pre><code>  - Mobile Engineers\n  - Rails Engineers\n  - Front End Engineers\n  - Backend End Engineers\n  - DevOps Engineers\n</code></pre>\nAbout Localytics:<p>* We provide app analytics and app marketing services for thousands of apps on over a billion devices</p><p>* We have the best buzzwords: Big Data + Data Visualization + Mobile</p><p>* We are passionate about and have deep expertise in the technologies we work with including: Rails, AngularJS, D3.js, Scala, iOS, Android, Mapreduce, MongoDB, DynamoDB, Memcache, Redis, Column Store Databases, AWS: DynamoDB, S3, SQS, EMR, ElasticCache and EC2.</p><p>* We are one of the fastest growing companies in Boston and were recently named one of the top places to work by The Boston Globe.</p><p>* We are located next to Park Street Station on the Red Line.</p><p>We love candidates who:</p><p>* Prefer startup environments.</p><p>* Are passionate about technology.</p><p>* Enjoy influencing the direction of the product and technologies.</p><p>Successful candidates may help us with:</p><p>* Web application development - Help us expand our analytics and marketing automation offerings.</p><p>* Prototyping - We still do a significant amount of customer development and R&amp;D.</p><p>* Writing automated tests - Help us expand our code coverage and improve our Continuous Integration system.</p><p>* Writing background jobs and data processing - Move data and perform calculations using cron, Sidekiq and Ruby.</p><p>* Front end development - Expand our CSS framework, build screens and libraries in AngularJS and build charts, graphs and other cool visualizations using D3.js</p><p>* Back end development - wrangling big data using Scala, AWS and several storage technologies.</p><p>Candidates of all experience levels encouraged to connect with us:  jobs@localytics.com</p><p>We love posting on the who’s hiring thread.  One of our last hires came in through December’s posting.</p><p>More details:\n<a href=\"http://www.localytics.com/\" rel=\"nofollow\">http://www.localytics.com/</a>\n<a href=\"http://www.localytics.com/company/localytics-jobs/\" rel=\"nofollow\">http://www.localytics.com/company/localytics-jobs/</a></p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 42.3584308, 
        "location": "Boston, MA", 
        "lon": -71.0597732, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995189", 
        "user": "abuggia"
    }, 
    {
        "address": "Raleigh, NC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">FujiFilm Medical Systems - Raleigh, NC<p>Help us build a client-side framework for the next generation of medical imaging and medical information applications.</p><p>We need JavaScript experts to build a responsive (from 4 monitors workstations down to a smart phone) content and application framework. We’re all about high-performance JavaScript. We have a team dedicated to measuring the performance of every build.</p><p>Our challenges include:</p><p>* completely removing ActiveX from the enterprise medical world.</p><p>* Writing our own, faster versions of common JavaScript UI libraries.</p><p>* Writing JavaScript that runs on one window, and manipulates the DOM on another. Did you know that, in IE, you can’t invoke a constructor defined on one window from code loaded in another?</p><p>* Creating real-time messaging systems between browser windows, desktop apps, and servers across a large geographically distributed facility.</p><p>* Sharing the single JavaScript thread in a an N-window NM widget application.</p><p>* Hitting aggressive cold and warm start times.</p><p>We’re still building the first version, a performant MVP, but when we start V2, there will be plenty of new challenges like writing 3D image viewers in NaCL and using WebGL and Canvas to display interactive radiological images.</p><p>Send me an email if you are interested: jpearce@fujifilm.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 35.7795897, 
        "location": "Raleigh, NC", 
        "lon": -78.6381787, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996012", 
        "user": "euroclydon"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">BTX Trader (<a href=\"http://btxtrader.com\" rel=\"nofollow\">http://btxtrader.com</a>) - NYC<p>We're looking for a web developer.</p><p>We are building Bitcoin trading tools. We're tiny (2 people) but we've got the ambition and the backing.</p><p>Here is the role profile in terms of skills:</p><p></p><pre><code>  - Strong grasp of core JavaScript\n  - Experience with client-side frameworks (Backbone, Angular etc)\n  - Familiar with Grunt/Yeoman or similar workflows\n  - Familiar with, or interested in \n    using: canvas, WebGL, three.js, d3.js etc. for visualization\n</code></pre>\nGet it touch! divya at btxtrader com</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995742", 
        "user": "dthakur"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Blue Apron (New York, NY): Software Engineer<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http://www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We've raised $8M from First Round Capital, Bessemer Venture Partners, and Dave Tisch and have been featured in the New York Times [1]. Forbes recently named us one of the hottest startups of 2013 [2].</p><p>After just one year of operation, we're delivering over 300,000 meals each month nationwide (up from 100k just a few months ago). Our product is growing quickly, and we want to work with talented, passionate individuals that will help us enhance the experience of cooking at home.</p><p>Our engineers solve problems for both customers and members of the Blue Apron team. We evaluate, design, and implement new features to provide more enjoyable experiences for our users. We collaborate to understand and overcome unique scheduling and logistics challenges. We listen to the needs of our interal teams and build tools that bring harmony to complex operational workflows.</p><p>Our stack: Ruby on Rails, RSpec, PostgreSQL, HAML, Bootstrap, SASS, JQuery, AJAX, Git, Heroku</p><p>About you:</p><p>- You communicate your ideas clearly.</p><p>- You're excited to learn and evaluate new technologies and techniques.</p><p>- You've taken features or products from concept to completion and have experience working with at least one large-scale web application.</p><p>- You're confident with JavaScript and CSS and understand the challenges involved with supporting older browsers.</p><p>- You're mindful of your impact. You write tests to improve the quality and reliability of your code.</p><p>- You help teammates improve when reviewing their work and appreciate feedback when they reciprocate.</p><p>This role comes with health insurance, a flexible vacation policy, and competitive salary and equity. To apply, please submit a short email outlining your experience and why you are interested along with your resume to jobs@blueapron.com.</p><p>[1] <a href=\"http://www.nytimes.com/2013/02/13/dining/the-dinner-kit-is-served.html\" rel=\"nofollow\">http://www.nytimes.com/2013/02/13/dining/the-dinner-kit-is-s...</a></p><p>[2] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http://www.forbes.com/pictures/emjl45himd/blue-apron-4/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996221", 
        "user": "ilz"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">San Francisco, CA<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is the most advanced advanced analytics platform ever for web &amp; mobile applications. We're profitable, with millions in monthly revenue, and we're backed by Andreessen Horowitz, Sequoia Capital, and Max Levchin.</p><p>ENGINEERING POSITIONS</p><p>We have two types of engineering positions available - systems and product.</p><p>Systems engineers[1] build and scale our infrastructure, and write mostly C, C++, and Python. These are the people working on our custom datastore. This position requires at least 2 years of experience writing systems software. Solid C experience is a plus.</p><p>Product engineers[2] build the parts people interact with - reporting interfaces, APIs, dataviz stuff, and more - and write mostly Python, JS, and LESS. This position requires at least 2 years of software engineering experience, no specialization required. Solid JS experience is a plus though.</p><p>The engineering team is still small (8), and there's a lot of interesting stuff to do. Happy to talk details.</p><p>If you are interested, drop me a line - tim@mixpanel.com. If you include [HN Who's Hiring] in the subject I'll be able to get back to you faster :)</p><p>[1]<a href=\"http://mixpanel.theresumator.com/apply/HUEQ75/Software-Engineer.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/HUEQ75/Software-Engin...</a></p><p>[2]<a href=\"http://mixpanel.theresumator.com/apply/CiOzuu/Software-Engineer-Backend.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/CiOzuu/Software-Engin...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995238", 
        "user": "trefn"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Notting Hill, London, England, U.K.<p>Our web application is at the heart of our busy and successful e-commerce business; every day it serves millions of product images and handles thousands of purchases, but we can and do update the live site with new code anytime we want - multiple times per day - without missing a beat. Our systems are written on the LAMP stack and deployed on Amazon Web Services; we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, at the moment we have a mix of Linux and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. Our developers are generalizing specialists whose typical day may include refining an algorithm, writing a tricky integration test, tuning a SQL query, and discussing feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles, especially developers of all levels of experience.</p><p>Established in London in July 2007, Secretsales.com is the UK's leading private shopping club, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homeware, and lifestyle categories, many familiar from the high street. The company has about 80 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995691", 
        "user": "squirrel"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Leaf - Cambridge, MA (Kendall) - Full time, visa sponsorship available - No Remote<p>Leaf makes an Andriod based POS and business management ecosystem. We've recently received $20 million in funding from Heartland Payments are growing quickly.</p><p>We have many openings across our entire stack, including .NET webservice developers, Ruby on Rails devs and Android OS and app developers. We're also looking for Windows and Linux devops.</p><p><a href=\"http://leaf.me/careers\" rel=\"nofollow\">http://leaf.me/careers</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996025", 
        "user": "ecopoesis"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - REMOTE (We're a small distributed team of 17 people (5 engineers) across the US, UK, Hong Kong, Taiwan, Sweden and Australia)<p>I'd love for you to come join Buffer for the fun ride. We have over 1.1 million users and our annual run rate is over $2m. There are some super interesting challenges ahead, as we focus on Buffer for Business.\nWe're looking to expand our engineering team with the following open positions.</p><p>* Reliability Hacker (Devops engineer). </p><p>* Happiness (Support) Engineer</p><p>* Backend Hacker</p><p>Here are some key stats about our technology and scale.</p><p></p><pre><code>    - we have over 150k monthly active users.\n    - 8500+ API clients. Most popular: Feedly, IFTTT, Pocket, Instapaper\n    - we release changes several times a day - we have an entirely data-driven process, with Einstein and Buffer-Metrics, our custom built a/b testing and metrics tracking framework.\n    - Some of the tech we work with: PHP, Python, MongoDB, AWS (Elastic Beanstalk, Elasticache, SQS), Backbone.js, Grunt.js, Android, iOS.)\n</code></pre>\nMore stats and stack details here: <a href=\"http://overflow.bufferapp.com/2013/08/01/scaling-buffer-in-2013/\" rel=\"nofollow\">http://overflow.bufferapp.com/2013/08/01/scaling-buffer-in-2...</a><p>We're a small team of driven hackers and happiness heroes (our support people). Just like you, we're excited and passionate about engineering challenges and have some interesting architecture and scaling problems we work on.\nIf you're interested in coming on board, you’ll:</p><p></p><pre><code>    - work closely myself on technical architecture and Joel on product.\n    - ship to thousands of users and iterate quickly\n    - work with our metrics team to make smart changes\n    - be friendly and comfortable talking directly to customers on issues and features\n    - be a happy, positive-minded and kind person who has a great approach in dealing with others\n    - be a Buffer user\n    - be anywhere in the world, and if you'd like, you have help and support from us to move to where you want to be\n    - have experience working with another startup or building side projects before (would be awesome, it’s cool if not)\n</code></pre>\nSome aspects of Buffer culture that makes us a little different:<p></p><pre><code>    - we are totally transparent. We raised $450k, we currently have over 1.1 million users and generate $230k/mo. Ask me anything else!\n    - within the company, all salaries and equity are open and we have a formula for the distribution.\n    - we're all very focused on self improvement\n    - we have daily standups where we discuss our current improvements. This could be waking up earlier, starting public speaking, blogging, exercise, learning a language, etc.\n    - here's our culture deck: http://www.slideshare.net/bufferapp/buffer-culture-03\n</code></pre>\nSalary: 88k-110k depending on location (living costs) and experience. (<a href=\"http://open.bufferapp.com/introducing-open-salaries-at-buffer-including-our-transparent-formula-and-all-individual-salaries/\" rel=\"nofollow\">http://open.bufferapp.com/introducing-open-salaries-at-buffe...</a>)<p>Equity: 0.1-1%</p><p>If this sounds fun, let's chat. Send me a note about yourself, why you’re interested in Buffer, and any relevant links (Github profile, projects and background): <a href=\"http://jobs.bufferapp.com\" rel=\"nofollow\">http://jobs.bufferapp.com</a></p><p>- Sunil (CTO) thenexthacker@bufferapp.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Hong Kong, Taiwan,", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995475", 
        "user": "sunils34"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Stripe. We're hiring engineers in San Francisco, remotely within US timezones, and in London. INTERN, REMOTE, H1B all welcome.<p>We have a lot of awesome stuff in flight (not the least of which is our third Capture the Flag, which I'm working on as I write this post). See <a href=\"http://www.quora.com/Stripe-company/What-engineering-problems-and-challenges-is-Stripe-solving\" rel=\"nofollow\">http://www.quora.com/Stripe-company/What-engineering-problem...</a> for an overview of what we're working on.</p><p>If you're interested, feel free to ping me at gdb@stripe.com.</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996143", 
        "user": "gdb"
    }, 
    {
        "address": "Berkeley, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Voleon Capital Management - Berkeley, CA - Full time - H1B OK<p>We have two positions open on our software team.  The first is for a CTO.  I apologize as I do not have a formal job description available yet, but briefly we are looking for an experienced candidate to grow, manage and lead an elite software engineering team.  Our ideal candidate would combine very strong technical skills with startup management experience; experience in finance is a bonus but not a must.  I will post a formal description shortly; some details can be found in the job description for the second position given below.  In the meantime if you are interested in more details, please contact us at working@voleon.com.</p><p>The second position is for a software developer.  The description is below:</p><p>Fast-growing quantitative trading firm seeks an exceptional software developer. You will architect and implement a diverse set of core infrastructures, including new production systems, scientific-computing environments, and modern data stores.</p><p>We seek candidates with a proven track record of writing correct, well-designed software, solving hard problems and delivering complex projects on time. You should preferably have experience with high assurance, distributed, fault-tolerant systems. Experience with functional programming as well as soft real-time, low-latency, cache-friendly systems is a bonus.</p><p>We are getting big fast. Willingness to take initiative, and a gritty determination to productize, are essential.</p><p>Join a team that includes faculty at premier universities and PhD's from top-tier schools, led by the founder and CEO of a successful Internet infrastructure startup. You will have a high impact, and you can expect frequent interaction with the researchers, officers, and founders.</p><p>Benefits and compensation are highly competitive. Interested applicants are encouraged to send a cover letter and resume to working@voleon.com.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.8715926, 
        "location": "Berkeley, CA", 
        "lon": -122.272747, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996378", 
        "user": "voleon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">CircleCI (<a href=\"https://circleci.com/jobs\" rel=\"nofollow\">https://circleci.com/jobs</a>) - SF or REMOTE fulltime (in the US)<p>At CircleCI we're building the next generation of developer automation: amazing Continuous Integration and Deployment. We have traction and revenue and funding and great customers. Our customers love us, because we move quickly, build great things, and provide amazing support. Everyone talks to customers a lot.</p><p>We're still a small team, so you'll have a large impact on company culture. We're highly influenced by Valve's Employee handbook, and have as flat a structure as we can.</p><p>We're looking for frontend engineers (JS), designers (must be able to HTML+CSS), and backend engineers (Clojure). Being a mix of those is of course welcome! We lean towards senior experienced engineers, or junior engineers who can display great talent.</p><p>We're also looking for engineers for sales and marketing positions. Since we have an incredibly technical product, and selling directly to developers, the marketing positions (dev evangelism, CRO, analytics, etc - think a patio11-style engineer) require significant development experience. Sales positions are a good fit for engineers looking for a change, esp those who love automating manual processes.</p><p>Check out our jobs page at <a href=\"https://circleci.com/jobs\" rel=\"nofollow\">https://circleci.com/jobs</a>.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995497", 
        "user": "pbiggar"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Front End Engineer at Localytics<p>&gt; <a href=\"https://www.angularjobs.com/posts/588-front-end-engineer-at-localytics\" rel=\"nofollow\">https://www.angularjobs.com/posts/588-front-end-engineer-at-...</a></p><p>Web Application Developer</p><p>&gt; <a href=\"https://www.angularjobs.com/posts/552-web-application-developer\" rel=\"nofollow\">https://www.angularjobs.com/posts/552-web-application-develo...</a></p><p>Front End Engineer, Thumbtack</p><p>&gt; <a href=\"https://www.angularjobs.com/posts/568-front-end-engineer-thumbtack\" rel=\"nofollow\">https://www.angularjobs.com/posts/568-front-end-engineer-thu...</a></p><p>Software Engineer - SaaS/Web Application Developer</p><p>&gt; <a href=\"https://www.angularjobs.com/posts/516-software-engineer-saas-web-application-developer\" rel=\"nofollow\">https://www.angularjobs.com/posts/516-software-engineer-saas...</a></p><p>Front-end, AngularJS Software Engineer to Help Invent a New Category of Software</p><p>&gt; <a href=\"https://www.angularjobs.com/posts/481-front-end-angularjs-software-engineer-to-help-invent-a-new-category-of-software\" rel=\"nofollow\">https://www.angularjobs.com/posts/481-front-end-angularjs-so...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995491", 
        "user": "BrianPetro"
    }, 
    {
        "address": "Denver, CO, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Catalyst Repository Systems - Denver, CO / Remote<p>Software Developer - Backend</p><p>Job Summary:</p><p>Catalyst is seeking a software developer to work on the backend platform which supports our text mining and prediction product lines.  This platform has active customers and we’re beginning the process of transitioning the platform out of R&amp;D and into daily operations.</p><p>\u2028\u2028You will write code and tests daily for bug fixes, enhancements, and new features.  The bulk of the development is done in python with some shell scripting glue.  The code ranges from basic operational scripting to shared libraries and multi-threaded service applications.  The platform also integrates with a variety of services including RabbitMQ, Redis, Elastic Search, and Swiftstack.</p><p>\u2028\u2028Additionally, you may find yourself handling light systems administration, gathering feedback from internal product users, and communicating with a variety of staff to create and clarify specifications.  Documentation, training, and other communication on behalf of a new platform may also be required.\u2028\u2028</p><p>Catalyst is remote work friendly and this role can be 100% remote.  The project lead is also 100% remote.  We use email, Jira, instant messaging, a wiki, google docs, and google hangouts for communication and collaboration.</p><p>\u2028\u2028This role will be hired in to the development department, but work closely with the technical lead in the research &amp; development group.  Candidates should be comfortable working across team boundaries.  There will be flexibility in defining the responsibilities of this role.\u2028</p><p>Qualifications:</p><p></p><pre><code>  * 1-3 years of software development experience\n  * Strong written communication skills\n  * Strong troubleshooting and reasoning skills\n  * Willingness to work across technical boundaries\n</code></pre>\nPreferences:<p></p><pre><code>  * Python\n  * Linux administration\n  * Distributed systems\n  * Messaging systems\n  * Prior remote work roles\n  * Prior ISP or SAAS roles\n\n</code></pre>\nCatalyst offers a flexible work environment, competitive compensation package (including base salary, bonus potential, medical/dental/vision coverage, and company-matched 401k).<p>Interested candidates should email their resume to numbers@catalystsecure.com.  Questions, resumes, LinkedIn profiles, and public repo links are welcome via email.</p><p>(If you have any questions, feel free to email me personally.  My email is in my profile.)</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 39.737567, 
        "location": "Denver, CO", 
        "lon": -104.9847179, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996102", 
        "user": "cody_at_cat"
    }, 
    {
        "address": "Durham, NC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Republic Wireless - Full Time - Raleigh/Durham, NC (preferred)<p>We have openings for several roles:</p><p>* Erlang developer</p><p>* Android and iOS app developer</p><p>* Android core developer</p><p>* Web frontend developer (Angular)</p><p>email: hackernews@bandwidth.com</p><p>A few reviews about what have done:</p><p><a href=\"http://allthingsd.com/20131126/smartphone-with-wi-fi-smarts/\" rel=\"nofollow\">http://allthingsd.com/20131126/smartphone-with-wi-fi-smarts/</a></p><p><a href=\"http://www.theverge.com/2013/11/14/5105230/with-plans-starting-at-5-republic-wireless-looks-more-un-carrier-than-t-mobile\" rel=\"nofollow\">http://www.theverge.com/2013/11/14/5105230/with-plans-starti...</a></p><p><a href=\"http://online.wsj.com/news/articles/SB10001424052702303281504579222131917130744\" rel=\"nofollow\">http://online.wsj.com/news/articles/SB1000142405270230328150...</a></p><p><a href=\"http://reviews.cnet.com/8301-19736_7-57611724-251/hands-on-with-the-republic-wireless-moto-x/\" rel=\"nofollow\">http://reviews.cnet.com/8301-19736_7-57611724-251/hands-on-w...</a></p><p><a href=\"http://www.usatoday.com/story/tech/columnist/baig/2013/11/12/republic-wireless-moto-x-review/3504825/\" rel=\"nofollow\">http://www.usatoday.com/story/tech/columnist/baig/2013/11/12...</a></p><p><a href=\"http://www.mrmoneymustache.com/2013/11/16/republic-wireless-old-phone-new-phone-and-a-tempting-competitor/\" rel=\"nofollow\">http://www.mrmoneymustache.com/2013/11/16/republic-wireless-...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 35.9940329, 
        "location": "Durham, NC", 
        "lon": -78.898619, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995137", 
        "user": "BrandonSmith"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Moka5 - San Francisco Bay Area (Redwood City and Emeryville, CA), interns and H1Bs welcome<p>Moka5 makes life easier for large corporate IT departments who have too many computers to manage, and life better for end-users who would otherwise have to deal with a corporate IT department that's enforcing ridiculously restrictive policies for their own sanity. Our primary product, Moka5 Player, delivers you a VM image of a corporate system that you can run on your own computer (Windows or Mac). You can install whatever software you want, and we automatically split new files into \"layers\", so IT can push a new base layer that takes effect as soon as you reboot, and you can press a button and wipe all locally-installed software including IE toolbars and other nonsense, but keep IT-provided software and non-application files like documents. Since it's running locally, you can get work done offline (unlike Citrix, VMware View, etc.), and not hate your life if you're not on the LAN. We also do a bunch of security work to make it reasonable to run a corporate VM on your personal machine: this way, you're not stuck carrying two laptops around.</p><p>One product that's been seeing lots of growth is Moka5 BareMetal, a stripped-down Ubuntu derivative that boots directly into Moka5 Player. By providing our usual management capabilities on an underlying OS you don't have to think about, you get the benefits of our product (easier updates, layering, single image, etc.) on corporate-owned hardware. We're also writing iOS and Android apps for remotely accessing your files and other data on the go (even when you don't have a network connection), and currently finishing up a client-side encrypted filesystem for synchronizing your files between your desktop and mobile device. There's also quite a bit of work on the server side -- you get to solve fun problems about reliability, scalability, and geographic redundancy, but since we sell a product and not a service, nobody on our team has to carry a pager and get woken up to fix things for customers.</p><p>We're not per se a virtualization company: we don't write the hypervisor, since other people already do a great job of that. We do write a lot of things just above and just below the hypervisor layer, and in general a lot of computer systems work. If you enjoy operating systems, file systems, virtualization, or networking, come talk to us. If dynamic-linker trickery sounds like your idea of fun, we'll get along well. We work in C++ and C# on the desktop, J2EE on the server, and the native languages (Objective-C and Java) on mobile; there is also a fair amount of open source work to be done in various languages, and we try to be good citizens and work with upstream.</p><p>See moka5.com for more info, and send me an email (gthomas at that domain name) if you're interested! I'm in Boston all January and will be at the Real World Crypto conference in NYC, so if you're in one of those cities and want to say hello, I'd be glad to chat.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995090", 
        "user": "geofft"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SurveyMonkey ( <a href=\"http://www.surveymonkey.com\" rel=\"nofollow\">http://www.surveymonkey.com</a> )<p>Offices in:\nPalo Alto, CA, USA\nSeattle, WA, USA\nPortland, OR, USA</p><p><i></i>Job Description<i></i>:</p><p>Survey Monkey is looking for software engineers who have a passion for\nsolving complex and interesting problems. In addition to scaling site,\nwe are looking for people who can help with advanced analysis and data\nvisualization, natural language processing, and new storage\narchitectures.</p><p><i></i>Requirements<i></i></p><p>* Experience writing top quality software for high-volume/high\navailability websites, including being involved in building critical\nuser-facing components.</p><p>* Comfortable working in a Unix environment</p><p>* Experienced in working with multiple databases and datastores\n(Postgres, ElasticSearch, Redis, Cassandra, etc.)</p><p>* Love Python</p><p><i></i>About the company<i></i></p><p>SurveyMonkey is the world's largest survey company, but there's really\nmuch more to us than that. We're a smart, passionate group of people who\nwork hard to deliver the best survey experience on the planet, period.\nWe do this because we believe everyone deserves easy access to the\ninsights and information they need to make better, more informed\ndecisions.</p><p>We help customers collect over 2+ million online survey responses daily.\nSurveyMonkey is trusted by millions of customers, including 99% of the\nFortune 500, as well as other businesses, academic institutions and\norganizations of all shapes and sizes.</p><p>* What Python is used for:</p><p>Our primary services/applications are all built on top of the Pyramid\nWebframework. We use pylibmc, ansible, jinja2, sqlalchemy, and many\nother open source python libraries to power our infrastructure.</p><p>We are planning to do our first Python3 and PyPy deployments in 2014.\nAlong with moving from weekly releases to continuous deployment.</p><p>* Contact Info:</p><p>Contact: John Anderson</p><p>E-mail contact: johna [at] surveymonkey.com</p><p><i></i>No telecommuting<i></i></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995736", 
        "user": "sontek"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">ClassDojo<p>FULLTIME in SAN FRANCISCO, CA</p><p>ClassDojo is used by over 15mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup with funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we're one of the fastest growing education companies of all time. We're the only non-YC company that Paul Graham has ever invested in.</p><p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board. We have a strong team, an extremely comfortable and relaxed environment and great salary + benefits. If you're a strong hacker who wants to use JavaScript to change the world, apply here:</p><p></p><pre><code>  --------------------------    \n\n\n  https://classdojo.wufoo.com/forms/join-classdojo/    \n\n  --------------------------    \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here:<p><a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a></p><p>We're particularly looking for:</p><p></p><pre><code>  * Frontend Engineer  \n\n  * Full Stack/Backend Engineer (working on hard stuff!)\n\n</code></pre>\nApply here:<p><a href=\"https://classdojo.wufoo.com/forms/join-classdojo/\" rel=\"nofollow\">https://classdojo.wufoo.com/forms/join-classdojo/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995135", 
        "user": "ladon86"
    }, 
    {
        "address": "Camarillo, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">OmniUpdate - Camarillo, CA<p>INTERNships are available, in addition to the FULLTIME positions below. See our website for more information.</p><p>Come join us in sunny Southern California! (Today, Jan 1, the high is forecast to be 72F!) We're a 30+ year old company with a startup mentality, writing the best SaaS web content management tools for the higher education market.</p><p>More info about the perks, benefits, location, etc are available on our careers page: <a href=\"http://omniupdate.com/company/careers/\" rel=\"nofollow\">http://omniupdate.com/company/careers/</a></p><p>We're currently hiring for the following positions:</p><p>- Web Developer (working with .edus around the country to implement our applications)\n- UI/UX Design Engineer\n- Technical Product Specialist / Sales Engineer\n- Sales Director\n- Front End Web Developer (working with our development team to build these applications)</p><p>To view the requirements for each position, and to apply online: <a href=\"http://omniupdate.com/company/careers/job_list.html\" rel=\"nofollow\">http://omniupdate.com/company/careers/job_list.html</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 34.2163937, 
        "location": "Camarillo, CA", 
        "lon": -119.0376023, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995919", 
        "user": "btgeekboy"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Scribd (YC '06), San Francisco - H1B, FULL-TIME, and INTERN are all welcome<p>Scribd (\"Netflix for eBooks\", top 100 website, 35 people) is hiring talented hackers of all kinds to help us build the library of the 21st century.</p><p>We've hired SIX full-time people and TONS of interns from these \"Who is Hiring\" threads ... it really works!</p><p>We're looking for people who want to work with:</p><p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)</p><p>* Javascript (well, we use Coffeescript)</p><p>* iOS</p><p>* Machine Learning / data mining / recommendations - think Netflix prize, but for books!</p><p>* Data analysis  (SQL guru?)</p><p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you. We've hired people from these threads with everywhere from 0 to 10 years of experience.</p><p>We're profitable, very well funded and have a really fun office environment (go-karts + a rock climbing wall!). Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire, and we love hiring people with entrepreneur and startup ambitions. We are also always looking for international people interested in moving to the US and can help you secure a visa.</p><p>We recently launched a service that's being called the \"Netflix for books\" and are really excited about it. Read more here: <a href=\"http://wrd.cm/1dJquzz\" rel=\"nofollow\">http://wrd.cm/1dJquzz</a></p><p>More info is at <a href=\"http://www.scribd.com/jobs\" rel=\"nofollow\">http://www.scribd.com/jobs</a>, but as a HN user, feel free to apply directly by emailing me at jared at scribd.com.</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995471", 
        "user": "snowmaker"
    }, 
    {
        "address": "Durham, NC, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">AnsibleWorks is the company behind the Ansible automation platform (github.com/ansible/ansible).  <a href=\"http://ansibleworks.com\" rel=\"nofollow\">http://ansibleworks.com</a><p>We are hiring for backend API (lots of Python/Django/other-bits), UI/UX (we use lots of Angular), and for folks to work on the core OSS project (we use Python).</p><p>More details here: <a href=\"http://www.ansibleworks.com/careers/\" rel=\"nofollow\">http://www.ansibleworks.com/careers/</a>.</p><p>Durham, NC, USA</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 35.9940329, 
        "location": "Durham, NC", 
        "lon": -78.898619, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995374", 
        "user": "mpdehaan2"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">TheLadders.<p>On site in NYC.</p><p>Looking for great developers in general but right now our #1 areas of concern are people who posses some or all of the following: iOS, Android and JavaScript skills.</p><p>We are looking for graphic designers, interface architects, \"backend\" engineers, ops, data science, product management and more.</p><p>If you're good at what you do, we'd love to talk.</p><p>email me at sallen@theladders.com with questions or what not.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996162", 
        "user": "spooneybarger"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Gumroad (<a href=\"https://gumroad.com/\" rel=\"nofollow\">https://gumroad.com/</a>).<p>Gumroad enables all types of creators (musicians, designers, writers, video game developers, comedians, filmmakers, and more) earn a living by selling their work directly to their audience.</p><p>See a demo: <a href=\"https://gumroad.com/demo\" rel=\"nofollow\">https://gumroad.com/demo</a></p><p>The company is 2 years old. We're a team of 12 focused on making a great product over anything else — we've raised $8M and don't have to think about raising money for a while (besides the money that we raise daily from our customers!).\nWe're looking for engineers and designers in San Francisco.</p><p>You can see more definitive roles here, but in general we are looking for smart, hard-working, creative people: <a href=\"https://gumroad.com/jobs\" rel=\"nofollow\">https://gumroad.com/jobs</a></p><p>You can apply through there or email me directly — sahil@gumroad.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995460", 
        "user": "sahillavingia"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">SEATTLE, WA. A plucky startup is dragging the manufactured goods supply chain into the 21st century.\nWe're helping manufacturers to organize product data, in a way that helps moving the goods - catalogs, inventory, supporting documentation, orders, and so on; all stand to benefit from solid data architecture with increasing accuracy, reduced cost, and real-time analytics.<p>WANTED: Experienced web developer - HTML/CSS/Javascript/jQuery. Backend is C#/ ASP.NET MVC.</p><p>Contact <a href=\"http://amptab.com\" rel=\"nofollow\">http://amptab.com</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995863", 
        "user": "DenisM"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Usabilla - Amsterdam - The Netherlands<p>We build cutting-edge feedback technologies. We have just reached a record exposure of 2 billion monthly Live Feedback button displays – serving an international client base, including big online players like Booking.com, Vodafone, T-Mobile and Spilgames. Time to expand our team with highly motivated and skilled web developers.</p><p>We use: PHP / Symfony 2, Go, NodeJS, Javascript, MongoDB, AWS</p><p><a href=\"http://blog.usabilla.com/hiring-skilled-web-developers-amsterdam/\" rel=\"nofollow\">http://blog.usabilla.com/hiring-skilled-web-developers-amste...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996101", 
        "user": "mva"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Visual.ly - San Francisco, CA is looking for a seasoned Growth Hacker. Are you are excited about growth? And like problem solving? Help us build scale out our customer acquisition channels in 2014 and learn a ton in the process! \nNote: While this is a development role, you will report to the Growth Team\nThe job: You contribute to the code on each level of the stack working closely with designers and fellow developers. You show an eagerness to learn and a thirst for knowledge. You are comfortable context switching from project to project.\nYou are equally comfortable talking with Marketing/Business folks as with Developers and can speak both languages.\nUs We're a small team of people who are dedicated and have a passion for data visualizations and infographics. We're nimble. That means we're following a user-centered approach; we value people's feedback and iterate quickly.\nYou You have an outstanding understanding of how all layers of the stack interact You are knowledgable and experienced with the following languages, Javascript, PHP, HTML, API's. You are experienced working with MySQL databases You are well versed in the latest internet marketing techniques as well as standards (seo/sem/email) You are able to think creatively to solve marketing challenges to unlock new growth channels.<p>Curious? Get in touch! Jobs+growth@visual.ly</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996043", 
        "user": "abreckle"
    }, 
    {
        "address": "Conshohocken, PA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Monetate - Conshohocken, PA (Philly suburbs) No remote, but we will help you with relocation.<p>Monetate helps internet marketers make their site more relevant. We turn data in action on our clients' sites by doing real-time data analysis and DOM modification to put the right experience in front of their users. We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.</p><p>What we're looking for:</p><p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users' problems</p><p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here</p><p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on</p><p>* Open source - Google Closure, AngularJS, Python, Hadoop, Mahout, Solr and Lucene - we're open source across our stack</p><p>About us:</p><p>* Founded in 2008</p><p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one). Our technical teams have full authority over (and responsibility for) the problems they work on.</p><p>* Market rate salaries</p><p>* Funded by First Round and OpenView</p><p>We're looking for people not positions. We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.</p><p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a></p><p>We've hired great people from HN in the past.</p><p>Please feel free to email me with any questions - cconley at monetate com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.0792766, 
        "location": "Conshohocken, PA", 
        "lon": -75.3015714, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995589", 
        "user": "chrisconley"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">MaxSquare - New York City<p>MaxSquare is developing a suite of capabilities accessible through SMS, mobile apps or the web that allows local businesses to leverage what we call the \"the local marketplace API\". We believe there is a huge opportunity in developing a better way for local businesses to interact with their potential customers and vice versa.</p><p>We are well capitalized through angel investors and positioned to leverage several key strategic partnerships once the initial product offering has completed development.</p><p>WHAT WE NEED</p><p>We are looking for our #2 and #3 hires so we need candidates that thrive in an environment where they would be involved in building the company from the ground up. We are looking for engineers that can understand the whole stack but more specifically: One talented front-end developer comfortable working with multiple platforms with a great eye for UI/UX, and one talented back-end developer that can work on the API.</p><p>Right now we have been working with the web2py framework in the application tier, with a MySQL database. We've started development on the front-end using RAD using Sencha Touch to develop an MVP that will eventually be wrapped in PhoneGap. We need someone that can work with the contracted developers to finish the MVP in Sencha Touch, and can work in native iOS, Android, and desktop web frameworks later on.</p><p>One of these hires will be assuming the CTO role while the former CTO will be assuming the COO role, so you will be responsible for taking the lead of development teams. The other position is for the senior developer role, and will need to be comfortable churning out code as well as reviewing code from contracted developers.</p><p>We are also looking to rapidly evolve so you will need to be comfortable with prototyping and iterating frequently.</p><p>WHAT WE OFFER</p><p>Compensation in the range of 100-200k for the CTO role, 50-100k for the senior developer role.</p><p>A meaningful equity stake and founder title.</p><p>Health, dental and vision benefits.</p><p>An awesome, huge workspace in a brownstone building in the Upper East Side of Manhattan.</p><p>Free lunches, snacks, seamless in the office.</p><p>Flexible work hours, no counting vacation or sick days.</p><p>Choice of MacBook Pro or 2xCinema Displays</p><p>No forced work environment: All we care about is building the product and nurturing a very hacker-friendly culture.</p><p>A business that puts solving the problems of our customers first, and money second. We care about creating technology that keeps small local businesses in their neighborhoods.  Because who wants to live in a world where every other building is a bank, megabrand or franchise?</p><p>Contact me if you are interested:\nmichael@max2.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995396", 
        "user": "kapnobatairza"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Optimizely - San Francisco, CA / Amsterdam, NL - Fulltime, Permanant. Intern/H1-B Transfer okay as well.\nOptimizely Fastest Growing Startup - <a href=\"http://www.zdnet.com/optimizely-on-pace-to-grow-faster-than-any-other-saas-company-in-history-7000013814/\" rel=\"nofollow\">http://www.zdnet.com/optimizely-on-pace-to-grow-faster-than-...</a><p>Intern - <a href=\"http://jobsco.re/1g27Jp8\" rel=\"nofollow\">http://jobsco.re/1g27Jp8</a>\nGrowth Engineer - <a href=\"http://jobsco.re/18r6N9L\" rel=\"nofollow\">http://jobsco.re/18r6N9L</a>\nSoftware Engineer - <a href=\"http://jobsco.re/1g287Ea\" rel=\"nofollow\">http://jobsco.re/1g287Ea</a>\niOS Developer - <a href=\"http://jobsco.re/1hjBfoa\" rel=\"nofollow\">http://jobsco.re/1hjBfoa</a>\nDevOps Engineer - <a href=\"http://jobsco.re/Hwr31e\" rel=\"nofollow\">http://jobsco.re/Hwr31e</a>\nProduct Manager - <a href=\"http://jobsco.re/Hwretn\" rel=\"nofollow\">http://jobsco.re/Hwretn</a></p><p>Optimizely is a website optimization platform. We enable businesses to show the right thing to the right person at the right time. Our first product makes A/B Testing easy. In 2 years we’ve grown to become #1 in the category with 4,000+ paying customers including Starbucks, Disney, and Marketo. We're profitable and our revenue is growing 400% year-over-year. Join us in our mission to empower businesses to make better data-driven decisions.</p><p>About the Job: We have scale: 15 billion server requests/month. You’ll work on our amazing visual editor - a cutting edge tool / high performance low footprint iOS SDK or scaling our system to new heights in a continuous integration environment; we’re fast and nimble: 1-2 deployments every day.</p><p>Benefits Free city-wide Gym membership at any Crunch Fitness. Free Clipper Card to pay for your commute from anywhere in the bay area. Catered in-office lunch and dinner on weekdays. Full medical insurance with very low co-pay and deductible. HMO, PPO, and HSA options available. Full dental coverage including orthodontics. Full vision coverage including contacts. Dependents 100% covered for medical, dental, and vision. Unlimited vacation policy. 401k benefit. Top-of-the-line MacBook Pro or MacBook Air and 30\" monitor. Working with a great team and having a huge impact!</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995881", 
        "user": "hemantv"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">FULLTIME - Assembly (assemblymade.com) - San Francisco<p>We're hiring Front-End, Ruby, and Full-stack Engineers to help us build foundational pieces of the Assembly platform. You would have a direct hand in shaping the future of work and unlocking the power of independent creators. Assembly's collaborative platform enables the creation of a new class of open source software products; where anyone around the world can help collectively build, retain ownership, and receive proﬁt for their contributions.</p><p>We’re currently a small 4 person team in San Francisco that has recently secured a healthy financing from top-tier investors which will enable us to tackle the enormous challenges of creating a ‘meta’ company (a software company that creates software companies). We believe in progress over consensus, strong opinions weakly held, moving fast is best even if it breaks things, and we make what we measure - but you'll have the opportunity to add your own lessons to that list. We work alone and we work together; meaning we believe the best know how to get things done on their own, as well as how to work in a team. Everyone on the team is responsible for self directing their work and has a tremendous impact on our shared success.</p><p>WHAT WE’RE LOOKING FOR</p><p>* Understand pain points, come up with solutions, and then prototype, iterate, and launch frequently.</p><p>* Strong opinions on testing &amp; code quality.</p><p>* Over 3 years experience with Ruby.</p><p>* Experience with Heroku, ElasticSearch, Postgres, or Redis a plus.</p><p>WHAT WE OFFER</p><p>* Free meals.</p><p>* Flexible work hours.</p><p>* Open vacation policy. We don't count days.</p><p>* If you're sick, just stay home and get better.</p><p>* Stand up desks, mac book pros, cinema displays...Buy or build your ideal work environment</p><p>* A sunny office space.</p><p>* Competitive salary and equity package.</p><p>* Health, dental and vision benefits.</p><p>* Team \"Workations” where we all travel somewhere for a week for a change of environment</p><p>We’re located in Mission, San Francisco, CA. It would be great if you are local or willing to relocate (we'll cover the cost) but we’ll also open to telecommuting as long as you are located in the US and it is legal for you to work here.</p><p>Please apply by sending any work, resume, github username to jobs@assemblymade.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995181", 
        "user": "bitsweet"
    }, 
    {
        "address": "Dallas, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">OrgSync — Dallas, TX. Full-time.<p>Frontend / Backend / Full-stack</p><p>## Job Summary</p><p>We're looking for a sharp engineer to work alongside a small team of developers and designers committed to building a robust, performant and scalable web application serving over 350 colleges and universities around the country. You have an attention to detail and a professional curiosity that extends beyond the workplace. You will work in a mostly autonomous environment, so you have to be just as awesome at getting things done as you are at composing elegant solutions.</p><p>Most of our code is written in Ruby and runs on the Rails stack backed by a MySQL database, but we also incorporate other technologies such as Node.js, Memcached, ElasticSearch and Redis. We use GitHub for version control and our infrastructure is entirely hosted via cloud services. We care about keeping our libraries up-to-date and test coverage. While most of our stack is on Rails today, we're comfortable with other technologies and always strive to use the right tool for the job.</p><p>This is a full-time position at our headquarters in Dallas, TX and includes a competitive base salary, a full range of benefits, stock options, and an awesome team of creative people by your side.</p><p>## Requirements</p><p>- Passion for developing excellent software and an appreciation for elegant code</p><p>- Strong understanding of web services and REST concepts</p><p>- Strong understanding of relational databases including complex queries and optimization</p><p>- Experience writing object-oriented software guided by tests</p><p>- Strong understanding of performance optimization and caching techniques</p><p>- Being comfortable in a polyglot environment a plus</p><p>- Open source project contributions a plus</p><p>- Ability to play \"Careless Whisper\" on saxophone a plus</p><p>- Strong written and verbal communication skills</p><p>## Links</p><p>Open source: <a href=\"http://orgsync.github.io/\" rel=\"nofollow\">http://orgsync.github.io/</a></p><p>Blog: <a href=\"http://devblog.orgsync.com/\" rel=\"nofollow\">http://devblog.orgsync.com/</a></p><p>Openings: <a href=\"http://www.orgsync.com/company/careers\" rel=\"nofollow\">http://www.orgsync.com/company/careers</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 32.7801399, 
        "location": "Dallas, TX", 
        "lon": -96.80045109999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995484", 
        "user": "AaronLasseigne"
    }, 
    {
        "address": "Ann Arbor, MI, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Ann Arbor, MI preferred, remote possible.<p>Senior developer at Alfa Jango (<a href=\"http://www.alfajango.com\" rel=\"nofollow\">http://www.alfajango.com</a>). We build startups. We act as CTO and development team for startups that need it. We also spend a fair amount of time working on our internal and open source projects. We're a small team of 4 looking to grow to a slightly less small team of 5.</p><p>We use mostly Ruby and JavaScript, but always looking for the best tool for the job.</p><p>Email angie@alfajango.com.</p><p>I'd write more, but I'm on my phone and not back at my computer until later today.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.2808256, 
        "location": "Ann Arbor, MI", 
        "lon": -83.7430378, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995230", 
        "user": "JangoSteve"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Huffington Post, NYC<p>We are hiring a wide array of senior engineers.  We are aggressively staffing up our engineering team as we evolve our infrastructure to a more service oriented based architecture, and invest heavily in our stats, data and machine learning products.</p><p>Scala, Ruby, Data Science, Machine Learning, Frontend (Angular, Backbone).</p><p>Have a look here <a href=\"https://github.com/huffingtonpost/HuffPost-Tech-Jobs\" rel=\"nofollow\">https://github.com/huffingtonpost/HuffPost-Tech-Jobs</a></p><p>Email us at developer@huffingtonpost.com if interested</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996234", 
        "user": "dberg"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">AMA Capital -- Palo Alto, CA. Full time. H1B okay.<p>AMA Capital trades billions of dollars per day in the foreign exchange markets.</p><p>We are all engineers, and we all do a little bit of everything, designing and implementing our own trading strategies and infrastructure. We are a very small team (I am the only employee) looking to add one or two engineers who will focus on strategy and/or on infrastructure. No experience or specific knowledge of finance is required. However, you do need to be at least interested in financial markets and to be able to implement your strategies carefully in C++.</p><p>An example of an infrastructure project is designing and building a system for logging to non-volatile memory. We generate large logs that cover everything from prices to transaction data. NVDIMMs are a form of RAM that survives power loss, and such hardware has been on the horizon for a while, but it is just now becoming available to early adopters. Writes to NVDIMMs will be nearly instantaneous and immediately durable. This project will be to develop an NVDIMM-based system that simultaneously functions as a log, an IPC mechanism, and a searchable database for analysis. Making this work will involve a number of pieces: kernel drivers, CPU cache control, lock-free synchronization, a daemon to write everything back to long-term (i.e. less expensive) storage, and more. If this works well, we plan to open-source all the pieces.</p><p>Learn more at <a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>, and contact us at careers@amacapital.net.</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995395", 
        "user": "ryporter"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Flipboard (<a href=\"http://flipboard.com\" rel=\"nofollow\">http://flipboard.com</a>), Palo Alto, CA and New York, NY (INTERN yes, REMOTE probably not)<p>We're building the world's best personal magazine. We have about a hundred employees, just raised a hundred million dollars, and we have 100 million users.</p><p>It's a big opportunity, so we're growing our team substantially. We're looking for devops, data science, distributed services, iOS, Android, Web, design, and ad sales (on top of everything else we have some very cool, very ethical ad products).</p><p><a href=\"http://jobvite.com/m?3qMccgwl\" rel=\"nofollow\">http://jobvite.com/m?3qMccgwl</a></p><p>Come join us and build complex systems, solving hard problems, which help people keep up with the world around them.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995575", 
        "user": "adw"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">SwiftStack - <a href=\"http://swiftstack.com/jobs\" rel=\"nofollow\">http://swiftstack.com/jobs</a> - San Francisco, CA (preferred)<p>SwiftStack builds and delivers on-premise object storage to companies looking for highly available storage that scales to millions of users. Our product is built around the OpenStack Swift[1] object storage engine and provides management, monitoring, and integration for the entire storage system.</p><p>Working at SwiftStack, you'll work with new technology[2], participate in open-source community work, and build a storage engine that is used by millions. We're solving all kinds of interesting problems, and I'd love to work with you to solve them. Three things we're working on right now are:</p><p>- building erasure codes into OpenStack Swift[3]</p><p>- making clean responsive UIs to simply communicate information about large storage clusters</p><p>- analyzing system metrics to intelligently respond to and predict system behavior</p><p>Interested in knowing more? Send us an email at jobs@swiftstack.com. Send us your github profile, your LinkedIn account, a link to your website – whatever will best display the work that you’ve done. Tell us in a few lines of text why you’re interested in SwiftStack, and why we’ll be interested in you. We’ll be back in touch shortly to get the conversation started.</p><p>[1] OpenStack Swift dev docs: <a href=\"http://swift.openstack.org\" rel=\"nofollow\">http://swift.openstack.org</a></p><p>[2] SwiftStack + Seagate: <a href=\"http://swiftstack.com/blog/2013/10/22/kinetic-for-openstack-swift-with-seagate/\" rel=\"nofollow\">http://swiftstack.com/blog/2013/10/22/kinetic-for-openstack-...</a></p><p>[3] Erasure codes in Swift: <a href=\"http://swiftstack.com/blog/2013/07/10/erasure-codes-with-openstack-swift/\" rel=\"nofollow\">http://swiftstack.com/blog/2013/07/10/erasure-codes-with-ope...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995040", 
        "user": "notmyname"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Thinkful based in NYC: We're looking for software engineers interested in helping us build an education platform in AngularJS + Python / Flask.<p><a href=\"http://www.thinkful.com/\" rel=\"nofollow\">http://www.thinkful.com/</a></p><p>Thinkful is the best way to learn online part-time. We've been growing revenue 25% each month since founding at the beginning of 2013.</p><p>Our team today is 12 (6 engineers) and growing to 14-16 in January. We took one round of seed funding from Peter Thiel, RRE, Quotidian Ventures in early 2013.</p><p>Contact me directly to talk: darrell@thinkful.com</p><p>We're also hiring for several non-engineering positions: <a href=\"http://www.thinkful.com/about\" rel=\"nofollow\">http://www.thinkful.com/about</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995860", 
        "user": "darrellsilver"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Plunk, a new emerging technology marketing firm, is looking for iOS/Android Developers. Also looking for Designers and Project Managers. email josh@plunkus.com with the Subject \"HN\" for preferential consideration. <a href=\"http://whoisplunk.com\" rel=\"nofollow\">http://whoisplunk.com</a></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996188", 
        "user": "pla3rhat3r"
    }, 
    {
        "address": "Atlanta, GA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">TourBuzz (<a href=\"http://www.tourbuzz.net\" rel=\"nofollow\">http://www.tourbuzz.net</a>) - Atlanta, GA - Full-Time - Local.\n- Lead Software Developer/Architect<p>Our 8-person team has carved out a profitable niche in the real estate photography industry over the past 7 years. We are growing fast, have no debt and no outside investors. Our product roadmap is full of challenging and fun problems as we expand our product to other commercial photography niches.</p><p>We're a great fit for those that prefer an atmosphere where you're given the time and autonomy to digest a problem, collaborate productively w/the business and technical team, and expected build a robust and maintainable solution.\nDay to day you'll be using PHP, AngularJS, compass, ruby, coffeescript, chef, and postgres in an environment where we expect you to develop your skills and learn new tools to increase your productivity.</p><p>We have competitive salary/benefits with a flexible and relaxed working environment (few meetings or deadlines) located in Virginia Highland.</p><p>Reach me at alan@tourbuzz.net.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 33.7489954, 
        "location": "Atlanta, GA", 
        "lon": -84.3879824, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995253", 
        "user": "apinstein"
    }, 
    {
        "address": "Madrid, Spain", 
        "country": "ES", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Want to work in sunny Madrid, Spain? Come join us!<p>We're ShuttleCloud, a small (&lt;15 employees) data migration company based in Madrid &amp; New York. We're hiring a Senior Developer and an Executive Assistant to join us in our (very cool) Madrid office. We're flexible about a lot of things, so don't hesitate and apply.</p><p>--</p><p>Senior Developer. Madrid, Spain.</p><p>Our technical team is seeking a senior developer to lead us and help us support our growth. We want you to teach us &amp; introduce new methodologies and tools, and lead our team towards the future.</p><p>We actively use Ruby, Python, CouchDB, Redis, RabbitMQ… the usual buzzwords. And we're very interested about where you can take us to. More about this opening here: <a href=\"https://shuttlecloud.recruiterbox.com/jobs/26312/\" rel=\"nofollow\">https://shuttlecloud.recruiterbox.com/jobs/26312/</a></p><p>Meet our engineers here: <a href=\"http://blog.shuttlecloud.com/shuttlecloud-engineers-fireside-chats/\" rel=\"nofollow\">http://blog.shuttlecloud.com/shuttlecloud-engineers-fireside...</a></p><p>--</p><p>Executive Assistant. Madrid, Spain.</p><p>We're also looking for an Executive Assistant. We don't ask for any previous experience or look only for people wanting to stay in the position long term (recently graduated students welcome!). We want someone who is independent and who can think ahead. If you think you can do that, then, we want to meet you! So, write us.</p><p>Contact us at: jobs <i>at</i> shuttlecloud.com.</p><p>--</p><p>Thank you for reading, and happy 2014 to everyone!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.4167754, 
        "location": "Madrid, Spain?", 
        "lon": -3.7037902, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995235", 
        "user": "adrinavarro"
    }, 
    {
        "address": "Iași, Romania", 
        "country": "RO", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Iasi, Romania, FULLTIME<p>Blogvio - We’re an early-stage startup focused on making content distribution easy and fun!</p><p>We are currently seeking a few developers to join the team and help us reach our goals. Our web stack is based on Symfony, a custom implementation of SpineJS / CoffeeScript and MongoDB. Ideally you’re also experienced with Stylus / NIB, enjoy analytics and have some front end skills (Ajax, HTML5, CSS3).</p><p>Visit us at <a href=\"http://www.blogvio.com\" rel=\"nofollow\">http://www.blogvio.com</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.1569444, 
        "location": "Iasi, Romania,", 
        "lon": 27.5902778, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996196", 
        "user": "vuzum"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Tanooki Labs - full stack rails dev\nFulltime - NYC\n(Or remote for the right person)<p><a href=\"http://tanookilabs.com\" rel=\"nofollow\">http://tanookilabs.com</a></p><p>What: product focused development work</p><p>Why you should get in touch:</p><p>We're building a company around the central premise that you can be awesome to your clients, awesome to your developers, and still make money.</p><p>We actively keep our rates low so we can work with incredible founders and interesting products. We turn down high-rate \"marketing and communications\" work because we know we won't keep the best talent with uninteresting projects. Finally, we work a 35 hour week because we know the clients will always be on fire and we prize sustainability and efficiency over the appearance of constant work.</p><p>We're growing quickly and are also adding a few more part or fulltime freelancers, so please get in touch if you're interested!</p><p>Contact@tanookilabs.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995799", 
        "user": "ericskiff"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">ënimai - www.enimai.com - Mountain View CA - Full Time, no remote work.<p>Seeking a passionate LTR</p><p>Us: \nA very passionate group of individuals who strongly believe our hardware and software will change how we have approach computing. We went to Caltech, CMU, IIT, RPI, Stanford, UIUC, USC to earn our PhDs and other degrees in Aeronautics, Computer Science, Cryptography, Materials Science, Applied Math, Particle Physics etc.</p><p>Our exs include Apple, Facebook, Google, Jawbone, Lab126, NASA, NSA, Samsung. We have worked on a variety of projects including Android devices, Chromebooks, Cryptanalysis, Distributed systems at Facebook, Jawbone UP, Macbook Pro, OLPC, Personal Aircraft, RISC processors, Speech recognition, Sun workstations, Video compression algorithms etc.</p><p>We love what we do. As a team we believe we will make an impact in this world.</p><p>You:\nBe awesome in coding. Know you are awesome in coding.</p><p>Be a generalist at heart. You could be a specialist in something but you should be open to working on our RTOS one day and twiddling with machine learning algorithms the next. Be cognizant we are a product company trying to pack in as much research as possible i.e end of the day we have to ship a product that makes an impact and amazes people.</p><p>_Understand_ CS fundamentals.</p><p>You shouldn’t just know who is Knuth. You should be ok to program in MMIX if required. You get the point - use whatever tools at your disposal to solve the next available problem/task. You will need to hold a lot of complexity in your head.</p><p>If all this sounds like a relationship you are looking for please apply at <a href=\"http://enimai.theresumator.com/\" rel=\"nofollow\">http://enimai.theresumator.com/</a> or email stdin@enimai.com.  This is a matter of mind and heart so no need to send a picture but a resume of what you have done, what you can do and a statement of what moves you would be a great start.</p><p>Happy New Year.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995794", 
        "user": "magic_at_enimai"
    }, 
    {
        "address": "Toronto, ON, Canada", 
        "country": "CA", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">BNOTIONS - Toronto, Canada - Full Time<p>We're looking for talented web &amp; mobile software engineers, as well as data scientists.</p><p>Some of the tools/frameworks/languages we use: Python, Scala, Javascript, Django, AngularJS, Hadoop, Mahout, NGINX, Redis, PostgreSQL, and many more.</p><p>For more information hit the link below: <a href=\"http://bit.ly/1l1RZVF\" rel=\"nofollow\">http://bit.ly/1l1RZVF</a></p><p>Or shoot me an email: nahim at bnotions.com</p><p>Cheers and Happy New Year!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 43.653226, 
        "location": "Toronto, Canada", 
        "lon": -79.3831843, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996192", 
        "user": "nahimn"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Benchmark Education - Westchester, NY<p>We're an education company with a focus on building literacy for grades K-6. Our small internal dev team is focusing on building the online tools as schools start adopting tablets and online learning.</p><p>Front-end developer</p><p>Skill Requirements:</p><p>-      Advanced web-based user interface development\n-       Advanced in CSS/html markup\n-       Expert in JavaScript\n-       Experienced in modern JavaScript MV frameworks (Backbone, angular, etc.)\n-       Experienced in template libraries and css compilers (Underscore, Mustache, LESS, SASS)\n-       Experience in Git, Subversion or Mercurial\n-     Experience writing PHP web services.\n-       Knowledge of wireframing, diagraming UX\n-       Knowledge of Photoshop, graphic manipulation\n-       Good communicator\n-       Knowledge and some experience in Linux command line\n-       CS degree or equivalent experience</p><p>Skills Prefereed</p><p>-       Some exposure to Agile practices\n-       Interest in literacy education, new methods of teaching\n-       Responsive and adaptive design technologies\n-       Node.js\n-       Desire to understand the underpinnings!\n-       Documentation and commenting\n-       Ability to work with on-site and off-site teams</p><p>Email dfox@benchmarkeducation.com with your resume.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995733", 
        "user": "twunde"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Suitey - New York City - Full time<p>Suitey is a software-powered real estate brokerage changing the way that people buy homes.  We are growing our team significantly as we look to take on more of the New York City market.  We are hiring for:</p><p>- Mobile Engineers\n- Backend Engineers\n- Frontend Engineers</p><p>You'd be an early part of a profitable company with the opportunity for competitive salary and meaningful equity.</p><p>About us:\n* Founded in 2011\n* Great office in Chelsea\n* Fun team with frequent events\n* Small, bright engineering team\n* Solving one of the biggest problems in New York</p><p>Check out more at www.suitey.com or email jobs(at)suitey.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995886", 
        "user": "philipdlang"
    }, 
    {
        "address": "Oakland, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Kato (<a href=\"http://kato.im\" rel=\"nofollow\">http://kato.im</a>) - Oakland, CA - REMOTE, INTERN, FULLTIME<p>We put the \"tea\" back in \"distributed team communication\".</p><p>Looking for a computer science enthusiast intrigued by JavaScript, HTML, CSS, and Erlang.</p><p>andrei@kato.im</p><p>(No recruiters please)</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.8043637, 
        "location": "Oakland, CA", 
        "lon": -122.2711137, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6996240", 
        "user": "rekoros"
    }, 
    {
        "address": "Bangalore, Karnataka, India", 
        "country": "IN", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Artoo (<a href=\"http://artoo.in\" rel=\"nofollow\">http://artoo.in</a>) - Bangalore, India - Fulltime<p>Artoo is improving access to finance and healthcare at the economic base of the pyramid: people who earn less than $4 a day. We use mobile and cloud technology to help enterprises to help their customers out of poverty. We work in the harshest conditions of connectivity, user literacy and technology saavy.  We serve more than 7 Million end-customers across India.</p><p>Artoo is young, chaotic team that recently got funded and is looking for the following roles:</p><p>Hardware Engineer - Love Raspberry Pi / Arduino, help us design and build low cost peripherals for smartphones for critical functions like authentication in financial transactions, and health measurements in primary healthcare.</p><p>Android Developer - Design enterprise grade apps for users with limited literacy and technology savvy. Help users do financial analysis to give a collateral free $1000 loan to a small business, non-communicable disease risk scoring, etc in the most effective way.</p><p>(Emberjs + Nodejs) Full Stack Developer - Design web applications and APIs that allow users to work in spite of bad connectivity, limited technology savvy.</p><p>DevOps Engineer - Optimize performance, uptime, and costs of our AWS infrastructure that includes CouchDB, MySQL and Node application servers.</p><p>Please write to me at sameer[at]artoo[dot]in and highlight the role you are specifically interested in.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 12.9715987, 
        "location": "Bangalore, India", 
        "lon": 77.5945627, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995318", 
        "user": "sameersegal"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time in downtown Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance. We believe that the world's best teachers should be available to all students.</p><p>Educreations is the easiest way for teachers and students to record lessons and share what they have learned online. Millions of teachers and students in tens of thousands of schools are using it to learn from each other anytime, anywhere.</p><p>We are an alumnus of Imagine K12 and we have received funding from Accel Partners, NewSchools Venture fund and other top angels in the education space.</p><p>We are looking for some sharp, passionate people to help us redefine online teaching and learning. We've set out to make a dent in the future of education and if this sounds like something you're interested in, get in touch.</p><p>We are looking for:</p><p></p><pre><code>    Strong Python or Objective C Engineers\n    Visual Designers\n</code></pre>\n<a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995147", 
        "user": "streeter"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Folsom Labs, San Francisco CA, Full-time/Intern Software Engineer<p><a href=\"http://www.folsomlabs.com\" rel=\"nofollow\">http://www.folsomlabs.com</a></p><p>We're building the next generation in solar (PV) system design tools; basically we make it very easy to analyze the potential value of a new PV systems by leveraging an advanced physics simulation engine. We've been in beta for about a year, and are formally calling it 1.0 in a few weeks.  We've got a lot of great traction, and almost universally stellar feedback from our users. We've also recently received a federal grant[1] to help fund our next generation of products (and a round of hires).</p><p>Everyday we get to deal with a range of problems that few startups get to offer – we have a pretty modern web-stack [2] (that we actually need, not just to be trendy), but also get to solve interesting physics/optimization problems on a regular basis, while also acting as industry thought-leaders.  It's a really unique place in both the solar industry, and as a software company.</p><p>We've made it this far as a two-man team, and we're poised for a lot of growth in the next year, so it's about time we brought on some help.  If you're a full-stack engineer looking to do some really interesting work (and occasionally put your undergrad physics courses to real use), we'd love to hear from you.</p><p>– Paul</p><p>paul.gibbs@folsomlabs.com</p><p>[1] <a href=\"http://www1.eere.energy.gov/solar/sunshot/incubator_projects.html\" rel=\"nofollow\">http://www1.eere.energy.gov/solar/sunshot/incubator_projects...</a></p><p>[2] AngularJS (frontend), Python/Flask (API/Backend), Cython/C (Physics Simulation Engine)</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995696", 
        "user": "psgibbs"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Expensify-San Francisco, CA-Fulltime, Programmer Extraordinaire<p>Hey there! Allow us to introduce ourselves. We are Expensify and we do \"expense reports that don't suck!\" (Google \"expensify\" to read more.) We're getting crushed under an ever-growing pile of super awesome work, and I need one bright soul to help us dig our way out. I can guarantee you fun, an amazing opportunity to learn, and the siren's call of distant riches. But only if you are all of the following:</p><p>- An incredibly hard worker, even when it's not so fun. There is a ton of work to do, and a lot of it downright sucks. After all — we do the sucky work so our customers won't need to. I need you to buck up and grind through server logs, user emails, source code, and bug reports, without complaint or supervision, and come back asking for more.</p><p>- A cool person to be with. Not a crazy party animal, just someone we can trust, rely upon, hang out with, bounce ideas off of, and generally interact with in a positive way, both personally and professionally. In fact, this is one of the most stringent requirements we have: would you be fun to hang out with day and night on some remote, exotic beach? This isn't a rhetorical question, either: every year we take the company overseas for a month (on your own dime, sorry) and work incredibly hard while having a ton of fun. We've done Thailand, Mexico, India, Turkey, Croatia and the Philippines. Where do you want to go next?</p><p>- Super talented, in a general way. We're going to throw a ton of work at you of every possible sort, and you need that magic skill of being able to figure it out even if you have no idea where to start. On any given day you might bounce between super low-level coding, super high-level technical support, marketing-driven data-mining, updating our user documentation, inventing/designing/building some new feature, etc. This is not a code monkey job — you're going to be a full participant in the process, and you need to bring your own unique blend of skills to the table.</p><p>- Specifically talented in a programming way. You can instantly visualize solutions to problems big and small. Your code is always clean, well commented, has good nomenclature and indentation. You can switch on a dime between C++, PHP, Bash, Cron, HTML, CSS, JavaScript, jQuery, Dwoo, SQL — not because you know them all, but because you're the sort of person who can just pick it up and figure it out. If you're this sort of person, you'll know what I mean. If not, then this position isn't for you.</p><p>And there are a bunch more, but odds are if you got this far, nothing I can do would stop you from applying. That's a problem because while I know <i>you</i> are awesome, it's actually really hard and time consuming to find you in the midst of the literally hundreds of other applications I get from everyone else. So this is where I'm going to ask my first favor: can you make it really easy and obvious how great you are, so I don't accidentally overlook you?</p><p>There are probably many ways to do that. But the easiest way to do that is to check out we.are.expensify.com and send in an application(which you can find at we.are.expensify.com/apply).</p><p>We are excited to hear from you!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995845", 
        "user": "pensieri"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">London UK, DEVOPS Consultant, Freelance / Contractor, On site only!<p>We're a new consultancy who have a number of contract positions for DevOps people coming up in the new year.  We're looking for Puppet, Chef, VMWare, Python skills.</p><p>Please ping me at bswootton@gmail.com for further information!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995400", 
        "user": "benjaminwootton"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SteepRock is seeking a full-time, experienced Python engineer based in the US to help us deliver high quality applications to the pharmaceutical industry. This job is REMOTE only.<p>We are a fast-paced, client-focused company; we want to continue our success and don't mind working hard to get there. We're looking for someone who's got great attention to detail, loves writing Python code and solve challenging problems on sometimes challenging deadlines. Sounds good? Please apply to join our energetic team!</p><p>SteepRock (<a href=\"http://www.steeprockinc.com\" rel=\"nofollow\">http://www.steeprockinc.com</a>) is an established software and services firm in the Pharmaceutical industry that has an immediate opening for a Python developer. In this position, you will be working closely with the CTO and other senior developers.</p><p>REQUIREMENTS: - 2+ years of enterprise scale software development experience. - Extensive direct experience developing, delivering and maintaining a multi-user browser-based application - Commercial Python experience and complete command of the language - Ability to write and read SQL, including complex joins and optimization - Solid understanding of JavaScript fundamentals - Solid understanding of HTML and CSS</p><p>Apply to jason.cater@steeprockinc.com. Please include resume and salary expectations.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995055", 
        "user": "jcater"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">New York, NY.<p>Full Time.</p><p><a href=\"http://www.thehackerati.com\" rel=\"nofollow\">http://www.thehackerati.com</a></p><p>Software developers at all experience levels. Front end web, back end, big data, iOS/Android. We don't care what languages you know, as long as you're highly skilled in at least one. We use agile and tend to use the same kinds of technologies you'd see in your typical YC startup. Email me if interested:</p><p>alex.krupp@thehackerati.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995199", 
        "user": "Alex3917"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">New York, NY\nFull-time<p>CB Insights (www.cbinsights.com/jobs)</p><p>- Front-end developer (build data visualizations in d3)</p><p>- Tech Industry Analyst (use data/stats to predict emerging industry trends, startup failure/success, VC quality)</p><p>- Full-stack developer (check out our API in GO here - <a href=\"http://www.cbinsights.com/developers/api/\" rel=\"nofollow\">http://www.cbinsights.com/developers/api/</a>)</p><p>We are bootstrapped and have 7-figure subscription revenues.  Voted one of NY's top emerging enterprise tech companies.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995248", 
        "user": "asanwal"
    }, 
    {
        "address": "Salt Lake City, UT, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Salt Lake City, UT -- Lucid Software (Lucidchart / Lucidpress)<p>Lucid Software is building world class graphical applications in the browser and on mobile devices. Our first product, Lucidchart (<a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a>), is an online diagramming application with 1M+ users. We recently launched our second product, Lucidpress (<a href=\"http://www.lucidpress.com\" rel=\"nofollow\">http://www.lucidpress.com</a>), which is an online layout and design application. Lucid is a startup founded by Karl Sun, a former Google exec, and Ben Dilts, our CTO. We're profitable and rapidly growing in every dimension of the business and need people to join our team. For fun we raft river rapids on company retreats, have Friday BBQs, and eat lots of pizza. Talent and ability to learn are more important than specific skills.</p><p>BACKEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress run with various decoupled services in a Linux environment using Scala, MongoDB, AWS, and MySQL. At Lucid your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly available, secure, and scalable.</p><p>Requirements: - Talent - BS degree</p><p>Recommended experience: - Building large products / applications - Scala or Java - MySQL or other relational database - NoSQL databases - Cloud computing (AWS)</p><p>FRONTEND SOFTWARE ENGINEER (all experience levels) - Lucidchart and Lucidpress are powered by one of the largest Javascript codebases on the Internet (about 250k lines of JS), optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.</p><p>Requirements: - Talent - BS degree</p><p>Recommended experience: - Building large products / applications - Javascript - Google Closure compiler/library - CSS/HTML/DOM manipulation - jQuery - Native app development on Android and/or iOS</p><p>All applicants email resumes (and links to recent projects) to jobs@lucidchart.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7607793, 
        "location": "Lake City, UT", 
        "lon": -111.8910474, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995146", 
        "user": "dmgrow"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">London, England - Full Time - Local Only<p>Optim.al / Brand Networks (<a href=\"https://www.optimalsocial.com/\" rel=\"nofollow\">https://www.optimalsocial.com/</a>) is hiring full stack and dev-ops engineers for our London office, working on real time bidding, analytics, data science and front end web applications.</p><p>Requirements:</p><p></p><pre><code>    * BS or MS degree in computer science, mathematics, or related field.\n    * Good understanding of web technologies HTML, Javascript, HTTP, JSON, REST\n    * Can demonstrate that you're a great \n      programmer in at least one of Scala, Python, Java, Clojure, Haskell, \n      F#, Kotlin or Ruby\n    * Willing to work in Python, Scala and Java\n    * Good understanding of a Unix based operating system\n    * Some experience of databases and at least one web application framework\n</code></pre>\nIf you love programming and would like an interesting job with a steep learning curve and a wide variety of challenges, please get in touch. You can email me personally at jamie@optimalsocial.com.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995083", 
        "user": "scanr"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SeatGeek -- New York, NY -- Full Time We're a search engine for tickets and live events. Think \"Kayak for sports/music/theater tickets.\"<p>⇒ Android Developer -- Looking for someone eager to build the Andorid app to accompany an already-successful iOS app. Details here: <a href=\"http://seatgeek.com/jobs/android_developer/\" rel=\"nofollow\">http://seatgeek.com/jobs/android_developer/</a></p><p>⇒ Web Engineer -- We're looking for someone who loves building web apps. Everything else (professional experience, where in the stack you fit, the languages you've used) is up for debate. Details here: <a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995415", 
        "user": "jack7890"
    }, 
    {
        "address": "Toronto, ON, Canada", 
        "country": "CA", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Kira Talent (<a href=\"https://www.kiratalent.com\" rel=\"nofollow\">https://www.kiratalent.com</a>) - Toronto, Canada<p>At Kira Talent, we help employers spot top talent earlier in the hiring process through timed video interviews.</p><p>A bit about us:</p><p></p><pre><code>  * we’re a small team (you’d be #13), based in the heart of downtown Toronto\n\n  * we’re well funded (we just raised a $2M seed round) and have had paying clients since day 1 of the company \n\n  * we’re hiring all types of devs -- mobile, frontend, backend, analytics \n\n  * we think even enterprise software can be beautiful, and pride ourselves on our design \n\n  * every single one of our developers have committed code within their first day at work; some within their first hour\n</code></pre>\nHere’s some stuff we’ve been working on lately:<p></p><pre><code>  * building infrastructure to allow us to scale our video recording and streaming\n\n  * re-building the UI-heavy sections of our product using AngularJS\n\n  * designing and creating our mobile suite for both job candidates and employers alike \n\n  * presenting analytics data captured in our product to the end user, and our team internally\n</code></pre>\nWe mostly use Python/Django, JavaScript (jQuery, AngularJS), MySQL (and some MongoDB), but you’d be free to choose your own tools and libraries. If this sounds fun, let’s chat! My name is Konrad, I'm the co-founder/CTO, and you can send me a note at konrad@kiratalent.com. :)</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 43.653226, 
        "location": "Toronto, Canada", 
        "lon": -79.3831843, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995643", 
        "user": "klistwan"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Accredify - Miami (remote possible to start) - CTO<p>Accredify is the leading verifier for Accredited (and soon non-accredited) investors based on new SEC regulations as presented in the JOBS Act.</p><p>We are looking for a CTO to build out our API's and develop a dashboard to manage your equity crowdfunding investments online. This is an opportunity to architect an amazing platform that requires working with the major equity crowdfunding portals that exist today.</p><p>We are a fun, early stage startup looking for someone with experience in REST/JSON, C, Javascript, Python, SQL, Ruby.</p><p>Above market salary and equity stake within the company guaranteed, as well as lovely weather and good looking people, because hey, it's Miami!</p><p>See: <a href=\"http://accredify.co/jobs/\" rel=\"nofollow\">http://accredify.co/jobs/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995878", 
        "user": "yourmailman"
    }, 
    {
        "address": "Austin, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">StepOne, Inc (<a href=\"http://www.steponeinc.com\" rel=\"nofollow\">http://www.steponeinc.com</a>) - Austin, TX - INTERN, FULLTIME, REMOTE OK<p>We are a funded (<a href=\"http://www.liveoakvp.com/past-investment.html\" rel=\"nofollow\">http://www.liveoakvp.com/past-investment.html</a>) SaaS company that is simplifying customer support through machine learning(ML), natural language processing(NLP), effortless identity, personalization and analytics(Big Data).  We are still in stealth mode but are getting ready to launch in the coming months and are getting ready to grow quickly as we are in the process of additional fund raising, so if you have an interest in any of these topics and want to make a real impact in how these problems are solved then we want to hear from you.</p><p>Our stack is Django/Python, Postgres, Redis, Angular and Salt, but are also looking to expand this as we expand the solution.  We believe in, and have a strong interest in, constantly learning, so if you have any great ideas about new tools that we should be using then we will certainly listen.  We are not quite continuous deployment(currently on weekly schedules), but are working towards that.  We practice TDD, code reviews and believe in automating everything.</p><p>We are currently hiring for:</p><p>* Django/Python developers(both web stack as well as just strong Python developers to help with Backend services)</p><p>* Client side developers(UI/UX)</p><p>If you are interested, please send an email to erik@steponeinc.com</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 30.267153, 
        "location": "Austin, TX", 
        "lon": -97.7430608, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995621", 
        "user": "enoren"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Remote, Anywhere<p>Sucuri, INC: <a href=\"http://sucuri.net\" rel=\"nofollow\">http://sucuri.net</a></p><p>Senior PHP Developer:\n<a href=\"http://sucuri.net/company/senior-php-developer-ops-022514\" rel=\"nofollow\">http://sucuri.net/company/senior-php-developer-ops-022514</a></p><p>Sucuri is looking for a Senior PHP Developer with shell scripting and Linux experience to join our R&amp;D (Research and Development) team. You need to be able to write clean and secure PHP code and also push it live to servers on a continuous base.\nAs a senior developer you would also be responsible for code reviews and guiding more junior developers on their work.\nMore details here: <a href=\"http://sucuri.net/company/senior-php-developer-ops-022514\" rel=\"nofollow\">http://sucuri.net/company/senior-php-developer-ops-022514</a></p><p>thanks!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Remote, Anywhere", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995872", 
        "user": "daviddede"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Remote, Anywhere<p>Sucuri, INC: <a href=\"http://sucuri.net\" rel=\"nofollow\">http://sucuri.net</a>\nSystem Administrator</p><p>Sucuri is looking for a System Administrator with strong Linux and shell scripting experience to join our IT team.\nAs a system administrator with Sucuri, you would be responsible for building and maintaining our entire stack. This includes all servers and applications used by the team. You would also be responsible for the security of the servers, including log monitoring to ensure their integrity and performance. We place a strong emphasis on security, so you should too. In case of emergencies, you should be available as well.</p><p>More details here: <a href=\"http://sucuri.net/company/system-administrator-022517\" rel=\"nofollow\">http://sucuri.net/company/system-administrator-022517</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Remote, Anywhere", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995877", 
        "user": "daviddede"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">TINYhr - Seattle Wa - full time\nWe're looking for a talented full stack Ruby on Rails developer to join our small team. Our mission is to make employees and clients happier. We spend over 50% of our waking hours at work, so why not be happier and help make others happier?<p>We were called \"revolutionary\" in this Fast Company piece:  <a href=\"http://bit.ly/GIHiIb\" rel=\"nofollow\">http://bit.ly/GIHiIb</a></p><p><a href=\"https://www.tinypulse.com/jobs\" rel=\"nofollow\">https://www.tinypulse.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996017", 
        "user": "sbeckeriv"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Citymapper (London, UK) - Help build the world's best transport app!<p>(Python, iOS/Android, JavaScript, etc)</p><p>We're looking for great people first and foremost, but here are some of the things we make:</p><p>* Client experiences that people love. We have iOS, Android, and web apps.</p><p>* An omnivorous transport data processor. We fuse together loads of data sources (of wildly varying quality) to give people the information they need in a growing number of cities around the world. We use a lot of Python.</p><p>* A fast, scalable stable of servers. We have a large user base which relies on us to give them snappy answers every day. We use Saltstack.</p><p>* A psychic city brain. We're digging up patterns in urban data to tell people the answers they need to know about their commute before they know the questions.</p><p>If you want to help us with these things and other yet-to-be revealed madcap schemes, we want to hear from you!</p><p><a href=\"http://citymapper.com/jobs\" rel=\"nofollow\">http://citymapper.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995758", 
        "user": "EmilLondon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Imgur is looking for full stack engineers to work in their San Francisco office.<p>Write code in PHP5, HTML 5, CSS 3, and JavaScript, and be familiar with other technologies we use: MySQL, Nginx, Memcached, Redis, HAProxy, Varnish, HBase, Hadoop, AWS EC2, Monit, and Ganglia</p><p><a href=\"http://imgur.com/jobs\" rel=\"nofollow\">http://imgur.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996125", 
        "user": "Briankassouf"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Front end web developer, OpenEye Scientific Software - Santa Fe, NM<p>I've pasted in the job description below. Email hr@eyesopen.com for details.</p><p>About OpenEye Scientific Software, Inc:\nOpenEye Scientific Software provides software to the pharmaceuticals industry for molecular modeling and cheminformatics. It has done so since 1997 in its continuing mission to provide novel software, new science and better business practices to the industry. Central to our approach is the importance of shape and electrostatics as primary variables of molecular description, platform-independent code for high-throughput 2D and 3D modeling, and a preference for the rigorous rather than the ad hoc.</p><p>With offices in the United States, Germany &amp; Japan, OpenEye Scientific Software is a global company. However, with fewer than 50 employees we offer a unique working culture. We believe that work should be fun and our working environment supports this philosophy. For the third year we have been a recipient of the Alfred P. Sloan Award for Business Excellence in Workplace Flexibility.</p><p>FRONT END WEB DEVELOPER</p><p>Location: Santa Fe, New Mexico\nEmployee type: Full-time\nIndustry: Computer Science, Biotechnology\nManages others: No\nJob Type: Information Technology\nEducation: BSc degree\nExperience: 3 or more years\nTravel: Occasional\nPost date: January 2014\nRelocation covered: Yes\nContact information\nSend cover letter and resume to:\nOpenEye Scientific Software Recruiting\n9 Bisbee Court, Suite D\nSanta Fe, NM, 87508</p><p>Contact information\nSend cover letter and resume to:\nOpenEye Scientific Software Recruiting\n9 Bisbee Court, Suite D\nSanta Fe, NM, 87508</p><p>or email to hr@eyesopen.com.</p><p>Job Description:</p><p>The ideal candidate for this position is someone who can design and implement interactive web interfaces. The candidate should understand user interface design, and be familiar with state of the art web application technologies. Although the position is primarily for interfaces, the candidate should have an understanding of how interactive web applications work.</p><p>You will be working in a small focused team that is envisaging how we build applications for deployment on Amazon Web Services and delivery via the web browser. You are not expected to be a seasoned chemist, but expect to pick some chemistry up along the way.</p><p>Requirements:</p><p>* BSc degree in computer science, or a similar area.\n* Minimum 3 years of experience in a similar position.\n* Proven track record of deploying interactive web interfaces using HTML5 &amp; CSS3.\n* Requires experience as follows:</p><p>* Use of CSS, optionally using SASS or Compass.\n* Use of Bootstrap or similar frameworks.\n* Use of JavaScript and Ajax via CoffeeScript.\n* Use of jQuery, Dojo, AngularJS, Closure, Ember or similar JavaScript libraries.\n* Use of real time technologies such as WebSockets and other HTML5 advancements.\n* Use of testing frameworks associated with these technologies. For example Selenium, Jasmine, PhantomJS or similar.\n* Use of mockup software such as Balsamiq, Moqups or similar.\n* Software development using Windows, Linux, and Unix operating systems and common browsers they support (with an appreciation of there numerous idiosyncrasies).</p><p>Desired experience as follows:</p><p>* Use of Python.\n* Use of Python web frameworks such as Django, Flask and Tornado.\n* Appreciation of Amazon Web Services.</p><p>OpenEye Scientific Software is an Equal Opportunity Employer</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995143", 
        "user": "jlafon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Rescale - San Francisco, CA - Full Time<p>Software Engineers, Platform Engineers, and Sales Engineers</p><p><a href=\"http://www.rescale.com/careers/\" rel=\"nofollow\">http://www.rescale.com/careers/</a></p><p>Please contact us at jobs@rescale.com if interested</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996155", 
        "user": "gpoort"
    }, 
    {
        "address": "Charlottesville, VA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">VividCortex - Charlottesville, VA - MySQL Database Performance Management<p>Positions for both summer interns and fulltime available.</p><p><a href=\"https://vividcortex.com/jobs/\" rel=\"nofollow\">https://vividcortex.com/jobs/</a></p><p>Systems Programming</p><p>Our agents, backend systems, and infrastructure are all written in Go (it’s awesome). We are ramping up to handle a jaw-dropping amount of incoming data. Data storage involves MySQL and other technologies in a fault-tolerant, distributed environment.</p><p>Operations and System Administration</p><p>We’re hosted in Amazon AWS and looking for people who do developer and sysops types of work — writing some server software, setting up some machines, whipping up some Ansible code, and so on.</p><p>Front End Development</p><p>The web app is backed by a small amount of PHP and Symfony2, and fronted by Angular and D3.js, CSS (Less), and HTML5. There’s a lot of API interaction from JavaScript, and a complex single-page user interface with rich data visualization that’s key for making our customers rave about the experience, not just the technology. We need people who can work in Angular, D3, design, styling, and so forth.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 38.0293059, 
        "location": "Charlottesville, VA", 
        "lon": -78.47667810000002, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995394", 
        "user": "kylered"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Toronto - Uken Games\nSoftware Engineer (full time)<p>Uken is looking for talented software engineers to become members of our core development team.</p><p>You'd be working on meaningful things like:</p><p>- creating performant, cross-platform games;</p><p>- building game features that are deployed weekly to our millions of players;</p><p>- writing beautiful, maintainable code with extensive test coverage.</p><p>Your background should include:</p><p>- proven software engineering skills;</p><p>- excellent understanding of web architecture;</p><p>- the ability to communicate clearly;</p><p>- an appetite to learn, grow, and take on increasingly more responsibility;</p><p>- a strong desire to build something that people really want.</p><p>It'd be a big plus if you have:</p><p>- experience developing games;</p><p>- experience building applications for mobile platforms;</p><p>- contributed to an open source project (include your github profile);</p><p>- experience with the technologies we use: ruby on rails, objective-c, javascript, nginx, mysql, linux.</p><p>We believe in a fun &amp; meaningful work environment:</p><p>- you'll be equipped with a MacBook Pro/Air, 27\" monitors, iOS/Android device;</p><p>- stock options and competitive salaries;</p><p>- full health, dental, vision coverage;</p><p>- snacked-filled kitchen and booster juice breaks;</p><p>- catered breakfast, lunch, and dinner;</p><p>- convenient location downtown Toronto</p><p>About Us</p><p>Uken is one of the only true cross platform gaming companies around. We build fun social and mobile games that make people stare, smile, jump, and feel awesome inside. We have a quirky nerdy culture that fosters creativity, collaboration, quality ideas, and a data driven mindset. We believe in moving quickly and improving constantly and that mantra is reflected in the weekly updates we make to our games and internal technologies. We have an appetite for pushing technical boundaries and we’ve done exactly that with HTML5. We work on products that are used by millions of people everywhere and we’re just getting started.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995382", 
        "user": "lamplightr"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SVBio: Foster City, CA (next to San Mateo, in the SF Bay Area): Full-time<p>=========================================================================</p><p>SVBio (<a href=\"http://svbio.com/\" rel=\"nofollow\">http://svbio.com/</a>) is looking for the most talented full-stack software engineer with experience and understanding of web architecture design and implementation, following best and up-to-date practices. The work will further enhance the application of our clinical-grade genome interpretation engine. As leaders in the field, we drive the vision of the genome-interpretation product down to the last detail - only modern browsers are supported here!</p><p>Knowledge of some specific technologies is greatly desired (see below), but not necessarily required for the right hacker. Knowledge of javascript is a must, as well as the desire to write clean and maintainable code. Knowledge of the genome and next-generation-sequencing technologies is really nice to have, but definitely not required. SVBio is a tightly-knit organization with people from many diverse disciplines and backgrounds, so being an all-around friendly person is a must.</p><p>Anyone who is interested should contact me (elicudine -A-T- svbio.com) directly with your background, a resume/c.v., some previous work samples, a github link, whatever you think might help me out.</p><p>---Preferable knowledge/experience---</p><p>- Significant proven experience, both in frontend and backend technologies.</p><p>- Dynamic frontends (angular.js, angular-ui, JQuery, d3.js)</p><p>- Advanced backend architectures (at least one of: node.js, express/hapi/geddy/koa, flask, twisted, django, sinatra, rails)</p><p>- Scalable persistency layers (HDFS, Postgres, mysql, mongodb)</p><p>- Other tools (grunt.js, bower.js, require.js)</p><p>- Testing frameworks (at least one of: chai.js, mocha.js, karma, capybara, cucumber, istanbul, supertest)</p><p>-- Additional valuable experience:</p><p>- Strong scripting knowledge (e.g., python, perl, bash)</p><p>- An eye for aesthetics</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995373", 
        "user": "edolfo"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Potato - London, Bristol UK, Mountain View, Dublin IE<p>Potato is a 70-person developer-lead agency based in London, UK with offices in Bristol, Sydney &amp; San Francisco. Our clients include Google, PayPal, Skype, a number of startups and other agencies such as BBH &amp; Mother. We're hiring for a variety of positions in a variety of locations, freelance &amp; full time, including Django developers, Front End developers and senior UX designers in London, Mountain View, Dublin IE &amp; Bristol UK.</p><p><a href=\"http://p.ota.to/jobs/\" rel=\"nofollow\">http://p.ota.to/jobs/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995157", 
        "user": "jasoncartwright"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Remote, Anywhere<p>Sucuri, INC: <a href=\"http://sucuri.net\" rel=\"nofollow\">http://sucuri.net</a></p><p>Senior FrontEnd Developer</p><p>Sucuri is looking for a Senior Frontend Developer to join our R&amp;D (Research and Development) team.\nAs a senior frontend develper you would be responsible to build dynamic, responsive and beautiful HTML/Javascript/CSS code to be integrated into our web application products.\nMore details here: <a href=\"http://sucuri.net/company/senior-frontend-developer-022516\" rel=\"nofollow\">http://sucuri.net/company/senior-frontend-developer-022516</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Remote, Anywhere", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995885", 
        "user": "daviddede"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Palo Alto, CA<p>INFER, INC.</p><p>- Team: &lt;10 engineers from MIT, Berkeley, Stanford, Google/Google Research, Facebook, Y Combinator, Microsoft Research, Jane Street, IBM Research, Yahoo Research, ...</p><p>- Investors: Red Point, a16z, SHV, Social Capital, ...</p><p>- Customers: Box, Jive, Microsoft, Tableau, Zendesk, AdRoll, Nitro, and many more</p><p>- Product: machine learning applications for non-technical users to help their businesses more effectively capture and retain customers</p><p>- Looking for: strong engineers excited to join an early-stage startup to grow with &amp; shape the company</p><p>EXAMPLES OF RESPONSIBILITIES</p><p>- Build on and extend our sophisticated model training pipeline that uses data extracted from the web and other sources</p><p>- Build beautiful visualizations to help customers understand model performance and meaning</p><p>- Develop and operate secure, scalable cloud infrastructure to manage and process customers' large, confidential datasets</p><p>- Interact with customers, analyze their data, understand their pain points, and develop new product features and new products</p><p>QUALIFICATIONS</p><p>- BS/MS/PhD in Computer Science, Statistics, Math or related fields</p><p>- Depth in software engineering, algorithms, and general analytical problem-solving</p><p>- Familiarity with Python preferred</p><p>CONTACT</p><p>- <a href=\"https://www.infer.com\" rel=\"nofollow\">https://www.infer.com</a></p><p>- hiring+hn@infer.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995498", 
        "user": "infer"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">New York - Software Engineer<p>VFiles is the hippest and foulest-mouth fashion startup around. Our shop[1] is the most relevant fashion destination in New York today, our YouTube shows[2] are insanely popular, and we want you to help us bring our social media site to life.</p><p>We are looking to add one or two more engineers to our current team of two (in a company of about twenty). Every engineer here will be full-stack, though we're happy to have someone who leans to one side or the other and is eager to learn. Technologies we use include Ruby, Haskell, Angular, Coffeescript, Redis, and more. As part of our team, you will have both a strong voice in the vision and direction of our product and a good deal of autonomy and control in the specific projects you work on.</p><p>As for fringe benefits, we throw the most talked about parties in town (hosted by A$AP Mob and crashed by Kendrick Lamar), we have company trips to Montauk, we organize funky Soul Cycle rides with famous designers and models, and we're invited to pretty much everything happening, culture-wise, in New York. You'll work with a diverse group of people with a number of skillsets, all of whom - editorial, video, design - are at the very top of their game.</p><p>We can only consider candidates eligible to work full-time in the US who live or are planning to move to New York City at this time.</p><p>You can write the Chief Engineer directly at tim (a) vfiles (dot) com to express your interest.</p><p>[1] <a href=\"https://www.vfiles.com/shop\" rel=\"nofollow\">https://www.vfiles.com/shop</a> and <a href=\"http://www.nytimes.com/2013/05/02/fashion/building-blocks-al..\" rel=\"nofollow\">http://www.nytimes.com/2013/05/02/fashion/building-blocks-al...</a>.</p><p>[2] <a href=\"http://www.newyorker.com/online/blogs/culture/2013/05/model-..\" rel=\"nofollow\">http://www.newyorker.com/online/blogs/culture/2013/05/model-...</a>.</p><p>[3] Our \"user-generated\" fashion show for fashion week <a href=\"http://www.thefader.com/2013/09/05/nyfw-vfiles-made-fashion\" rel=\"nofollow\">http://www.thefader.com/2013/09/05/nyfw-vfiles-made-fashion</a> and <a href=\"https://www.youtube.com/watch?v=VJsRvjAQULc\" rel=\"nofollow\">https://www.youtube.com/watch?v=VJsRvjAQULc</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995232", 
        "user": "vfiles"
    }, 
    {
        "address": "Charlotte, NC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Charlotte, NC – Software Engineer. Full-time and Internships - PassportParking.com\nWe’re building mobile payment solutions for parking. No more coins! We’re a small team growing fast and ready to bring on a few more developers to push things faster.\nWe've found the best way to form a relationship is through our programming challenge. Just show us your skills. (dont care to much for resumes!) <a href=\"http://passportparking.info/PassportProgrammingTest/\" rel=\"nofollow\">http://passportparking.info/PassportProgrammingTest/</a>\nFeel free to reach out if you have questions! Cheers, Brad brad@passportparking.com</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 35.2270869, 
        "location": "Charlotte, NC", 
        "lon": -80.8431267, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995820", 
        "user": "bpowers"
    }, 
    {
        "address": "Portsmouth, NH, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Portsmouth, NH (Seacoast area) - Full Time<p>PixelMEDIA (<a href=\"http://www.pixelmedia.com/\" rel=\"nofollow\">http://www.pixelmedia.com/</a>)</p><p>Full Time Positions:</p><p>* Front-End Developer\n<a href=\"http://www.pixelmedia.com/careers/front-end-developer\" rel=\"nofollow\">http://www.pixelmedia.com/careers/front-end-developer</a></p><p>* Full Stack Web Developer\n<a href=\"http://www.pixelmedia.com/careers/full-stack-web-developer\" rel=\"nofollow\">http://www.pixelmedia.com/careers/full-stack-web-developer</a></p><p>* Senior Application Developer\n<a href=\"http://www.pixelmedia.com/careers/senior-application-developer\" rel=\"nofollow\">http://www.pixelmedia.com/careers/senior-application-develop...</a></p><p>* .NET CMS Developer\n<a href=\"http://www.pixelmedia.com/careers/net-cms-developer\" rel=\"nofollow\">http://www.pixelmedia.com/careers/net-cms-developer</a></p><p>* Support Developer\n<a href=\"http://www.pixelmedia.com/careers/support-developer\" rel=\"nofollow\">http://www.pixelmedia.com/careers/support-developer</a></p><p>Also openings in design and UX <a href=\"http://www.pixelmedia.com/careers/\" rel=\"nofollow\">http://www.pixelmedia.com/careers/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 43.0717552, 
        "location": "Portsmouth, NH", 
        "lon": -70.7625532, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995516", 
        "user": "subv3rsion"
    }, 
    {
        "address": "Berlin, Germany", 
        "country": "DE", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Android Engineer at Clue, www.helloclue.com, Berlin (relocation and visa assistance offered)<p>Use your powers for good to help change the face of fertility/period tracking. It's not your standard cycle tracking app - we turn to our good friend Science to make recommendations to women about where they are in their cycle, and what that means to them. They more it's used, the more it knows about you, and the more it can help you.</p><p>We've got a great iOS app, we've got thousands of active users, we have funding, but we need an Android implementation to take us to the next level. That's where you step in! You'll have plenty of control and freedom to make this a properly native Android app.</p><p>Interested? Curious? Contact me directly at josh@helloclue.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.52000659999999, 
        "location": "Berlin", 
        "lon": 13.404954, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995175", 
        "user": "notjosh"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Bot &amp; Dolly - SF (Potrero Hill) - FULLTIME<p>We are working to advance robotics and automation as a creative medium and build world-class tools that enable others to do the same. As part of Google's new robotics initiative (<a href=\"http://nyti.ms/19ghryl\" rel=\"nofollow\">http://nyti.ms/19ghryl</a>), we're working with some of the best engineers and designers on the planet to build the future of automation.</p><p>Our open positions are described on our website (<a href=\"http://botndolly.com/jobs\" rel=\"nofollow\">http://botndolly.com/jobs</a>). We're looking particularly for people with experience building modern 3D applications and UIs, as well as strong C++ generalists.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995699", 
        "user": "ijs"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SFX Entertainment/Arc90, New York, NY (NYC), Remote-friendly<p>We need help building exciting new technology around EDM. If you're interested in any of these positions, please email me (brianb@arc90.com) with some code samples or a portfolio.</p><p>Director of Employee Development</p><p>Mobile Developers (Android + iOS)</p><p>Front End Web Developers</p><p>Java/Clojure Developers</p><p>Web Designers</p><p>Python Web Developers</p><p>More info here: <a href=\"https://arc90.recruiterbox.com/\" rel=\"nofollow\">https://arc90.recruiterbox.com/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995802", 
        "user": "bowmanb"
    }, 
    {
        "address": "Copenhagen, Denmark", 
        "country": "DK", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Copenhagen, Denmark, Europe<p>CSIS Security Group - fighting it criminals</p><p>We are looking for a python developer to help us fight it-criminals along with our world class security researchers - and develop state-of-the-art systems for both intelligence, analytics etc.</p><p>Apply via <a href=\"http://www.csis.dk/da/csis/job/jobs/4094/\" rel=\"nofollow\">http://www.csis.dk/da/csis/job/jobs/4094/</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 55.6760968, 
        "location": "Copenhagen, Denmark,", 
        "lon": 12.5683371, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995910", 
        "user": "sorenvrist"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Couchbase - I need a couple of hackers for a new science project, also we are hiring lots of more traditional mobile and database engineering positions. <a href=\"http://www.couchbase.com/careers\" rel=\"nofollow\">http://www.couchbase.com/careers</a><p>jchris@couchbase.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995448", 
        "user": "jchrisa"
    }, 
    {
        "address": "Chicago, IL, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Chicago, IL<p>OpinionLab is in hyper growth mode, and we are looking for driven, talented individuals who want to become part of a dynamic and innovative company.</p><p>OpinionLab is the global leader in Voice of Customer (VoC) feedback innovation, serving a prestigious client list that includes nearly half of Fortune 50 organizations such as Walmart, Bank of America, Ford Motor Company, and many more. With real-time listening solutions for every brand touch point, our pioneering VoC platform invites consumers to share input in their own words, at anytime, from anywhere, helping organizations collect, understand, and leverage both structured and unstructured customer data.</p><p>We have many open positions, but here's a snapshot:</p><p><a href=\"http://www.opinionlab.com/senior-rails-engineer/\" rel=\"nofollow\">http://www.opinionlab.com/senior-rails-engineer/</a></p><p>We are seeking a Senior Rails Engineer with strong development skills to join our Chicago, IL based Product Development team. As a member of our Product Development team, you will play a critical role in the architecture, design, development, and deployment of OpinionLab’s web-based applications and services. You will be part of a high-visibility agile team […]</p><p><a href=\"http://www.opinionlab.com/scrum-master/\" rel=\"nofollow\">http://www.opinionlab.com/scrum-master/</a></p><p>We are seeking a Scrum Master with a strong technical background to join our Chicago, IL based Product Development team. As a member of our Product Development team, you will play a critical role in leading the software development process for one of our high-powered development teams.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 41.8781136, 
        "location": "Chicago, IL", 
        "lon": -87.6297982, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995255", 
        "user": "firepoet"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Formlabs - Boston, MA - Full Time<p>Algorithms Engineer</p><p>The Job:</p><p>- Develop world class desktop 3D printer software with a focus on geometric algorithms</p><p>- Lead the development of cutting edge software features from inception to release</p><p>- Serious, low level, high performance coding</p><p>Software is at the center of our product development, as it bridges the transition from digital models to beautiful physical form in 3D printing. If you are a talented engineer  and you’re ready to dirty your hands with 3D geometric algorithms and other puzzling problems, we want you to join our team.</p><p><a href=\"http://formlabs.com/pages/jobs\" rel=\"nofollow\">http://formlabs.com/pages/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3584308, 
        "location": "Boston, MA", 
        "lon": -71.0597732, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995662", 
        "user": "swighton"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Any body could provide me a H1B visa? My resume:<a href=\"https://raw.github.com/haosdent/resume/master/Resume_HaosongHuang.pdf\" rel=\"nofollow\">https://raw.github.com/haosdent/resume/master/Resume_Haosong...</a> :-)</font>", 
        "h1b": true, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995649", 
        "user": "haosdent"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Single founder seeking employee number 1 with potential co-founder status.  I've gotten startup to revenue generating stage and ready to start ramping up. im technical myself but plan to move away from development as I scale.<p>Currently bootstrapping and self funded by I am an EIR at a vc firm so can raise money if/when needed. Right now im generating revenue through both product and services.</p><p>Remote or Utah based.</p><p>Tech stack is PHP, MongoDB, Backbone.js</p><p>Email me: dan at my hn username .com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995437", 
        "user": "fellars"
    }, 
    {
        "address": "Washington, DC, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Pascal Metrics, Washington DC (Georgetown)<p>We're a healthcare startup focused on improving patient safety in hospitals.</p><p>Our software platform enables clients to detect, track, and analyze patient safety issues across hospital systems.</p><p>Open positions:</p><p>Java Engineer - Core Java developer to help build out our SaaS platform. Experience with play! framework, event processing, distributed systems a plus.</p><p>QA Engineer - QA engineer with experience developing and executing rigorous test plans for web applications and a passion for seeking &amp; destroying software defects.</p><p>UI Engineer - Front-end developer with knowledge of CSS, HTML5, Javascript for our SaaS platform. Knowledge of MVC frameworks and CSS organization desired.</p><p>Systems Engineer - Engineer to build scalable infrastructure based on puppet. Linux and scripting experience required. Configuration management experience a plus.</p><p>Check us out at <a href=\"http://www.pascalmetrics.com\" rel=\"nofollow\">http://www.pascalmetrics.com</a></p><p>Full job listing: <a href=\"https://www.smartrecruiters.com/PascalMetricsInc\" rel=\"nofollow\">https://www.smartrecruiters.com/PascalMetricsInc</a></p><p>If you're interested in getting involved with healthcare, improving work culture, and tackling hard technical challenges, please feel free to reach out to me directly to chat in detail.</p><p>theo at pascalmetrics.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.90723089999999, 
        "location": "Pascal Metrics, Washington", 
        "lon": -77.0364641, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995197", 
        "user": "theo"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">CB Insights (<a href=\"http://www.cbinsights.com\" rel=\"nofollow\">http://www.cbinsights.com</a>) - Front End Developer (Full Time), New York City, NY<p>Want to build beautiful, intuitive UIs and data visualizations that will enable world class venture capital firms and Fortune 500 corporations to predict the future?</p><p>You have:</p><p>Extensive experience with Javascript, CSS and HTML, as that will be your primary focus. We work with d3.js, knockout.js, and jQuery to name a few tools.</p><p>You don't need to know them all but you're excited at the prospect of learning about them.</p><p>Strong programming skills, you laugh off your peers who dismiss Javascript as a second rate language.</p><p>Familiarity with the full stack, as you will be called upon to do things such as pull data from an API.</p><p>An eye for design.</p><p>You enjoy:</p><p>Building data visualizations like the ones we use for our Investor Mosaic models.</p><p>Working with a talented team, but are self-motivated and have the ability to work alone too.</p><p>Developing and maintaining great software with an emphasis on speed and scalability.</p><p>You want to help us:</p><p>Discover ways of presenting data to our customers that will make them better at what they do.</p><p>Continually improve our product by developing new features and enhancing current ones.</p><p>Ultimately disrupt an information services industry whose software applications still look like they were built in 1983.</p><p>Send an email to career@cbinsights.com if you're interested. More jobs here: <a href=\"http://cbinsights.com/jobs\" rel=\"nofollow\">http://cbinsights.com/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995114", 
        "user": "alienfluid"
    }, 
    {
        "address": "Bedford, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">iRobot (<a href=\"http://www.irobot.com\" rel=\"nofollow\">http://www.irobot.com</a>) - Bedford, MA (just outside of Boston, MA)<p>Do you think robots are cool? So do we!</p><p>We're looking for smart engineers who are easy to work with. You should probably think robots are cool, but no robotics background is required. (I had no robotics background when I started at iRobot.)</p><p>iRobot is looking for software engineers and mechanical engineers.</p><p>Here are a few of our 20+ job openings:</p><p>* Android developer</p><p>* Embedded software engineers\n  * We're hiring for \"big embedded\" (Linux and big cpus) and \"small embedded\" (bare-metal, small cpus)</p><p>* Software engineers for navigation and mapping</p><p>* Test engineers</p><p>* Mechanical engineer</p><p>Check our jobs site for all positions: <a href=\"http://www.irobot.com/us/Company/Careers.aspx\" rel=\"nofollow\">http://www.irobot.com/us/Company/Careers.aspx</a></p><p>Email me directly if you'd like to know more: csvec@irobot.com</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.4906231, 
        "location": "Bedford, MA", 
        "lon": -71.2760089, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995338", 
        "user": "svec"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">SevenFifty: B2B software in the wine and spirits world. New York, NY<p>We're looking for full-time software engineers to help change the beverage alcohol business. Our stack is Rails backed by Postgres with Solr for search.</p><p>About the company. Ever wonder how bars and restaurants buy their alcohol? SevenFifty is modernizing the wholesale beverage alcohol industry, which is massive but technologically antiquated. We're working with leading wholesalers, bars, restaurants, and wine stores across the country. We're funded, have revenues, and are on track to being profitable without additional funding.</p><p>About your role. You’ll be an early member of the engineering team and will tackle a wide range of problems. You’ll get exposure to all aspects of web application development. You'll work on hard problems like search and the processing of structured and unstructured datasets. You’ll own user-facing features from conception and design to deployment. You’ll also learn about the wine and spirits industry, which is intellectually rich, occasionally bizarre, and a ton of fun. (If interested, we’ll even help you further your formal education in wine, spirits, or beer.)</p><p>You can email me directly at steve@sevenfifty.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995136", 
        "user": "stevepike"
    }, 
    {
        "address": "Barcelona, Spain", 
        "country": "ES", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Playfulbet - Barcelona, Spain<p>-----------------------------</p><p>Playfulbet is seeking for a Ruby developer!</p><p>Playfulbet is a sports betting social game with more than 60.000 users. In Playfulbet, you will be an important part of a project with more than 4 million pageviews per month. In our office, you will enjoy of a relaxed environment and all kind of activities: conferences, workshops...</p><p>For being a part of our team you need:</p><p>- A great knowledge of Ruby on Rails (2-3 years).\n- To be used to version control system, preferrably Git.\n- Have experience with Capistrano.</p><p>We will love you if you:</p><p>- Are not afraid of getting your hands dirty with some system administration tasks.\n- Enjoy improving the performance of any application.\n- Have personal projects that you can show us.</p><p>If you are interested, send us your GitHub account and CV to empleo@playfulbet.com.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 41.3850639, 
        "location": "Barcelona, Spain", 
        "lon": 2.1734035, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995321", 
        "user": "cplanas"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">EARLY-STAGE EDUCATION STARTUP SEEKING COFOUNDER (or FREELANCER) in NYC, NEW YORK, REMOTE OK<p>I created <a href=\"http://www.learneroo.com\" rel=\"nofollow\">http://www.learneroo.com</a> to teach programming and more online. I'm looking for a Ruby on Rails and Javascript developer to help develop it further. Email me at ak [at] learneroo.com if interested.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995470", 
        "user": "arikrak"
    }, 
    {
        "address": "Columbia, MD, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "<font color=\"#000000\">Columbia, MD – H1B, FULL-TIME, INTERN<p>We're a small company in the Maryland suburbs transforming how states manage Medicaid information. This is an exploding niche and we have a bright future ahead of us but we need your help to build it!</p><p>We're looking for .NET software engineers with 'SOLID' C# skills and experience with ASP.NET MVC, NoSQL, HTML5, and JavaScript frameworks such as Knockout, Angular, or Durandal. Knowledge of domain-driven design, service-oriented architecture, and OO design patterns is a plus. Experience with RavenDB is a huge plus. If you don't know any of this stuff, that's fine too – just love to code in C#.</p><p>We have flexible working hours, a casual dress code, and you can work from home a day a week. We use the latest tools and all developers have an SSD in their machine.</p><p>E-mail questions, comments, or your resume to ubiquitous.croak@gmail.com.</p></font>", 
        "h1b": true, 
        "intern": true, 
        "lat": 39.2037144, 
        "location": "Columbia, MD", 
        "lon": -76.86104619999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995236", 
        "user": "ubiquitouscroak"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Work Market -- NYC and Huntington, NY (<a href=\"http://www.workmarket.com\" rel=\"nofollow\">http://www.workmarket.com</a>)<p>Looking for a great Test Engineer! \n<a href=\"https://www.workmarket.com/ats/view?id=54\" rel=\"nofollow\">https://www.workmarket.com/ats/view?id=54</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7143528, 
        "location": "New York", 
        "lon": -74.00597309999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995547", 
        "user": "workmarket"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\"><a href=\"http://techendo.co/\" rel=\"nofollow\">http://techendo.co/</a> --<p>also, if you want more traffic you can sign up and add your company to find and post jobs there.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995422", 
        "user": "lowglow"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Futureproof - London, UK - Full Time<p>Futureproof is an end-to-end, creative marketing agency currently growing its digital team. We are looking for a frontend developer (with PHP experience) to be the heart of our expanding department. To start immediately.</p><p>Full details of the role and our clients here: <a href=\"http://www.futureproof.co.uk/jobs/php-backendfrontend-developer/\" rel=\"nofollow\">http://www.futureproof.co.uk/jobs/php-backendfrontend-develo...</a></p><p>For more details, or to send CVs, email: jobs@futureproof.co.uk</p><p>We are also looking expand our pool of freelance developers, and occasionally take on interns, so do send us your details, if you're interested.</p></font>", 
        "h1b": false, 
        "intern": true, 
        "lat": 51.51121389999999, 
        "location": "London", 
        "lon": -0.1198244, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6996047", 
        "user": "tomfp"
    }, 
    {
        "address": "Mountain View, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Qubole - Mountain View, CA or Remote, Full time (H1B)\nAt Qubole we are building the next generation cloud based data management and processing platform. Our customers include some of the top advertising and media companies in the world.<p>We are looking for strong candidates who can work on our backend infrastructure. If your background includes \n- Building and operating large scale web services like search engines and advertising networks\n- Experience with building complex software systems like distributed databases and file systems or other distributed systems\n- Experience with virtualization and cloud technologies</p><p>If you think this is interesting and you would be a good fit please send us an email at jobs@qubole.com</p></font>", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.3860517, 
        "location": "Mountain View", 
        "lon": -122.0838511, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995977", 
        "user": "ssAtQubole"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Codero Hosting<p><a href=\"http://careers.stackoverflow.com/jobs/45026/cloud-developer-codero-hosting?a=SUEBeP1m&amp;searchTerm=Codero\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/45026/cloud-developer-...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995315", 
        "user": "twovi"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Frontend engineer, PlateJoy.com - FULL-TIME, Cambridge, MA. San Francisco, CA, or REMOTE<p>PlateJoy is a 500 startups-backed consumer technology company that is making it easier for people to eat healthy meals. We build personalized menus based on lifestyle and health goals and work with local grocers to deliver ingredients and recipes next-day.</p><p>We're growing quickly and looking for a passionate, smart frontend developer. A great candidate will have experience in:</p><p>* Backbone\n* Coffeescript (or at least JS and willing to learn Coffeescript)\n* Sass\n* Compass (and Susy)\n* Jasmine, chai, or other testing libraries\n* Photoshop experience\n* Experience working with designers (major plus if you have design chops yourself!)\n* Rails experience would also be a plus.</p><p>We are backed by great investors in Boston and San Francisco, and we've been recently featured in Tech Crunch, Fast Company, and the Boston Globe. If you are passionate about food and making the world a healthier place, please get in touch at jobs@platejoy.com. Thanks!</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=6995692", 
        "user": "platejoy"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">We've got 16+ openings, from Front End Developers to Ruby-on-Rails devs, Director of Development, QA Analysits, and an Outsourcing Project Manager.<p>You can see all the openings here: <a href=\"http://www.developwithpurpose.com/join-the-team/\" rel=\"nofollow\">http://www.developwithpurpose.com/join-the-team/</a></p><p>As an example, here is the Ruby-on-Rails posting:</p><p>----</p><p>Ruby on Rails DeveloperAPPLY NOW</p><p>Full Time\nBrentwood TN</p><p>What You'll Be Working On</p><p>We are now using Ruby on Rails to help people make REAL change in their life. We are seeking developers who are interested in building the right things and building the things right. If you like occasionally hearing how your code is used every day to take a family from desperation to HOPE, then sharpen that resume and apply.</p><p>WHAT WE'RE LOOKING FOR</p><p>Responsibilities</p><p>* Write application tier code, connecting UI to our backend and third party systems\n* Write front-end code in Ruby, HTML/CSS, and Javascript\n* Participate fully in our SCRUM planning and process\n* Utilize full Ruby on Rails ecosystem: gems, git, testing, PaaS\n* Work closely with, and incorporate feedback from, product management, interaction designers, and back-end engineers\n* Rapidly fix bugs and solve problems</p><p>Qualifications</p><p>* Demonstrable experience building world-class, consumer web applications\n* Expert programming skills in Ruby on Rails&lt;\n* Excellent Javascript/HTML/CSS/Ajax coding skills\n* Disciplined approach to unit and integration testing\n* Great written communication and documentation abilities</p><p>Desired Skills</p><p>* 3+ years of Ruby on Rails Development experience\n* Actively participating in the Rails community</p><p>Check out our tech stack: <a href=\"http://www.developwithpurpose.com/tech-stack/\" rel=\"nofollow\">http://www.developwithpurpose.com/tech-stack/</a></p><p>Who we DON'T want applying</p><p>Someone just looking for a j-o-b. Who will punch a clock and give the bare minimum to get a paycheck. Those who love Silos. We operate in a team environment and collaborate on a daily basis.</p><p>No Toadstools</p><p>Pushing the limits of technology is a part of the average work day. That means we expect our team members to push the envelope on their own skills as well. If you aren’t growing, you’re planting roots into your chair as the light from your screen transforms you into a toadstool… and well, who would want that!?</p><p><a href=\"http://www.developwithpurpose.com/join-the-team/opportunity/?ref=199000\" rel=\"nofollow\">http://www.developwithpurpose.com/join-the-team/opportunity/...</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Development, QA", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995229", 
        "user": "bejonbee"
    }, 
    {
        "address": "Houston, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">cPanel - Houston, Texas<p><a href=\"http://job.listings.cpanel.net/\" rel=\"nofollow\">http://job.listings.cpanel.net/</a></p><p>There are quite a few perl positions open in internal development, integration, systems development and product development.</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 29.7601927, 
        "location": "Houston, Texas", 
        "lon": -95.36938959999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995233", 
        "user": "libsysguy"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">IOS / Android Developer \n4- 5 years experience.\nLocation - New Jersey\nConsultant - Excellent rates for qualified Candidates\nVijay@sohosquaresolutions.com - Send resume please mention hackernews in subject line.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995307", 
        "user": "vijaymv_in"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">awe.sm (<a href=\"http://totally.awe.sm\" rel=\"nofollow\">http://totally.awe.sm</a>) - San Francisco, CA<p>We're seeking an DevOps Engineer to help us maintain the reliability of our core services, grow our engineering processes as we build new applications, and automate as much as possible.</p><p>We are a small, close-knit, and enthusiastic team of hackers building analytics that measure the ROI of social media.  Our engineering culture embraces data-driven decision making, failing fast, and abiding by the UNIX philosophy: building small, powerful tools with clean interfaces. Additionally, we live on our internal IRC server, relish an opportunity to discuss new technology, and have a bi-monthly board game night.</p><p>Learn more about us or apply at <a href=\"http://totally.awe.sm/jobs\" rel=\"nofollow\">http://totally.awe.sm/jobs</a></p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995024", 
        "user": "bennetthi"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">Sr. Java developer - Newark/ NJ\nLooking for Senior Java developers\nplease mention hackernews in subject and send resumes to vijay@sohosquaresolutions.com with contact information.</font>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995311", 
        "user": "vijaymv_in"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "<font color=\"#000000\">OAuth.io, a better OAuth for a better Web<p>- 1 Developer evangelist in US (Based in SF)</p><p>- 1 Developer Evangelist in Europe (Based in Paris)</p><p>If you love making friends, inspiring people to build things, coding (of course) and helping others to make stuff, contact team@oauth.io</p></font>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=6995364", 
        "user": "apiapi"
    }
]