[
    {
        "address": "Stockholm, Sweden", 
        "country": "SE", 
        "freshness": true, 
        "full_html": "Linnarsson lab, Karolinska Institutet | Stockholm, Sweden [ ONSITE<p>I&#x27;m a full professor of molecular neuroscience, leading a group of ten people (PhD students, postdocs). We use single-cell RNA sequencing to discover and understand all the cell types of the mouse brain. We have published very well (Science, Nature, etc) and have just been funded to map every cell type in the mouse nervous system. This is an incredibly exciting project: for the first time, we will be able to say exactly what types of cells exist in every brain region, and which genes are specifically active in those cells. We have great funding for the next five years.<p>Now, I&#x27;m looking for a front-end programmer with some back-end skills to help build a data portal to share our data with the scientific community.<p>* Work in our team in Stockholm, Sweden<p>* Work with people from all over the world (English is our working language)<p>* Help us do groundbreaking science!<p>* Ok salary, great Swedish employment benefits<p>We&#x27;re looking for someone who can build an UI, with tools for visualising and browsing a very large and complex dataset. We think you love making data pretty! Currently, we use<p>* Python for the back-end and tools<p>* React and D3 for the front-end<p>Check out our work at linnarssonlab.org and github.org&#x2F;linnarsson-lab<p>Interested? Contact me at sten.linnarsson@ki.se!<p>Thanks,<p>Sten", 
        "h1b": false, 
        "intern": false, 
        "lat": 59.32932349999999, 
        "location": "Stockholm, Sweden", 
        "lon": 18.0685808, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822449", 
        "user": "stenl"
    }, 
    {
        "address": "San Mateo, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Tachyus - San Mateo, CA - many open positions\nWe are revolutionizing the oil and gas industry, well funded, and (most importantly) producing significant revenue. This is the opportunity for the right people to align with us and share in ownership. We are a focused science and engineering driven team working with real physical devices and processes measuring and analizing the natural world. We take our Values statement seriously, so read it first and decide. <a href=\"http:&#x2F;&#x2F;www.tachyus.com&#x2F;joinus&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tachyus.com&#x2F;joinus&#x2F;</a><p>As a technology company, our long-term success is dependent on the skill and alignment of our engineering team. We develop new software and hardware and rely on our engineers to bring the company&#x27;s vision to fruition. Every engineer has the opportunity to make huge product contributions and has a responsibility to promote internal collaboration and adherence to best practices.<p>Software Engineer - DEVOPS<p>Our core physics and data science algorithms (what we call “Data Physics”) are written in a combination of Python and Matlab. Tachyus data physics algorithms solve large scale, difficult oil field problems using highly parallelizable, dynamic computation environments. The algorithms are typically developed on a Windows architecture but scale out to many Linux-based instances for deployment. These algorithms integrate with a full stack web environment running in F# and Typescript, which is deployed to Microsoft Azure and Google cloud environments. Both environments operate in parallel. We seek engineers who are excited to work on dynamic allocation of computation resources, efficient operations, and cloud-scale operations.<p>Correctness (QA) Engineer<p>The Tachyus Correctness Engineer is a Software Engineer who specializes in building the infrastructure to prove our software and algorithms produce accurate results. The CE works closely with the Software and Science organizations to prevent, catch, prioritize and eliminate errors in both software and data. Correctness Engineering is also intimately involved in continuous Integration and release management. He or she is an engineer at heart, preferably with experience writing production code.<p>Many more positions in software,petroleum engineering, and business", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.5629917, 
        "location": "San Mateo, CA", 
        "lon": -122.3255254, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823372", 
        "user": "jackfoxy"
    }, 
    {
        "address": "Portland, OR, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "ImpactFlow — Portland, OR. Onsite — Full Stack Engineer\nNonprofit-giving startup seeks a full stack engineer to join our product development team. You will work with a small cross-functional group of engineers to develop features for our SaaS web application&#x2F;platform.<p>Responsibilities:<p>- Build features on the platform<p>- Write tests for everything you build<p>- Collaborate with product stakeholders to shepherd products through development<p>- Participate and contribute in code reviews and design discussions<p>- Lead effort to build and deploy cool things<p>Learn more about the position and how to apply: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;borbyu&#x2F;d92b23bfc4e929a45c93\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;borbyu&#x2F;d92b23bfc4e929a45c93</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 45.5230622, 
        "location": "Portland, OR", 
        "lon": -122.6764816, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823308", 
        "user": "lochlan"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Square: Developer Platform Engineers (server and mobile) | ONSITE: San Francisco | VISA<p>Note: other teams are hiring (NYC, Atlanta, Toronto) but I&#x27;m posting for my particular team: Developer Platform.<p>- Help us (tiny team, will grow and add responsibility) build the product and infrastructure for millions of merchants.<p>- APIs and SDKs for eCommerce and the Register point of sale<p>- Make it easy, scalable, and consistent to expose Square&#x27;s products to external developers<p>- App Marketplace<p>- Architecture, availability, growth, and scalability of all public APIs<p>- Mobile and Server side areas of focus<p>- Junior and more Senior people welcome to apply<p>Lear more and apply (mention &#x27;hacker news&#x27;) <a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?c=q8Z9VfwV&amp;page=Job%20Description&amp;j=oeM61fwR\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?c=q8Z9VfwV&amp;...</a><p>Or ping me on twitter @jawspeak", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823346", 
        "user": "jawspeak"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Notable Labs (YC W15) | <a href=\"https:&#x2F;&#x2F;notablelabs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;notablelabs.com</a> | San Francisco, CA | Full Time | Onsite<p>Changing the way cancer is treated is our personal mission, which starts with putting patients first. We’ve developed an individualized laboratory testing service for cancer patients and their doctors. We screen thousands of FDA-approved drugs against the patients own cancer cells to identify drug\ncombinations that can be immediately prescribed by their doctor without a clinical trial. By repositioning treatment as a patient-centered service we can unlock the power of modern data science and laboratory automation to achieve the promise of combination therapy and personalized medicine.<p>== Looking for ==<p>We&#x27;re looking for a full stack developer to build out the stack powering our robotic lab. You&#x27;d join as the third engineer and would own the frontend dashboards and related API&#x27;s.<p>The day to day work would involve designing web apps with the science team for use in the lab and then building out the frontend code and backend API&#x27;s. Beyond the core infrastructure, you&#x27;d have the freedom to explore new areas where we need help such as machine learning, robotic automation, and data visualization.  Experience with Ruby&#x2F;Python, Angular&#x2F;Backbone&#x2F;React, Grunt&#x2F;Gulp, API design a plus.<p>== Tech Stack ==<p>Ruby&#x2F;Rails for automation API&#x27;s, Angularjs frontend, Python for data analysis, AWS and with Chef<p>== Contact ==<p>jobs@notablelabs.com, mention Hacker News", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823155", 
        "user": "connor"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Uber Technologies | San Francisco &amp; NYC | Full-time | Engineering (full-stack, all levels), Product Managers, Design, Data Analysts<p>Come help build the future of transportation! We&#x27;re hiring across the board, learn about the positions here: <a href=\"https:&#x2F;&#x2F;www.uber.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs</a><p>Reach out at ngoel@uber.com with your resume if you&#x27;re interested!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823349", 
        "user": "ngoel36"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Weft - <a href=\"http:&#x2F;&#x2F;weft.io\" rel=\"nofollow\">http:&#x2F;&#x2F;weft.io</a> - Cambridge&#x2F;Boston, MA -- ONSITE<p><pre><code>     ******************\n     === What we do ===\n     ******************\n</code></pre>\nWe&#x27;re building skynet (except we&#x27;re focusing 100% on logistics, less so on the murder part) -- we track every boat on the water, every plane in the sky, and pretty much everything else that moves in the supply chain (all the way down to the container&#x2F;pallet level) so we can make predictions about what&#x27;s going to happen!<p>We help solve problems like the multi-billion dollar asset repositioning problem (people literally ship empty containers to try to meet customer demand) and answer questions like is the port of long beach about to go on strike, is my shipment going to get stuck in customs, and who&#x27;s the best person to ship with between point A and B (among a bunch of other things)?<p><pre><code>     ******************\n     === Crib notes ===\n     ******************\n</code></pre>\n- Clojure, Clojurescript, Javascript, Python&#x2F;PySpark, React&#x2F;re-frame, we even have a couple services in Scala<p>- Spark, postgres, redis, kafka, accumulo, docker<p>- We have one of the world&#x27;s experts in Deep Learning on our team<p>- We&#x27;re funded by top-tier VCs<p>- We have paying customers across multiple verticals<p>- We eat + drink together a lot... wino wednesday, whiskey thursday, foodie friday<p><pre><code>     *******************\n     === Looking for ===\n     *******************\n</code></pre>\n- Front end tech lead (starting to play with clojurescript, though I guess that&#x27;d be your choice!)<p>- Data engineer<p>- Firmware engineer (MSP430, WOO!)<p>If this sounds interesting, please shoot us an email at jobs@weft.io! Tell &#x27;em Marc sent you.", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822120", 
        "user": "speek"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Avaaz Foundation | full-time | REMOTE<p>We&#x27;re a global activism organization, dedicated to effecting positive change in the world. We tackle such issues as climate change, poverty, and corruption. For more information, check here: <a href=\"http:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;about.php#howwework\" rel=\"nofollow\">http:&#x2F;&#x2F;www.avaaz.org&#x2F;en&#x2F;about.php#howwework</a><p>We are in the process of extracting a services-based architecture from a large legacy php codebase. We primarily use python for new systems. We operate at &quot;big data&quot; scale, with 40+ million members, and hundreds of millions of events per month.<p>We value professionalism, autonomy, and healthy work-life balance.<p>We are looking for:<p>- Senior Data Scientist <a href=\"https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0h1tp\" rel=\"nofollow\">https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0h1tp</a><p>- Senior Full-Stack Software Developers: <a href=\"https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0ywj\" rel=\"nofollow\">https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0ywj</a><p>- Dev Ops Engineer <a href=\"https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0hipk\" rel=\"nofollow\">https:&#x2F;&#x2F;avaaz22194.recruiterbox.com&#x2F;jobs&#x2F;fk0hipk</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822881", 
        "user": "nomadicactivist"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Get Lighthouse | <a href=\"http:&#x2F;&#x2F;getlighthouse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;getlighthouse.com</a> | San Francisco, CA | Full Time | ONSITE<p><pre><code>    === What we do ===\n</code></pre>\nIf you&#x27;ve ever worked at a painfully dysfunctional startup, or a big company wrecked by politics &amp; clueless managers, you&#x27;ve experienced how bad management can make a good job miserable. We&#x27;re changing that by helping managers with the fundamental habits of good management.<p>We&#x27;re starting with facilitating better 1-on-1s through software, which help you be happier, and more productive when done right. (@RoidRage blogged about how we helped him at Travis-CI: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;LHpraise\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;LHpraise</a>)<p>Lighthouse is profitable, bootstrapped, and generating hundreds of leads a month. I&#x27;m looking for someone to take over all things tech at Lighthouse, so that I can focus on making us more money by attracting and closing even more customers.<p><pre><code>    === You are ===\n</code></pre>\n- Player&#x2F;Coach interested in helping build and manage a team<p>- An engineer that cares about design and the little details that delight customers<p>- Looking to get in on the ground floor of a high potential startup (ie- lots of upside&#x2F;equity!)<p><pre><code>    === Tech Stack ===\n</code></pre>\n- Currently Rails, Capistrano, haml&#x2F;scss, bootstrap, jQuery, Postgres, Stripe, GCal API<p><pre><code>    === Interested? ===</code></pre>\n- Email Jason at GetLighthouse dot com mentioning Hacker News in the subject line.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822512", 
        "user": "jevanish"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Positions:\n  Backend Developper (Erlang, C, C++) - Montreal, Canada (ONSITE)\n  Rails Application Developer (Ruby, PostgreSQL) - Montreal, Canada (ONSITE)<p>AdGear is a digital advertising technology company providing platforms and services for digital media innovators such as publishers, advertisers and media agencies. We operate a full-stack advertising platform enabling our customers to innovate with formats, audience data, reporting, pricing and distribution strategies.<p>For more information, complete description of roles, and details on applying, please see <a href=\"http:&#x2F;&#x2F;adgear.com&#x2F;company&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;adgear.com&#x2F;company&#x2F;careers&#x2F;</a><p>Please make sure to CC lp at adgear.com with your email to jobs at adgear.com so we know you&#x27;re from HN :)", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823160", 
        "user": "lpgauth"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "London, UK | ONSITE | Full time | Frontend web dev<p>Boiler Room is the world’s leading community of underground music fans. We live-stream DJ sets and live gigs from music hubs such as London, Berlin, New York, Paris, LA and &gt;60 other cities to music lovers all over the world. It started as a webcam taped to a warehouse wall in East London - in five years Boiler Room has grown to become the online home of underground music, and also a complex broadcasting and editorial platform in its own right.<p>We are currently in the process of building the next generation of the web app powering Boiler Room. We have upwards of a million views on our site a month, and that’s not including the hundreds of millions of views that our videos have accumulated on YouTube and Dailymotion. We want to create a completely unique web experience that lives up to the quality of our live shows. To do that we need someone who knows their way around the wonderful mess that is front-end web development, and truly cares about the experience that music lovers will have while using our web app on all kinds of devices.<p>You’ll be an essential part of a dev team currently consisting of 2 developers and 2 designers. You should have strong opinions about how web development should be done in 2015, and you should be able to come up with and implement new ideas for consuming &amp; sharing online music experiences. You&#x27;ll be working in our river-side office in Wapping, East London, and you’ll of course be able to go to and invite your friends to the exclusive parties being live-streamed on the site.<p>Our frontend stack: React, Redux, ImmutableJS, Gulp, Webpack, Babel, CSSNext<p>If this sounds like your kind of jam, email our tech lead (lachenmayer) &lt;harry.l+hn@boilerroom.tv&gt; or drop me a line &lt;ben.jeffrey+hn@boilerroom.tv&gt;", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822817", 
        "user": "jeffbr13"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Semaphore CI | Europe | Full-time | REMOTE<p>Looking for senior software engineers into Ruby, Elixir, microservices and high scalability.<p>We’re on a mission to change how developers test and deliver software. Our way is to double down on great user experience and high performance, treat our customers as we’d like to be treated, and make continuous delivery practices more accessible to developers. CoreOS, 500px, Lexmark, General Assembly and many others use Semaphore (<a href=\"https:&#x2F;&#x2F;semaphoreci.com&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;semaphoreci.com&#x2F;about</a>).<p>Apply at: <a href=\"https:&#x2F;&#x2F;renderedtext.workable.com&#x2F;jobs&#x2F;163809\" rel=\"nofollow\">https:&#x2F;&#x2F;renderedtext.workable.com&#x2F;jobs&#x2F;163809</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10823282", 
        "user": "markoa"
    }, 
    {
        "address": "Calle Toronto, Guadalajara, Jal., Mexico", 
        "country": "MX", 
        "freshness": true, 
        "full_html": "Amazon Flex | Seattle, Toronto, Phoenix, Austin [All ONSITE] | SDEs, Interns, SDETs | <a href=\"https:&#x2F;&#x2F;flex.amazon.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;flex.amazon.com&#x2F;</a><p><i>I&#x27;m an SDE on a Toronto-based team. This whole org is still being bootstrapped, and we need to hire more talented developers.</i><p>Amazon’s new delivery platform, Amazon Flex, aims to delight customers by delivering millions of packages faster than ever before. We are expanding our platform rapidly to new geographies and products from groceries to big-screen TVs in an increasingly complex transportation network.<p>Our Transportation Technology group is responsible for designing and implementing software that makes the delivery of these items possible in one hour or less. We are building software that predicts, plans, schedules, routes and executes on the speedy delivery promise in a cost effective manner.<p>Software at Amazon is typically &quot;use whatever works best&quot;, but so far my corner of Flex has mostly been AWS and Java 8.<p>You can apply directly online:\n<a href=\"http:&#x2F;&#x2F;www.amazon.jobs&#x2F;results?jobCategoryIds[]=70&amp;searchStrings[]=Flex\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.jobs&#x2F;results?jobCategoryIds[]=70&amp;searchStr...</a><p>Or send me an email- my username @ amazon.com. I&#x27;m happy to answer any questions, and forward resumes off to the managers&#x2F;recruiting for a specific area you&#x27;re interested in.", 
        "h1b": false, 
        "intern": true, 
        "lat": 20.7001861, 
        "location": "Seattle, Toronto,", 
        "lon": -103.3871606, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822116", 
        "user": "mabbo"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Vidados | <a href=\"https:&#x2F;&#x2F;www.vidados.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vidados.com</a> | London, UK | Full Time | Onsite | Front end designer &#x2F; developer<p>Around the world, many small businesses offer amazing activity holidays in great locations.  Think wine-tasting in Bordeaux, surfing in Morocco, cookery in Tuscany.  Due to their activity and their personal nature, these holidays do not fit into the standard package holiday systems.<p>Vidados is aiming to provide the tools to help these holiday providers fly.  Starting with an online marketplace at www.vidados.com but progressing to bookings through all channels, email marketing, inventory management and much more.<p>We already have a beautiful, functional, responsive front end but there is so much more we want to do, so we are looking for an in-house designer &#x2F; CSS developer to help us do it.<p>You should:<p>- have a great eye for design and feel for usability<p>- understand HTML and CSS and be able to turn your concepts into reality<p>- either be competent with JavaScript or at least have an idea for what is possible with it<p>We are an angel-funded startup but we already have a year of real revenue and growing traction.  We have ideas coming out of our ears and are a very friendly bunch and it&#x27;s really a great place to work.<p>If this sounds interesting to you please contact gareth[at]vidados[dot]com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823210", 
        "user": "thackerhacker"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "SpatialKey | spatialkey.com | REMOTE | Full-time<p>Front-end Developer<p>SpatialKey is hiring a Front-end Developer to join our small team. We’re a group of about 20 people, all remote, about half of that is dev. We’re looking for a solid front-end developer who can help us build the next generation of our platform. SpatialKey is a mapping and data-vis app, targeting the insurance industry. We can tell an insurance company how many buildings they have in the path of an oncoming hurricane, or what the flood risk is at a given location, or how much damage the worst theoretical tornado strike can do to their portfolio.<p>Historically we’ve had a large codebase built on Adobe Flex. We’re in the process of rebuilding the next version in HTML, with React&#x2F;Flux as the primary framework. You would be heavily involved in that new HTML&#x2F;JS development. Experience developing and shipping complex enterprise HTML&#x2F;JS apps in a team environment is a must. Solid knowledge of CSS, JS fundamentals, Node and npm as dev tools, etc. Prior work with React would be nice but is not required.<p>We’re a fully self-funded profitable company. We haven’t taken a dime in VC funding and are growing based on the old fashioned idea that we produce valuable software and we sell that software for money (imagine that!). No advertising, no fake it till you make it Silicon Valley BS. We’ve been around for 8 years and have an extremely stable customer base and growth prospects. We’re proud of what we build and stand behind quality software.<p>To apply email jobs@spatialkey.com or email me directly at doug.mccune@spatialkey.com. We’ll have an official job posting online soon, but for now shoot us an email and say hi. We&#x27;re fully remote but it&#x27;s a lot easier for us to hire candidates in the USA.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10823201", 
        "user": "dougmccune"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Phylagen (<a href=\"http:&#x2F;&#x2F;phylagen.com\" rel=\"nofollow\">http:&#x2F;&#x2F;phylagen.com</a>) | San Francisco | onsite<p>We are adding a new team member at Phylagen, Inc (phylagen.com). If you know a software engineer who fits, please direct them to jobs@phylagen.com.<p>We are an energized team developing microbiome data analytic tools and bioinformatics pipelines that are being applied to a wide range of environments. We plan to bring on an innovative coder - with a B.S. or M.S in computer science, engineering, statistics, or bioinformatics (translating to 4-5 years software engineering experience). We want someone deeply knowledgeable in algorithm optimization, including parallelization, distributed execution and implementing methods. The position will entail combining code and data from different disciplines, translating and optimizing published research algorithms (e.g. created in R&#x2F;Python&#x2F;Julia) into industry products, and creating reference databases that can be used in machine learning applications. Expertise in the analysis of metagenomics data and bioinformatics pipelines is a bonus. We are looking someone who is flexible - a fast learner with relevant experience that will allow them to contribute quickly. You will be a key player in a cutting edge, rapidly growing venture-backed microbiome startup.<p>Phylagen harnesses the vast, unseen world of microbes to improve our daily lives. The microbiome - the trillions of interacting bacteria, fungi, algae and viruses that inhabit every inch of our world - is the most complex, untapped dataset on earth. We combine advanced DNA sequencing and bioinformatic analytics with scalable, high performance computing to analyze the microbiome in ways previously not possible. This enables us to determine and interpret complex genetic signatures and provide a powerful new decision-making tool for businesses.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823015", 
        "user": "jlgreen"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Sentry | <a href=\"http:&#x2F;&#x2F;getsentry.com\" rel=\"nofollow\">http:&#x2F;&#x2F;getsentry.com</a> | Full-time in San Francisco<p>Come help us develop our open source exception monitoring service: <a href=\"http:&#x2F;&#x2F;github.com&#x2F;getsentry&#x2F;sentry\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;getsentry&#x2F;sentry</a>.<p>Sentry is a small team (just 7 people) with a beloved product, a long list of notable customers, strong and growing revenue, and a commitment to open source. This is a really good time to be a part of what we&#x27;re building.<p>We&#x27;re especially interested in polyglot programmers who can help us develop our core product in Python and JavaScript, but also work on new client integrations for platforms like .NET and iOS.<p>Full list of roles is available here: <a href=\"http:&#x2F;&#x2F;getsentry.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;getsentry.com&#x2F;jobs</a>, or reach out to me directly to find out more: ben (at) getsentry.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822981", 
        "user": "bentlegen"
    }, 
    {
        "address": "Redwood City, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "AltspaceVR | Software Engineers | Redwood City, CA | Onsite | Full-time | Permanent eligibility to work in US required | Virtual reality, Unity, Rails, HTML5, React, ES6, WebGL, three.js<p>About us: <a href=\"http:&#x2F;&#x2F;altvr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;altvr.com</a><p>Open positions: <a href=\"http:&#x2F;&#x2F;jobs.altvr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.altvr.com</a><p>Our team: <a href=\"http:&#x2F;&#x2F;altvr.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;altvr.com&#x2F;team</a><p>WHO WE ARE:<p>- AltspaceVR is a virtual reality software company building a platform for communication in VR.<p>- Backed by some of the best investors on the planet (<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1EEqFsw\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1EEqFsw</a>)<p>- With a team that is passionate about the future of VR.<p>WHAT WE BELIEVE:<p>- VR will be for everyone.<p>- The social connection enabled by VR will change your life (and we can show it to you.)<p>- We should embrace everything that is great about the 2D web.<p>- That we can and will invent the 3D web.<p>For more info: <a href=\"http:&#x2F;&#x2F;altvr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;altvr.com</a> For open positions: <a href=\"http:&#x2F;&#x2F;jobs.altvr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.altvr.com</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.48521520000001, 
        "location": "Redwood City, CA", 
        "lon": -122.2363548, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822923", 
        "user": "ro_bo"
    }, 
    {
        "address": "Troon, South Ayrshire, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Troon, Scotland | REMOTE | Rust Engineer<p>Help us build and maintain the SAFE Network: <a href=\"http:&#x2F;&#x2F;maidsafe.net&#x2F;rust_engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;maidsafe.net&#x2F;rust_engineer.html</a><p>The SAFE (Secure Access For Everyone) Network is made up of the unused hard drive space, processing power and data connection of its users. It offers a level of security and privacy not currently available on the existing Internet and turns the tables on companies, putting users in control of their data, rather than trusting it to organisations.<p>MaidSafe&#x27;s aim is to provide privacy, security and freedom to everyone on the planet. This has been our unwavering ambition since we started on this journey in 2006, and it remains our driving force today.<p>We are an eclectic and multicultural group of passionate and focussed individuals determined to release great software that has a hugely positive impact on the world. If you would like to help, please send your CV along with a covering letter detailing why you are a great fit for any of our open positions to: careers@maidsafe.net and we will get back to you as soon as we can.", 
        "h1b": false, 
        "intern": false, 
        "lat": 55.541332, 
        "location": "Troon, Scotland", 
        "lon": -4.659948, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822855", 
        "user": "frabrunelle"
    }, 
    {
        "address": "Calgary, AB, Canada", 
        "country": "CA", 
        "freshness": true, 
        "full_html": "MethodExists | Calgary, AB | Full-time | REMOTE | Backend developer with great SQL &#x2F; Postgres experience<p>We are a Canadian company based in Calgary, but completely Remote, with developers all over the world. We are developing a universal web-based platform that can be customized for any industry. It is structured to allow non-technical people to edit everything from data model to forms and workflows and visualizations.<p>Some of the problems we&#x27;re tackling: \n- universal and safe formula language that&#x27;s easier than Excel&#x27;s.\n- spinning up new sites instantly and allowing them to be hosted behind corporate firewalls\n- visual form and report editors \n- allowing business analysts to change data model live with zero downtime migrations<p>Some technologies we are using to achieve this:\n- Javascript, node.js, React, D3.js, Leaflet\n- Docker, Rancher\n- Postgres, Redis, RabbitMQ<p>We are using Phabricator for project management, planning and code reviews.  Communication happens through Slack and Google Hangouts. You should have an adequate intersection with UTC-7 and remote work experience!  English is the language of communication, and quality communication is highly important. We write unit tests, lint, and continuously integrate with TeamCity. We are using all the best tools and philosophies to write high-quality code and automate and monitor delivery.<p>As we are Remote we do meet up from time to time, last time we met up to surf and hack in the Dominican Republic.  Hired candidates will need to travel to meet teammates.<p>Your job will be writing backend APIs and coming up with the best SQL queries. You should know your database inside out, we are talking about automated migrations and deep schema analysis.  You should also have a good idea about proper configuration, security and monitoring of the db cluster.<p>We offer a paid trial to prospective candidates, which are about deep immersion with the team, working completely integrated in the process. Your code will be reviewed by team-mates just like everyone else&#x27;s does every time. This is about ensuring a good fit with team members and good productivity and understanding of our philosophy.<p>Please write to us and sell us on why you’re the right candidate.  We don’t enforce a certain way of applying like CVs, so communicate in the way that best describes your value.<p>jobs@methodexists.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.0486151, 
        "location": "Calgary, AB", 
        "lon": -114.0708459, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822828", 
        "user": "mkrn"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Plecto (<a href=\"http:&#x2F;&#x2F;www.plecto.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.plecto.com</a>) • ONSITE &amp; REMOTE (EU) • Back-end Developer • Full-time<p>Help us create a fun working environment for sales people around the world. We are building a dashboard and gamification platform that allows sales people to keep track of their performance as if it was a sports game.<p>We&#x27;re working with AWS, DynamoDB, Elastic Search, Python and Django. If you&#x27;re keen on working with those technologies, we would love to hear from you.<p>Just mail me at kristian@plecto.com or read more here: <a href=\"https:&#x2F;&#x2F;www.plecto.com&#x2F;en&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.plecto.com&#x2F;en&#x2F;jobs&#x2F;</a><p>We&#x27;re also happy to take interns on top of the position above.", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822196", 
        "user": "oellegaard"
    }, 
    {
        "address": "Seattle, WA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Convoy | <a href=\"https:&#x2F;&#x2F;convoy.com\" rel=\"nofollow\">https:&#x2F;&#x2F;convoy.com</a> | Seattle, WA | Relocation | ONSITE | INTERNS<p>Javascript, Node.js, React, React Native, Redux, iOS, Android. Frontend, Backend, Mobile.<p>We&#x27;re optimizing the trucking and logistics industry; automating what is, today, a $749B industry that still runs on fax machines and phone calls. Currently backed by top tier investors. Read about us: <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convoys-plan-to-streamline-freight-operations&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convo...</a><p>I&#x27;m employee #3 at this company, having worked at big companies like Google and small startups before I can say I&#x27;ve never had a bigger opportunity for success than this.  The team of engineers are smarter than any team I&#x27;ve ever been on, I&#x27;m growing as an engineer and leader every day, the problems we are solving are very real and we are impacting peoples lives every day. I couldn&#x27;t ask for a better situation!<p>Software engineers &#x2F; Designers &#x2F; Sales &#x2F; Operations. Engineering positions available:<p>•  Front-end engineer - Live and breathe JavaScript, HTML, and CSS? Come work on our single-page app using React and redux!<p>•  Mobile engineer - We have Android and iOS apps, and we’re interested in people competent in either native or react-native mobile development (both is a huge plus). These are beautiful, bulletproof apps that solve real-world problems for truck drivers and carriers.<p>•  Back-end engineer - We’ve got some fun CS problems to solve around route optimization and market making, plus working on the API that connects all these clients.\nIf you’re a high-performing engineer but don’t have one of these specific tools on your belt, we’d still love to talk. We trust awesome people to learn the tech!<p>If you&#x27;re in Seattle (or willing to relocate) and looking to be on a small team where you can have a huge impact, email me at jonathan@convoy.com or check out our jobs page <a href=\"https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs</a>", 
        "h1b": false, 
        "intern": true, 
        "lat": 47.6062095, 
        "location": "Seattle, WA", 
        "lon": -122.3320708, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822664", 
        "user": "jastanton"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "Haplo -- London, UK -- Full time, ONSITE<p><a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs</a><p>Would you like to write high quality open source software, for users in universities who love your work?<p>We&#x27;re looking for developers to join our team, especially those who are early on in their career and would like to work in an environment which will support their learning.<p>Our only recruitment criteria is whether you understand how computers work and can write good code, and if you can work in a diverse team.<p>The Haplo platform is open source, and we&#x27;re working on open sourcing everything else we do: <a href=\"http:&#x2F;&#x2F;haplo.org\" rel=\"nofollow\">http:&#x2F;&#x2F;haplo.org</a><p>On top of the platform, we&#x27;ve built a suite of products for higher education, and are rolling them out to universities across the UK. Our flagship product is PhD Manager: <a href=\"http:&#x2F;&#x2F;www.phd-manager.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;www.phd-manager.co.uk</a><p>Like a startup: Small dedicated team. No barriers to doing your best work. Opportunity to get involved with everything, should you want to. Lovely office, great espresso. Ambition to change the world in a small but significant way.<p>Not like a startup: Sensible working hours. Quiet environment away from the hustle. No random pressure from investors. Quality product without hacks.<p>Fast recruitment process: Email us your CV. 20 minute phone call. Spend a few hours on a short coding challenge. Visit us for an in-depth code review and interview.<p>Join us! <a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;about&#x2F;who\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;about&#x2F;who</a><p><a href=\"http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.haplo-services.com&#x2F;jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822367", 
        "user": "bensummers"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Take a stab at our little challenge and ensure your CV gets reviewed by our team: curl <a href=\"http:&#x2F;&#x2F;challenge.shopcurbside.com\" rel=\"nofollow\">http:&#x2F;&#x2F;challenge.shopcurbside.com</a>\nCurbside is enabling a new way to shop, built for the era of instant mobile commerce. The Curbside app makes it easy to find, buy and pickup products at nearby stores. Curbside searches realtime local inventory across retailers and uses location-based technologies to alert stores when a customer is arriving for a pickup. Curbside helps consumers quickly get what they need and helps retailers better serve their increasingly mobile centric customers. The Curbside Merchant Console enables alerts to staff as customers arrive to pick up orders and also manages online order workflow.<p>Curbside’s investors include Sutter Hill Ventures, Index Ventures, Jerry Yang’s AME Cloud Ventures, Qualcomm Ventures, Eric Schmidt’s Innovation Endeavors, O’Reilly AlphaTech Ventures, Gil Elbaz &amp; David Waxman’s TenOneTen and Chicago Ventures.<p>Tech Stack: Clojure, Python, Javascript, iOS, Android, Elasticsearch<p>Problem space: mobile commerce, big data, search, machine learning, reverse engineering, distributed systems, location services, user experience.<p><a href=\"http:&#x2F;&#x2F;www.shopcurbside.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.shopcurbside.com&#x2F;jobs</a> • Palo Alto, Ca. • Relocation Available • Sorry at this time we cannot sponsor NEW H-1B’s, but we can transfer existing visa’s and sponsor new E3’s, TN’s, and O-1’s.", 
        "h1b": true, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823022", 
        "user": "curbside"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Doximity (<a href=\"https:&#x2F;&#x2F;www.doximity.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.doximity.com</a>) - San Fransisco, CA - Remote or Onsite - Permanent - Full Time<p>Ruby on Rails engineers, preferably full stack and helps to have experience in Go and JavaScript.\n<a href=\"https:&#x2F;&#x2F;doximity.theresumator.com&#x2F;apply&#x2F;jobs&#x2F;details&#x2F;I4u6BD\" rel=\"nofollow\">https:&#x2F;&#x2F;doximity.theresumator.com&#x2F;apply&#x2F;jobs&#x2F;details&#x2F;I4u6BD</a><p>Doximity&#x27;s passion for working with physicians is what helped us grow to No 1. We believe that when doctors are connected, patients benefit and the medical sector works better. Listening to what physicians need and then building simple tools to solve complex problems is what we do. Our vision is a future where medical communication is effortless — fast, simple, seamless and secure.<p>Doximity is made of developers, doctors, scientists, start-up founders, non-profit founders, ping-pong players, professional waterskiers. We&#x27;re diverse - in fact, we&#x27;re multilingual. Ruby is our preferred language, of course. While we&#x27;re already the No. 1 network for physicians, we&#x27;re not even close to being done with our goals.<p>We talk about our technology on our blog:<p>Engineering Stack: <a href=\"https:&#x2F;&#x2F;engineering.doximity.com&#x2F;pages&#x2F;engineering-stack\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.doximity.com&#x2F;pages&#x2F;engineering-stack</a><p>On-boarding: <a href=\"https:&#x2F;&#x2F;engineering.doximity.com&#x2F;articles&#x2F;software-engineering-on-boarding-at-doximity\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.doximity.com&#x2F;articles&#x2F;software-engineeri...</a><p>Automating Workflows: <a href=\"https:&#x2F;&#x2F;engineering.doximity.com&#x2F;articles&#x2F;automating-workflows\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.doximity.com&#x2F;articles&#x2F;automating-workflo...</a><p>I&#x27;m involved in the hiring process, reach out to me on LinkedIn (<a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;jeybalachandran\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;jeybalachandran</a>) or via e-mail at jbalachandran@doximity.com. You won&#x27;t be talking to any recruiters :)<p>Happy New Year,<p>Jey Balachandran", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Fransisco, CA", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822571", 
        "user": "jeybalachandran"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Pavlok | <a href=\"http:&#x2F;&#x2F;buy.pavlok.com\" rel=\"nofollow\">http:&#x2F;&#x2F;buy.pavlok.com</a> |  Boston, MA | Full Time | Onsite or Remote<p>== We are ==<p>At Pavlok, we&#x27;ve invented a wearable device that helps users break bad habits --- using haptic feedback. Pavlok vibrates, beeps, and releases mild electric stimuli we call &#x27;zaps&#x27; that help a user create a Pavlovian aversion to bad habits.<p>It works manually (pressing a button) or automatically (a Chrome extension that zaps when I go on bad websites, an alarm clock that zaps the user if he hits a snooze button, etc).<p>== You are ==<p>* Full stack developer\n* Experience in Rails, Android, iOS, and&#x2F;or Node\n* An A+ player\n* You care about self improvement and want to make yourself better<p>Your Mission:<p>To build web products and features that help Pavlok users build good habits and break bad ones.<p>Role Outcomes:<p>Audition - Write a simple script&#x2F;app that uses the Pavlok module to integrate with some 3rd party API service.<p>14 Day - Will have coordinated with design to develop multiple features and bug fixes. Finish getting IFTTT up and running with senior contract developer. Will have adopted Pavlok’s git workflow and TDD methodology. At least 1 commit &#x2F; hour. Dev ops<p>1 Month - Deliver four builds to QA, maintain and build out our api and develop our unified push for Pavlok customers.<p>3 Month - Build a developers platform for other developers to build applications with Pavlok. Maintain high output while pairing with junior teammates.<p>email daniel.rondeau@pavlok.com and mention HN in the subject", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822674", 
        "user": "maneesh"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Airtable — San Francisco, CA (ONSITE; FULL-TIME)<p><a href=\"http:&#x2F;&#x2F;airtable.com\" rel=\"nofollow\">http:&#x2F;&#x2F;airtable.com</a><p>Airtable&#x27;s mission is to expand human productivity by letting people create tools to organize their world. Unlike single-purpose apps, we think of Airtable as a toolkit of building blocks that people can repurpose to create their own applications. Our product roadmap is filled with interesting enhancements and additions to this toolkit that will push the boundaries of Airtable&#x27;s capabilities.<p>Our users love us: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;airtable&#x2F;timelines&#x2F;566728799115440128\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;airtable&#x2F;timelines&#x2F;566728799115440128</a><p>We’re hiring engineers for web (JS, Node, React), iOS (Objective-C, Swift), and Android. There are 13 of us right now, with backgrounds from Google, Facebook, Microsoft, etc. We believe in the power of highly motivated and capable individuals to accomplish great things in small teams, with end-to-end ownership of projects and rapid iteration.<p>We’ve raised over $10 million in funding.<p>You can apply here: <a href=\"https:&#x2F;&#x2F;airtable.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com&#x2F;jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822074", 
        "user": "kasrak"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Third Iron | full-time | REMOTE<p>Help us architect, test, and build server-side infrastructure for academic researchers and librarians.<p>We are a remote-first company, founded in 2011, with node.js and Postgres powering our backend, Ember for the web front-end for our flagship product <a href=\"http:&#x2F;&#x2F;www.browzine.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.browzine.com</a> , and most recently CouchDB to sync user data between our web app and our native mobile apps.<p>From GitHub to Heroku to Slack, see all of the tools and services we use: <a href=\"http:&#x2F;&#x2F;stackshare.io&#x2F;third-iron&#x2F;third-iron&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;stackshare.io&#x2F;third-iron&#x2F;third-iron&#x2F;</a><p>We want developers with a passion for Javascript, automated testing, continuous integration, and constant learning and improvement. Strong communication skills and past remote experience (or a strong desire to work remotely for the first time) are also essential.<p>Be part of our small, fully-remote team building software to help solve some big problems faced in reading and discovering academic research papers.<p>Send resumes and samples of your accomplishments to info@thirdiron.com or learn more here: <a href=\"https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;105193&#x2F;senior-server-side-developer-third-iron-llc\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;105193&#x2F;senior-server-...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822977", 
        "user": "karmelapple"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "CrowdJustice.org - London, UK - Junior Dev and Tech Lead roles - Full-time<p>We are a tech-for-good for-profit helping communities fund access to justice. Think Kickstarter for court cases - or Change.org with hard legal outcomes - we&#x27;ve funded cases ranging from Supreme Court interventions to local communities trying to prevent developers destroying their green spaces. Our MVP has raised nearly $400k for exciting cases from a standing start in a few months and we are building a team to grow nationally in the UK and internationally.<p>What that means on the product front is developing a world class webapp (mainly written in Django) that has huge scope for helping users interface with cases, social issues and other donors. Engineers with a keen interest in user funnels and metrics (&amp;, um, social justice) please get in touch! <a href=\"https:&#x2F;&#x2F;www.crowdjustice.co.uk&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.crowdjustice.co.uk&#x2F;jobs</a> or email julia@crowdjustice.co.uk", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823053", 
        "user": "jsalasky"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Google | Mountain View &#x2F; San Francisco &#x2F; London | Software Engineer | Onsite<p><a href=\"https:&#x2F;&#x2F;www.google.com&#x2F;about&#x2F;careers&#x2F;search#!t=jo&amp;jid=90795001&amp;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;about&#x2F;careers&#x2F;search#!t=jo&amp;jid=907950...</a><p>Google for Work Labs&#x2F;Incubation is a skunk works R&amp;D team working inside of Google&#x27;s Enterprise division, coming up with the next big google B2B product<p>The team operates as a startup, and has internal funding rounds for each of our ideas. On a regular basis our teams interact with [x], life-sciences, ventures, and other alphabet companies.<p>The team tries to solve the following question: What business technology need is currently going unsolved, that can be built today, where google has a distinct advantage.<p>Once we identify a product which meets that criteria, we&#x27;ll evaluate and potentially create an MVP and raise a seed fund (from google). If the project&#x27;s successful we&#x27;ll keep going through funding rounds and raising money internally.<p>As a prototype engineer, you&#x27;ll get to write software for custom circuit-boards &amp; hardware, embedded computing, cloud computing, big data, mobile apps, and web-apps.<p>We&#x27;re looking for candidates with a strong software background, and an understating of product.\nFeel free to email me directly at bookman@google.com with your resume and a link to your github.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822503", 
        "user": "cobookman"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "ReadMe.io (YC W15) | ONSITE - San Francisco<p><a href=\"http:&#x2F;&#x2F;readme.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;readme.io&#x2F;careers</a><p>We&#x27;re looking for product-focused Node&#x2F;Angular developers who want to help us craft magical experiences for developers. (We&#x27;ve already helped 2.5MM developers work with a new API or code library! Here&#x27;s a few of our customers: <a href=\"http:&#x2F;&#x2F;readme.io&#x2F;customers\" rel=\"nofollow\">http:&#x2F;&#x2F;readme.io&#x2F;customers</a>)", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822958", 
        "user": "gkoberger"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Tropo @ Cisco | Software Engineers, QA engineers, Product Managers, Support Engineers, Training Engineers | San Francisco, CA &#x2F; Milpitas, CA &#x2F; Beijing | Fulltime | Onsite<p>Open positions: <a href=\"https:&#x2F;&#x2F;jobs.cisco.com&#x2F;search&#x2F;?q=tropo\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.cisco.com&#x2F;search&#x2F;?q=tropo</a><p>At Tropo, recently acquired by Cisco, we work as a startup but with the perks from a giant company. There is several fronts that are significantly growing and many opportunities ahead so the company is hiring on many different levels.<p>Personally, I&#x27;m involved in the hiring process for software engineers. We are looking for very experienced developers familiar with the Java platform. On your daily work you will have to deal with frameworks like Hibernate, Spring, Jersey, and so forth. Familiarity with concurrency patterns is a big advantage too. So is experience with JVM debugging, GC analysis, profiling, etc. Additional languages are also a big plus and VoIP experience is even better but not mandatory.<p>For all positions you can apply from the link above. For those related with software engineering you can also get in touch with me at martper2 at cisco dot com<p>Have a great new year!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822982", 
        "user": "mpermar"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Bulletproof | www.bulletproof.com | www.bulletproofexec.com<p><pre><code>        ************* Whistle Wetter *************</code></pre>\nfull-time. remote. west coast US&#x2F;CAN preferred | comp (DOE - competitive) | stellar benefits and options | non-hierarchical organization<p><pre><code>        ************* Positions &#x2F; Roles *************</code></pre>\nBP E-Com:\nSr. Magento Developer | Front End Developer | Back End Developer | Business Analyst | Technical Product Manager | UX Designer<p>BP Digital X-Labs (Dev Ops): \nSr. Software Engineer | QA Engineer | Data Engineer | Technical Lead | Systems Analyst<p><pre><code>        ************* Bulletproof is *************</code></pre>\nwell funded | profitable | customer centric | extremely and uniquely communicative | teeming with gratitude | a loving tribe of high performers | revolutionizing workflow culture<p><pre><code>       *************Our tribal wants*************</code></pre>\nWe are seeking fellow ass kickers, hackers of all flavors, and students of the human condition. \nBe awesome | Be balanced | Be driven | Be present in the moment; manifest your vision | Most of all - be intrepid; live, work, engage without fear.<p>PHP &#x2F; Magento (1.x &amp; 2.x) | NetSuite | Golang (Google Cloud Stack) | Pandas &#x2F; Sparkling Pandas &#x2F; NumPy &#x2F; SciPy | AWS &#x2F; Redshift | R &#x2F; Julia | D3 &#x2F; AngularJS | RESTful API development | Hubot &#x2F; micro-servies | ClojureScript &#x2F; HTML5 &#x2F; CSS3 | flavors of Relational &#x2F; Non-Relational &#x2F; Graph DBs | Puppet &#x2F; CFEngine &#x2F; Git &#x2F; Jenkins &#x2F; Hudson | Python &#x2F; Ruby | the bleeding edge of today&#x27;s technological capacities<p><pre><code>       *************How does it feel?*************</code></pre>\nIf the above feels good, email brian.hyman@bulletproof dot com the role(s) that piqued your interest | current geographic location | profile or portfolio(URLs preferred) | resume or cv.<p><pre><code>       *************Be Bulletproof*************</code></pre>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10823066", 
        "user": "hymanb"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Growth Street - London, UK - Full Time, on-site<p>Growth Street is looking for enthusiastic, ambitious software developers to join our technology team to build the tools behind the next generation of SME finance. We are a lending platform which connects small businesses with much-needed credit facilities for working capital, and use our technology to speed up and improve the human processes, but never replace them entirely. We&#x27;re building a set of tools to not only help us make credit decisions around a business, but also feed back useful information to the owners which can help them focus more on the growth of their business.<p>Growth Street is licensed to sponsor Tier 2 migrant visas in the UK, and experienced candidates for this role may qualify for the the senior developer shortage occupation which greatly speeds up the sponorship process. We&#x27;d love to hear from candidates from around the globe; 40% of our current team started life outside the UK.<p>Please see the full posting and get in touch via our jobs site at <a href=\"http:&#x2F;&#x2F;growthstreet.co.uk&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;growthstreet.co.uk&#x2F;careers&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822961", 
        "user": "greghinch"
    }, 
    {
        "address": "Herndon, VA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Advanced Simulation Technology, inc. (ASTi) | Herndon, VA | Multiple\nPositions | ONSITE<p>We’re a small company building innovative products in the simulation and\ntraining industry. One of our newest products is SERA\n(<a href=\"http:&#x2F;&#x2F;seraatc.com\" rel=\"nofollow\">http:&#x2F;&#x2F;seraatc.com</a>), the Simulated Environment for Realistic ATC. SERA\nhelps airline pilots learn to communicate by simulating the entire air\ntraffic control environment, including artificial intelligence for\naircraft and controllers, speech recognition on pilot speech, and\ntext-to-speech radio chatter.<p>ASTi has been around for about 25 years. We’ve been very successful in\nour niche (audio and communications), but we’re beginning to grow in\nadjacent areas and need your help!\nOn-site, full-time engineering positions available for those interested\nin software, web, cloud and speech technology.<p>Stack: C&#x2F;C++, Python, Angular, Node.JS, Go(golang), AWS, Docker,\nRethinkDB, RaspberryPi<p>Check out this page for more information on ASTi, our unique work\nenvironment, and the full job descriptions:\n<a href=\"https:&#x2F;&#x2F;www.asti-usa.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.asti-usa.com&#x2F;jobs</a>. A few other reasons to consider ASTi:\nexcellent compensation, profit-sharing, start at 4 weeks vacation\n(growing to 6 weeks over time), company-paid retirement plan, and we\nwere included in Washingtonian Magazine’s &quot;50 Great Places to Work&quot; in 2015.<p>Get in touch via jobs@asti-usa.com.<p>Thanks! Curtis (CTO)", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.9695545, 
        "location": "Herndon, VA", 
        "lon": -77.3860976, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822398", 
        "user": "asti"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "PolicyGenius | New York, NY (NYC) | Full-Time | Onsite<p>Software engineer (full-stack or front-end, mid-to-senior)<p>We&#x27;re looking for multiple new team members to help us build and grow our Rails and React applications.<p>Our stack:<p>- A lightly service-oriented architecture with the backends powered by Rails and a mix of Rails, Rails and React or full React on the frontend. Whatever makes the most sense for the application in question<p>- We use Redux as our flux-ish implementation of choice and believe strongly in a styleguide-driven modular CSS architecture to help keep the UI maintainable.<p>Our values:<p>- High-quality, robust code. We achieve this with a heavy focus on strong object-oriented design and great test coverage. We&#x27;re firm believers in the benefits of test-driven development<p>- Collaboration and continuous learning - we pair program sometimes, we review each others code all the time and we love to pragmatically explore new technologies. We&#x27;re able to keep our best practices evolving and help each other get up to speed quickly on new things.<p>- Full-stack skills. We&#x27;re not all experts on all parts of the stack, but anyone can jump in and help wherever and as the team grows, everyone will be encouraged to rotate projects regularly to stay sharp and challenged.<p>About you:<p>- You&#x27;re strong in either Rails or React (even better if both) and eager to work on both the front and back ends.<p>- You practice TDD and have strong opinions about why you do it.<p>About us:<p>PolicyGenius is changing the way America shops for insurance. We&#x27;re an online education and shopping platform for insurance akin to TurboTax for insurance. It&#x27;s a big, confusing industry and we&#x27;re making it easier for consumers to understand insurance and purchase it. Check out our CEO&#x27;s article in Entrepreneur about how we&#x27;re disrupting the industry: <a href=\"http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;250095\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;250095</a><p>Questions&#x2F;applications: Email josh@policygenius.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822802", 
        "user": "prophetjohn"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "LeadBoxer | Amsterdam | Web developer&#x2F;designer | ONSITE<p>We’re looking for a front-end web developer&#x2F;designer who knows the in’s and out’s of WordPress and would be excited to help strategize, build new pages&#x2F;sections, squash bugs, and improve existing content. We also need someone who can assist the front-end developers with (HTML&#x2F;CSS&#x2F;Javascript) issues and has an intuitive feel for both usability and accessibility.<p>Our ideal candidate should have advanced experience building or customising WordPress themes and plugins; be able to identify and resolve WordPress issues (front-end&#x2F;server&#x2F;database); strong knowledge in PHP and jQuery&#x2F;JavaScript for new items&#x2F;section development; expert skill in html5&#x2F;css3 and mobile (responsive) development.<p>full details here:\n<a href=\"https:&#x2F;&#x2F;leadboxer.recruitee.com&#x2F;o&#x2F;web-designer-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;leadboxer.recruitee.com&#x2F;o&#x2F;web-designer-developer</a><p><a href=\"https:&#x2F;&#x2F;www.leadboxer.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.leadboxer.com</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822948", 
        "user": "wartus"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "ZipRecruiter - <a href=\"https:&#x2F;&#x2F;ziprecruiter.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ziprecruiter.com</a> - Santa Monica (LA area) - REMOTE OK for some positions<p>Our goal is to create the best online services for filling and finding jobs.  We bootstrapped for the first four years, growing to 100+ employees.  In August 2014, we raised $63M led by Institutional Venture Partners.<p>We have a number of open positions:<p><pre><code>  - Lead&#x2F;Principal Security Engineer (Santa Monica)\n  - Software Engineer (primarily Python) (Santa Monica)\n  - Software Engineer (primarily Perl) (Santa Monica or remote)\n  - Software Engineer in Test (python, selenium) (Santa Monica)\n  - Software Release Manager (Santa Monica)\n</code></pre>\nWe&#x27;re growing rapidly and have a large customer base (primarily small and medium sized businesses).  We have interesting problems to solve in the areas of search, yield management, analytics, scalability and new product development.  If you&#x27;d like to learn more, please visit <a href=\"https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;hiring&#x2F;technology\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;hiring&#x2F;technology</a> or email us at techjobs@ziprecruiter.com", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822422", 
        "user": "wiredd"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Gin Lane : New York City : Onsite : Senior Javascript Engineer : Full-time<p><a href=\"http:&#x2F;&#x2F;ginlane.com&#x2F;contact\" rel=\"nofollow\">http:&#x2F;&#x2F;ginlane.com&#x2F;contact</a><p>Gin Lane is a collective of creative technologists working on creating consumer experiences of the future. Some of the partners we&#x27;ve worked with in the past are Sweetgreen, Best Made, Campaign Furniture, Warby Parker and Harrys.<p>We&#x27;re looking for a Javascript gangster to work with us on building out engaging interfaces and advocating future tech. If you&#x27;re working with any combination of React, Elm, Clojurescript, Redux, Radium, three.js, GSAP, let&#x27;s talk!<p>-<p>tech-jobs @ ginlane.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822224", 
        "user": "edword"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "New York City, NY | Full-time, Onsite | Front End and Full-stack&#x2F;Product Engineers<p>Bond Street (<a href=\"http:&#x2F;&#x2F;www.bondstreet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bondstreet.com</a>) is a startup focused on transforming small business lending through technology, data and design. Small business owners are the foundation for growth in our economy, and yet today’s banking system has left them behind. We’re building a better future where access to financing is simple, transparent and fair.<p>Recently, we raised a $10m Series A from investors like Spark Capital and Homebrew, and a $100m lending facility from Jefferies, an investment bank. We’re looking for exceptional front-end and full-stack engineers (bonus points if you have a financial services background) to join our product team, which includes Tumblr&#x27;s former creative director, Peter Vidani. You’ll be responsible for helping to transform the business lending experience for over 25 million small business owners in America.<p>Projects our engineers work on include designing algorithms for instant risk assessment, creating intuitive and delightful user interfaces for our online loan application, and constructing dashboards for internal and customer use that resurface small business data in ways that can inform credit use and business growth.\nSend an email to our CTO at peytons@bondstreet.com if you’re interested.<p>Can arrange visa as needed.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822821", 
        "user": "fscof"
    }, 
    {
        "address": "West Haven, CT, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Device42 | West Haven, CT | Full-time | Onsite | Systems Engineer &#x2F; DevOps<p>#About Device42: Device42 software is a single source of truth for IT Infrastructure Management. With Device42, IT teams can see all their data in one place - their servers, IT assets, IP addresses, software, services, server &amp; app dependencies and passwords. We are an agile team that likes to move fast and produce results. Come join us to make life easier for system, network and devops engineers and IT Managers.<p>#Position 1: Pre-sales and support Engineer We need someone who is an experience network, system or devops engg. and explain our software to fellow sysadmins and engineers. The position also requires support role for the software.<p>#Position 2: DevOps Evangelist Device42 is looking to hire its first DevOps Evangelist who will take the reins and help explain the value of our software to the DevOps community. We need someone who has a passion for helping system engineers and developers do more master. Someone with experience in DevOps, continuous integration, system administration. You can come to this position from a web-developer&#x2F;application-building perspective, or an ops&#x2F;sys admin perspective.\nDetails: <a href=\"http:&#x2F;&#x2F;www.device42.com&#x2F;jobs&#x2F;devops-evangelist&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.device42.com&#x2F;jobs&#x2F;devops-evangelist&#x2F;</a><p>Please send us a note to &lt;my hn username&gt;@device42.com or to jobs@device42.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 41.2705484, 
        "location": "West Haven, CT", 
        "lon": -72.9469711, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822798", 
        "user": "rajjalan"
    }, 
    {
        "address": "Dallas, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Chaotic Moon | Dallas, TX | <a href=\"http:&#x2F;&#x2F;www.chaoticmoon.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.chaoticmoon.com&#x2F;</a> | FULLTIME | ONSITE<p>Fortune. Glory. An endless supply of Topo Chico. Chaotic Moon is an Austin-based creative technologies studio opening a new office in Dallas, TX. We&#x27;re the brains behind some of the most exciting tech stories of this year (and next), and we need more mad geniuses to help us implement our plans for global domination. We recently joined Accenture Digital, giving us access to the resources (and benefits) of a $7b company while still operating as an independent studio with our own culture.<p>We&#x27;re aggressively staffing our new Dallas office with the following roles:<p>- Developers (backend, mobile, Unity, and front-end web);<p>- Solutions architects;<p>- Visual and interaction designers;<p>- Content strategists;<p>- UX strategists.<p>More information at <a href=\"http:&#x2F;&#x2F;www.chaoticmoon.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.chaoticmoon.com&#x2F;careers&#x2F;</a>.", 
        "h1b": false, 
        "intern": false, 
        "lat": 32.7766642, 
        "location": "Dallas, TX", 
        "lon": -96.79698789999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822960", 
        "user": "chaoticmoon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Open Whisper Systems • San Francisco • Full Time • ONSITE<p>Open Whisper Systems is making private communication simple. Our technology is used by hundreds of millions of people, and everything we produce is open source. What it&#x27;s like to work with us: <a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a><p>• iOS Developer -- Someone intimately familiar with iOS development and internals, who has an appreciation for the craft of software development and experience with making decisions that result in great products. No experience with cryptography necessary, just solid experience developing for iOS and an eye for good design.<p>• Android Developer -- Is the pleasure center of your brain directly wired to the experience of a slick UX or a nice animation? Do you hunt down memory leaks and StrictMode violations for fun? We&#x27;re looking for someone with deep knowledge of the Android framework and an equally strong intuition for pairing beautiful app experiences with beautiful code. You&#x27;ll be the architect of major features, making your code available to the world. You don&#x27;t need to be a security expert; it&#x27;s knowing how to make complicated systems simple to use that&#x27;s at the heart of what we do.<p>• Mobile UI &#x2F; Product Designer -- We’re seeking an original thinker with strong visual design skills ready to help make private communication simple. You&#x27;ll take on developing the look and feel of Signal on iOS, Android, and the desktop. You’ll be responsible for updating the visual design for the app and helping shape consistent guidelines to communicate a compelling user story across our products and other touchpoints. You’ll work closely with a team of engineers with a passion for making usable software. No experience with cryptography necessary, just intuition for what makes a great product and solid experience designing products that are a joy to use.<p>See more at <a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a>, or send us a note at workwithus@whispersystems.org", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823033", 
        "user": "moxie"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Transcriptic: Full-stack developer (emphasis on frontend)<p>Menlo Park, CA; <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;</a><p>Transcriptic is &quot;Amazon Web Services&quot; for the life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic&#x27;s central, highly automated &#x27;biocenter&#x27; in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We&#x27;re building a long-term company to completely change the way life science research and development is done.<p>Among other things, we&#x27;re looking for highly talented full-stack web developers. On top of our robotic work cells is a slew of internal services as well as a Rails app that acts as our lab information management system and customer-facing UI. Challenges range from building rich, interactive interfaces for composing protocols to presenting analytical data generated by the lab back to the user. We use d3, Backbone, CoffeeScript, and React today, but you&#x27;d be free to choose your own tools and libraries.<p>We&#x27;re a rapidly growing startup (you&#x27;d be #36), well funded ($18M: Google Ventures, IA Ventures, Data Collective, AME Cloud, Founders Fund) and have customers at places like Harvard, MIT, Caltech, UCSF, and Stanford. You&#x27;d be able to work on interesting science and hard technology in a small, all technical team with lots of freedom and resources.<p>A biology background is preferred but not strictly necessary for outstanding people.<p><a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;</a><p>If there isn&#x27;t an opening listed for your specific background, don&#x27;t get discouraged, just apply to the thing that&#x27;s closest or send us an email - we&#x27;re always looking for truly exceptional people in whatever role.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823047", 
        "user": "frisco"
    }, 
    {
        "address": "Berlin, Germany", 
        "country": "DE", 
        "freshness": false, 
        "full_html": "1aim - Berlin, Germany | Onsite, Full Time, Visa<p>At 1aim (<a href=\"https:&#x2F;&#x2F;1aim.com\" rel=\"nofollow\">https:&#x2F;&#x2F;1aim.com</a>), we develop and produce access control systems, which allow to open doors with mobile phones. We create all hardware, software and IT-Infrastructure to run our systems on our own. Beside access systems we are already putting a lot of R&amp;D effort in creating further new smart home&#x2F;building automation products. We see ourselves as an engineering-driven technology company, that influences how a future with connected devices will look.<p>We enable engineers to focus on what they can to best, letting them work on new products in small, highly interdisciplinary teams. We get rid of management overhead and daily standup meetings. We have almost no rules and flexible working hours, your contribution is the only thing we care about. Right now, we are hiring new engineers for the following areas:<p>- (Frontend) Web Development<p>- Backend Development (with a focus on high security&#x2F;cryptography)<p>- App Development (Android and&#x2F;or iOS)<p>- Electrical Engineering &amp; Embedded Software Development<p>- Mechanical Engineering<p>We do not care about your academic degrees or where you are from, but about the stuff you did and what you could create in the future given the right opportunities. If you are interested in working at 1aim, write us an email at work.hn&lt;?&gt;1aim.com and tell us about the projects you worked on that you are the most proud of and which technological feats of the past inspire you.\nWe provide visa assistance, relocation support and free housing until you find your own place to live.", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.52000659999999, 
        "location": "Berlin", 
        "lon": 13.404954, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822845", 
        "user": "ylere"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "◎ Localize | Full-stack Javascript Engineer | San Francisco (SF) | Full-Time | Onsite<p><a href=\"https:&#x2F;&#x2F;localizejs.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;localizejs.com&#x2F;jobs</a><p>Localize is building tools to help companies go global. As our 5th team member, you&#x27;ll have full control of your role and large parts of our product.<p>Apply: Email our founder at brandon@localizejs.com or submit an application here: <a href=\"https:&#x2F;&#x2F;localizejs.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;localizejs.com&#x2F;jobs</a><p>You should be able to:<p><pre><code>  —  Navigate our stack: Node, Backbone, MongoDB, Redis, AWS, Handlebars, Less.\n\n  —  Manipulate native browser APIs (DOM w&#x2F;o jQuery)\n\n  —  Understand MVC patterns and UI design\n\n  —  Learn quickly, act autonomously, think analytically.\n</code></pre>\nIn addition to competitive equity &amp; salary, you get...<p><pre><code>  —  A shiny new laptop of your choice \n\n  —  Full insurance coverage (medical, dental, and vision) \n\n  —  Free food + snacks! \n\n  —  Relocation assistance to SF\n</code></pre>\nAu revoir! -- Localize Team :)", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822900", 
        "user": "cj"
    }, 
    {
        "address": "Austin, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Software Engineer | Austin, TX | OwnLocal (YC W2010)<p>Positions: Senior Software Engineer, Junior Software Engineer, Product Manager and Project Manager<p>TL;DR: Full-time, local only. Contact hack@ownlocal.com. RoR, Go, ElasticSearch but we think you can learn these things on the job if you&#x27;re competent. We treat employees like humans. $90k and up (for a senior software engineer) depending on experience.<p>We&#x27;ve historically been a Ruby on Rails shop but recently more and more of our stack has been in Go.  We&#x27;ve built a big API on ElasticSearch which serves billions of requests per month.<p>We&#x27;re interested in computer vision, OCR, speech recognition and video transcoding because these things are all part of our bread and butter -- small business advertising.<p>OwnLocal is dedicated to having a quality work environment for everyone. On our engineering team we value collaboration over competition, respect work-life balance and solve problems without blaming people. We have a &quot;no assholes&quot; policy. We have great health insurance. We&#x27;re big enough to be stable but small enough that everyone still knows everyone else in the company. We pay market rate for Austin; for example, the lowest salary for a senior software engineer is around $90k&#x2F;yr.<p>Learn more at <a href=\"http:&#x2F;&#x2F;ownlocal.com&#x2F;about&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ownlocal.com&#x2F;about&#x2F;jobs&#x2F;</a> or contact us at hack@ownlocal.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 30.267153, 
        "location": "Austin, TX", 
        "lon": -97.7430608, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822243", 
        "user": "jnovek"
    }, 
    {
        "address": "Orem, UT, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Jive (jive.com) - Orem, UT | Data Engineer | Full-Time | REMOTE<p>We are hiring a full-time data engineer to own the vision and implementation of our data infrastructure spread over 9 datacenters in the US, EU, and South America as well as GCE and AWS. This isn&#x27;t a DBA role, it&#x27;s joining a software development team to build out our data platform, tooling and services for our application and platform engineering teams to use.<p>In depth knowledge of PostgreSQL, logical and async replication, Kafka, and a development background are a must - although you&#x27;ll be up to date with all the latest news in the (No)SQL world.<p>The position can be anywhere in the US or Canada working from home, although possibility to relocate to one of our offices in Orem (Utah), Dallas, Fort Lauderdale, Quebec, or Ontario.<p>Email me at nethier@jive.com if interested.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.2968979, 
        "location": "Orem, UT", 
        "lon": -111.6946475, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822973", 
        "user": "nickethier"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "Smarkets, London, UK. On-site only.<p>We&#x27;re a modern betting exchange, going technology first to enable proper price competition in a field of fat commissions. Join a small, agile, and fast-growing team, who just moved to a new office in St Katharine Docks. (Next to Tower Bridge!)<p>Smarkets develops a reliable, low-latency, highly concurrent betting exchange based on trading exchange designs. We&#x27;re also building a fast, modern web interface to allow for a smoother experience. Servicing our users is top priority.<p>The Smarkets platform is written predominantly on Python and Erlang, and relies heavily on asynchronous programming techniques. We use REST where we can. Life at Smarkets circles around people, version control, configuration management and automation. We can - and do - deploy to production several times a day.<p>If you like the idea of flat structure and practical engineering approach, see our jobs at <a href=\"https:&#x2F;&#x2F;smarkets.com&#x2F;about&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;smarkets.com&#x2F;about&#x2F;jobs&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822421", 
        "user": "bostik"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Blueshift Labs | San Francisco | Full-time | Onsite | VISA<p>== About Blueshift ==<p>Blueshift (<a href=\"https:&#x2F;&#x2F;getblueshift.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getblueshift.com</a>) is based in San Francisco, building a “Segment of One Marketing” solution used by consumer marketers to drive higher revenue and retention across all marketing channels. The company is founded by repeat entrepreneurs, and backed by top tier VC firms.<p>== Hiring for ==<p>* Full-stack engineer - Build our dashboard used by marketers to personalize marketing for millions of users. Ruby&#x2F;Rails, Angular.js<p>* Backend engineer - Build micro-services for content targeting, user profiles etc. in Go&#x2F;Ruby.<p>* DevOps engineer - Join as our first devops engineer to build our docker &amp; chef based infrastructure on AWS<p>== Contact us ==<p><a href=\"https:&#x2F;&#x2F;getblueshift.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;getblueshift.com&#x2F;jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822963", 
        "user": "kola"
    }, 
    {
        "address": "Menlo Park, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Karius | Menlo Park, CA | ONSITE, Full-time | Molecular Biology, Software (Full Stack), Computational Biology, Wet-lab Automation, Machine Learning<p>We are a team of crazy biologists, engineers, data scientists and clinicians on a mission to change forever the way infectious diseases are diagnosed and treated. We face incredibly interesting challenges in software engineering, machine learning and molecular biology, as we push the limits of diagnostics and genomic technologies. We&#x27;re hiring molecular biologists, computational biologists, software engineers and data scientists. Join us on the ground-level for this exciting journey to shape our technology, product and company culture.<p>If you&#x27;re a software engineer, we&#x27;re looking for experience in front-end, back-end, intrastructure, devops, bioinformatics, and machine learning. We have a varied list of challenges; we build large data processing pipelines to analyze data from in-house DNA sequencers, separate the signal from the noise and extract what we need, and visualize this in ways that are helpful for scientists and doctor; we build web apps and tools for biologists and doctors to use to plan, conduct, and analyze experiments; we work closely with molecular biologists to analyze data generated by these experiments and develop novel computational biology methods. We mostly use Haskell (for many things), Python (for bioinformatics), and React&#x2F;ES6 (for front-end interfaces), backed by infrastructure built on top of AWS and Docker.<p>If any of this sounds exciting to you, please don&#x27;t hesitate to get in touch with us: gstock@kariusdx.com<p>Take a look at our job postings on AngelList for more detail: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;karius&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;karius&#x2F;jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4529598, 
        "location": "Menlo Park, CA", 
        "lon": -122.1817252, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822842", 
        "user": "PieSquared"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Spiceworks | Austin | Full time | Onsite with relocation assistance available<p>Spiceworks helps millions of IT pros do their jobs with free tools and connect through our online community. Come help us transform IT. We are looking for the following:<p>- Senior Test &amp; Automation Engineers<p>- Senior Data Engineers and Architects<p>- Software Engineers (front-end, back-end or full-stack)<p>We have an awesome culture with full benefits, an onsite gym, free drinks &amp; snacks (with breakfast tacos on Monday and bagels on Friday), a weekly development lunch-n-learn and more. We&#x27;re also ranked as one of the best places to work by glassdoor in 2015 (<a href=\"http:&#x2F;&#x2F;www.glassdoor.com&#x2F;Best-Small-and-Medium-Companies-to-...\" rel=\"nofollow\">http:&#x2F;&#x2F;www.glassdoor.com&#x2F;Best-Small-and-Medium-Companies-to-...</a>) and have been ranked at a top work place by the Austin American-Statesman six years running (<a href=\"http:&#x2F;&#x2F;www.topworkplaces.com&#x2F;frontend.php&#x2F;regional-list&#x2F;comp...\" rel=\"nofollow\">http:&#x2F;&#x2F;www.topworkplaces.com&#x2F;frontend.php&#x2F;regional-list&#x2F;comp...</a>).\nFind out more about Spiceworks and see the current openings at <a href=\"http:&#x2F;&#x2F;www.spiceworks.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spiceworks.com&#x2F;jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822280", 
        "user": "spicerex"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Cloudera | Location: San Francisco or Palo Alto, CA | Full-time| Onsite | Software Engineers in Cloud, Test, Site Reliability, Hadoop, Test, Automation, Spark, QA, Security and more |  www.cloudera.com<p>Picture yourself at Cloudera in 2016!<p>Our mission: Founded by leading experts on big data from Facebook, Google, Oracle and Yahoo, Cloudera&#x27;s mission is to bring the power of Hadoop, MapReduce, and distributed storage to companies of all sizes in the enterprise, Internet and government sectors.<p>Over the past few years, Cloudera has experienced tremendous growth, making us the leading contributor to the Hadoop ecosystem and a leading provider of enterprise solutions for Big Data.<p>Cloudera is revolutionizing enterprise data management by offering the first unified Platform for Big Data, an enterprise data hub built on Apache Hadoop™. Cloudera offers enterprises one place to store, process and analyze all their data, empowering them to extend the value of existing investments while enabling fundamental new ways to derive value from their data. Only Cloudera offers everything needed on a journey to an enterprise data hub, including software for business critical data challenges such as storage, access, management, analysis, security and search.<p>Check out all our roles and apply here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2016EngCareers\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2016EngCareers</a><p>Glassdoor&#x27;s Employees&#x27; Choice Awards 2016 <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1ORttqv\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ORttqv</a><p>The Best Startup CEOs To Work For <a href=\"http:&#x2F;&#x2F;read.bi&#x2F;1KR6zvN\" rel=\"nofollow\">http:&#x2F;&#x2F;read.bi&#x2F;1KR6zvN</a><p>20 Big Data Companies Leading the Way <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1lQgc5Y\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1lQgc5Y</a><p>50 enterprise startups to bet your career on in 2016 <a href=\"http:&#x2F;&#x2F;read.bi&#x2F;1IybdM8\" rel=\"nofollow\">http:&#x2F;&#x2F;read.bi&#x2F;1IybdM8</a><p>Top 10 Private Tech Companies to Work For <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1ZF7vdD\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ZF7vdD</a><p>Cloudera Engineering Blog <a href=\"http:&#x2F;&#x2F;blog.cloudera.com&#x2F;blog&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.cloudera.com&#x2F;blog&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822799", 
        "user": "Infosourcer"
    }, 
    {
        "address": "Ashburn, VA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Bock lab, Janelia research campus, Howard Hughes Medical Institute (HHMI) | Ashburn, VA | ONSITE<p>Data scientist &#x2F; Neurogeometer<p>We recently finished acquiring an electron microscopy dataset encompassing the entire brain of a fruitfly (120 million images, 115 TB on disk, voxel size 4 x 4 x 40 nanometers). A team of tracers is manually skeletonizing portions of this animal&#x27;s nervous system, and we are starting to see interesting circuit motifs emerge.<p>We are looking for someone to help build and use tools supporting this analysis (neurogeometry), as well as help wrangle the millions of images  continuing to flow from our three microscopes (~500 TB of primary image data anticipated in the next two years). During this time we expect to switch from RAID-based file systems to an object store (likely Scality), with substantial support from a team at Janelia outside the lab.<p>Desirable attributes:<p>- Education: B.S. or M.S. in Computer Science or related field (or an equivalent in education and experience)<p>- Strong familiarity with Linux, including command line wizardry and detangling dependency nightmares<p>- Proficient in Python and at least one other programming language (e.g Java or C&#x2F;C++)<p>- Experience with utilizing SQL and&#x2F;or NoSQL data stores (e.g. MongoDB, PostgreSQL, Microsoft SQL Server)<p>- Experience with image processing (ImageJ, SciPy, Matlab, OpenCV, etc.)<p>- Comfortable working with new programming languages and tools when necessary<p>- Familiar with RESTful web services<p>- Experience using an HPC cluster (MPI, SGE&#x2F;OGE, Spark, etc.)<p>- Follows current trends in industry and academia<p>- Willing to get hands dirty with hardware<p>- Ability to concentrate in a fast paced and dynamic environment<p>- Ability to communicate effectively, orally and in writing<p>- Ability to take initiative, prioritize tasks, use good judgement and monitor completion of assigned duties.<p>- Experience or strong interest in working in an interdisciplinary environment.", 
        "h1b": false, 
        "intern": false, 
        "lat": 39.0437567, 
        "location": "Ashburn, VA", 
        "lon": -77.4874416, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823017", 
        "user": "davi"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "GreatHorn (<a href=\"http:&#x2F;&#x2F;www.greathorn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.greathorn.com</a>) • ONSITE (Boston, MA + New York City, NY) • Software Engineer • Full time<p>GreatHorn (Techstars &#x27;15) is a new kind of cybersecurity platform that secures cloud-based communication systems, detecting and stopping spear phishing and credential theft attacks in realtime.<p>This is an opening for a full-stack developer with a strong background in Javascript, CSS, SQL, and data stores of all kinds.<p>You&#x27;ll help to define the future of cloud security, work directly with the founding team on a wide range of (we think!) interesting problems, and have a material impact on the growth of the product from the ground up. This role will work across the entire product stack, from database connectors to UX, and define new ways to capture, analyze, and report on customer security data, along with helping to grow a system of services distributed across machines, languages, and networks. The ideal candidate will have experience working with cloud services (Google Apps, Azure, AWS, etc.), as well as a history of working within startup environments.<p>You can reach me directly at kobrien@greathorn.com, or apply online via <a href=\"https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;be6442a3\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;be6442a3</a>.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822206", 
        "user": "kevinmobrien"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "London. Full-time. REMOTE is okay if within easy commute to London.<p>Gower Street Analytics - Engineer for data science products.<p>Gower Street is a new, funded startup doing data science  for Hollywood. We&#x27;re building tools for film studios to understand how their films and release dates interact with international competition.<p>You&#x27;ll be helping us build these products and the servers that keep them running. Your education and background are not so important rather, we&#x27;re more concerned with your ability and desire to learn, and the ideas you bring to the conversation.<p>We like scikit-learn, pandas, racket, postgresql, d3.js.<p>contact info in profile<p>(we cannot help with visas.)", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822643", 
        "user": "mebassett"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Streak (YC S11) | San Francisco | Full-time | Onsite (Java, Go, JS)<p>We&#x27;re hiring a curious mind to help scale our backend systems. We&#x27;re trying to make people vastly more efficient at work email. A core part of that is building backend systems that smartly surface relevant information and can scale effortlessly. We&#x27;re looking for someone to own our backend infrastructure from feature development to internal monitoring and tools. At Streak, we:<p>Launch Quickly<p>Your projects will be your babies. No PM or exec approval... just listen to users and build them something amazing. We deploy dozens of times a day so you can deliver value fast!<p>Innovate on Gmail<p>Make email smarter for people using email at work (everyone!). Your work will be used by millions of users for hours a day.<p>Feel More Connected<p>Your work will have a direct impact on making the lives of our users more organized, efficient, and better. And you&#x27;ll hear their gratitude!<p>Today we&#x27;re focused on business processes (sales, hiring, fundraising, customer support, bug tracking, product dev, etc). Tomorrow we&#x27;re on track to build the system that solves work email.<p>Requirements<p>- Intellectual curiosity\n- Experience developing and monitoring production systems at scale\n- (bonus) Launched machine learning systems at scale\n- (bonus) Experience using the Google Cloud Platform\n- Local to SF", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822766", 
        "user": "alooPotato"
    }, 
    {
        "address": "Washington, DC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "LearnZillion | Washington, DC | Full Time | REMOTE (US resident)&#x2F;ON SITE<p>Help us create the digital curriculum of the future.<p>LearnZillion is a well-funded, fast-growing education technology startup building a learning platform that helps teachers meet the educational needs of every student.<p>Sr Software Engineer (REMOTE or ONSITE): we’re looking for full stack engineers that are self-motivated and comfortable working with a partially distributed team. This role can be either remote or on-site. You’ll work directly with product and design teams to develop new features for teachers, students, parents, and administrative users across the US. There’s lots of opportunity to improve classroom education as we know it, and you’ll have an outsize impact on the world.<p>Our stack: Rails 4+Ruby 2, Postgres, Elasticsearch, Redis, Sidekiq, GitHub, CodeClimate, CircleCI, and an automated test suite. Everything’s hosted on AWS.<p>Sr. Product Designer (ONSITE only): Are you well-versed in user experience and product design, technically skilled, focused, and creative? We’re looking for a Senior Product Designer to collaborate with both coworkers and users to uncover product needs, and then design and develop solutions within simple, easy-to-use interfaces. You’ll need to be comfortable with HTML and CSS, and there’s always engineers ready to help.<p>You can apply directly at <a href=\"https:&#x2F;&#x2F;learnzillion.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;learnzillion.com&#x2F;careers</a>. We’re looking forward to meeting you!", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.9071923, 
        "location": "Washington, DC", 
        "lon": -77.0368707, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822730", 
        "user": "Arubis"
    }, 
    {
        "address": "Columbia, MO, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Delta Systems Group - Columbia, MO | Full-Time | REMOTE<p>-- ABOUT<p>We are a full stack agency based primarily around the LAMP stack. We both offer consulting services (primary business) and have a number of startups&#x2F;investments the team works on.<p>-- OPENINGS<p>All openings are intermediate or senior positions.<p>1. Fullstack LAMP Engineer<p>2. Dev-ops&#x2F;Systems Admin<p>3. Frontend Engineer<p>4. WordPress &#x2F; Zend &#x2F; Symfony &#x2F; Magento &#x2F; PHP Engineer<p>-- ENVIRONMENT<p>Environment is lax. Work&#x2F;life balance is excellent. You&#x27;re welcome to work out of the new headquarters building in Columbia, MO or remotely from your home or through cowork spaces. Your membership to cowork spaces is paid for.<p>Interesting projects.<p>A number of educational services &#x2F; materials paid for by company.<p>Certifications paid for by company.<p>Annual week-long retreat in Columbia, MO to engage in a SWOT meeting.<p>Development team is around 10 people: your voice will be heard, actions will impact the company.<p>If interested email me at zlschuessler@gmail.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.9517053, 
        "location": "Columbia, MO", 
        "lon": -92.3340724, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822933", 
        "user": "zschuessler"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "The items listed here are available on the map on <a href=\"https:&#x2F;&#x2F;whoishiring.io\" rel=\"nofollow\">https:&#x2F;&#x2F;whoishiring.io</a><p>The direct link <a href=\"https:&#x2F;&#x2F;whoishiring.io&#x2F;#!&#x2F;search&#x2F;24.487148563173438&#x2F;-32.607421875&#x2F;2&#x2F;?exclude=so&amp;exclude=gh&amp;exclude=fj&amp;exclude=se&amp;exclude=ww&amp;exclude=aj&amp;exclude=wh&amp;order=distance\" rel=\"nofollow\">https:&#x2F;&#x2F;whoishiring.io&#x2F;#!&#x2F;search&#x2F;24.487148563173438&#x2F;-32.6074...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10823038", 
        "user": "xando"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Domino Data Lab - San Francisco, CA<p>We make an enterprise software product that helps data science teams accelerate research, increase collaboration, and more easily operationalize predictive models. Our customers include dozens of sophisticated quantitative research organizations in industries including insurance, finance, manufacturing, pharma, and technology.<p>We are looking for Senior Engineers &#x2F; Tech Leads: folks who can own architecturally complex features from design through implementation. Our stack is mostly in Scala, and we make heavy use of Docker under the hood.<p>More info at <a href=\"https:&#x2F;&#x2F;www.dominodatalab.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dominodatalab.com&#x2F;careers</a> or email jobs@dominodatalab.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822475", 
        "user": "DominoDataLab"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Adobe • NYC • ONSITE • Server-Side Developer, Infrastructure and Security • Full-time<p>The Aviary team was acquired by Adobe in October 2014 for its photo editing products. We provide mobile and web-based image processing APIs and stand alone applications for millions of users across thousands of partners. Since we&#x27;ve joined Adobe&#x27;s Creative Cloud, we&#x27;ve grown quite a bit and are now searching for a talented server engineer. This position covers managing our AWS infrastructure, developing APIs in Node.js, ensuring uptime with extensive monitoring across our entire fleet of services, and working closely with security teams to ensure our products are secure.<p>You&#x27;ll be joining a really fun, small team within a large organization. We still have a very &quot;startup&quot; atmosphere and unique culture while retaining the big company benefits as well.<p>If you&#x27;re interested, the full job description is here [1]. You can also email me (address in profile), since this is currently my position. I&#x27;m going to be filling a need for my experience in another team shortly, but this position is one that I&#x27;ve grown a lot with and can talk directly about.<p>Keywords: NYC, New York City, infrastructure, devops, security, AWS, Node, server, backend<p>[1] <a href=\"https:&#x2F;&#x2F;adobe.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=40648&amp;lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;adobe.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=40...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822075", 
        "user": "cddotdotslash"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Compose (IBM) | REMOTE (US, UK, CA)<p>Developing software appeals to those who love to solve puzzles and apply their brain power -- and also to those, in our experience, who like working from home in their pyjamas.<p>If you&#x27;re looking to join an exciting industry (databases-as-a-service), we have a tremendous challenge for you and a terrific team willing and able to support you through it.<p>For those that have coding experience but might be looking to try something new, we have a &quot;Technical Content Creator&quot; position - blog about, speak about, and mentor our community about different databases and programming languages.<p>Here are a few things that&#x27;s great about our team:<p>* Work from anywhere! As long as you&#x27;re legally able to work in the United States, Canada, or the United Kingdom.<p>* Self-managing, open culture.<p>* Ruby&#x2F;Go.<p>* Fantastic salary and benefits.<p>* Join a thriving, respectful and family-like team.<p>* Fair and objective hiring.<p>Our hiring process is nifty. We request a work-sample upfront that closely resembles the work you&#x27;d be doing within your role. Once you submit, your answers are anonymized then graded by 3 different people following pre-defined criteria. We want to know, objectively, who is going to both enjoy and crush the work.\nWe have three positions open for candidates:<p>* Platform Engineer (More back-end)<p>* Application Developer (More front-end)<p>* Technical Content Creator (&#x27;Developer Advocacy&#x27; type of role)<p>For the full postings checkout <a href=\"https:&#x2F;&#x2F;compose.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;compose.io&#x2F;jobs</a> or email jobs+hn@compose.io with a quick tale about a database you loved, or didn&#x27;t love.<p>If you have any questions, we&#x27;ll gladly answer whatever you&#x27;d like. Everyone gets a personal response and a fair, respectful &#x27;go&#x27; at the process.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822417", 
        "user": "grayfox"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Secure Mission Solutions - REMOTE<p>We&#x27;re looking for a Linux System Engineer to help maintain our Linux servers and VMs, perform deployments of our production applications, and diagnose and fix problems.  If you have software development experience as well, we&#x27;ll also find a way to put that to good use.<p><a href=\"http:&#x2F;&#x2F;smsjob.nfshost.com&#x2F;syseng.html\" rel=\"nofollow\">http:&#x2F;&#x2F;smsjob.nfshost.com&#x2F;syseng.html</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10823061", 
        "user": "bluellama"
    }, 
    {
        "address": "Los Angeles, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Ticketmaster Senior Software Engineer - Hollywood&#x2F;Los Angeles, California\nWe&#x27;re improving Ticketmaster from the ground up. We need smart, ambitious engineers to build out new infrastructure for high demand ticket sales and global API services.<p>The Role:<p>We&#x27;re looking for a strong Senior Software Engineer who can thrive in a fast paced environment to join the newly minted Distributed Commerce team. We are building new API products that enable third parties to sell verified tickets off-site, on many of the largest platforms and websites in e-commerce and online media. Our group&#x27;s goal is to sell more than 10M+ tickets in 2016, utilizing purpose-built transactional and content APIs, as well as developing SDKs and transactional widgets that will empower mobile apps, social networks, and 3rd-party ticketing partners while increasing the exposure of the Ticketmaster brand.<p>Technologies and standards we use, which you should be familiar with:<p>Java, Spring, Amazon Web Services (EC2, ELB, Cloudformation), Linux, Docker, REST, OAuth, MySQL, JavaScript, Python.<p>Qualifications:<p>- 5+ years professional hands on software development experience, with 3+ years specifically utilizing Java and 2+ years of web services applications&#x2F;systems experience<p>- Experience with high-volume applications&#x2F;systems requiring 24&#x2F;7 uptime<p>- Experience in developing loosely coupled systems (REST APIs, SOA, microservices)<p>- Experience with Amazon Web Services<p>- Strong software development process background Scrum and&#x2F;or Kanban.<p>Email ryan.aviles@ticketmaster.com for details. <i>No recruiters please</i><p>-----", 
        "h1b": false, 
        "intern": false, 
        "lat": 34.0522342, 
        "location": "Los Angeles, California", 
        "lon": -118.2436849, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822740", 
        "user": "tmjobs"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Tradeshift | Full Time | ONSITE - Many positions - San Francisco, CA; Copenhagen, Denmark; Suzhou, China | <a href=\"http:&#x2F;&#x2F;tradeshift.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tradeshift.com&#x2F;jobs&#x2F;</a><p>Growth-stage startup (about 80 engineers) in rapid growth stage (130M funding so far).  We are building B2B network for supply chain management (500,000 businesses on there already), and a PaaS (Think LinkedIn or B2B crossed with Force.com).  Growing very rapidly, but still small enough to make huge impact.  Working with a number of Fortune 100 companies on projects of immense complexity and scale. Micro-services architecture with multiple data centers.<p>Looking for front end, full stack, and backend engineers.<p>We just launched our engineering blog that gives an overview of the types of challenges we are working on - <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;tradeshift-engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;tradeshift-engineering</a><p><a href=\"http:&#x2F;&#x2F;tradeshift.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tradeshift.com&#x2F;jobs&#x2F;</a><p>One special focus is looking for engineers in San Francisco with experience with financial systems (i.e. payments) for an exciting new project.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822686", 
        "user": "jbarmash"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Doist - <a href=\"http:&#x2F;&#x2F;doist.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;doist.com&#x2F;</a> - REMOTE<p>We have 4 development positions open: Front-end, Backend (Golang), iOS and Windows Dev.<p>At Doist, we specialize in productivity software. We create tools that simplify and organize the day. Our main mission is to help people become more organized and productive. We have made Todoist, one of the most popular task management apps.<p>Contact me at amix@doist.com if interested.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822117", 
        "user": "amix"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Kensho: Boston, MA (Cambridge), New York, NY (NYC), San Francisco (SF), Stamford, CT: FULL TIME Software Engineers, Data Scientists (esp. Machine Learning or NLP), SRE, SET, or UI Designers ONSITE<p>Kensho&#x27;s growing engineering team [0] overlooks Harvard Sq. We are making financial analysis faster, accessible, intuitive and beautiful through our partnerships with Goldman Sachs [1] and CNBC [2].<p>Please say hello at <a href=\"https:&#x2F;&#x2F;kensho.com&#x2F;#&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.com&#x2F;#&#x2F;careers</a>\nTo really get our attention:<p>* Engineers: Prolific technologists who think sharply, code swiftly, and are never blocked on small problems. Major bonus points for experience with sophisticated timeseries analysis or scaling content ingestion pipelines.<p>* Data Scientists: Experience at-scale with machine learning, NLP or modeling (PhD preferred).<p>* UI Designers: A portfolio&#x2F;demo that shows how you would display complex data in intuitive, beautiful and engaging ways.<p>Technologies we use:<p><pre><code>  * python, pandas, numpy, scipy, scikit-learn, nltk, et al.\n\n  * Javascript, React, d3, canvas\n\n  * Google Cloud Platform\n\n</code></pre>\nMatt<p>[0] <a href=\"http:&#x2F;&#x2F;kensho.com&#x2F;#team\" rel=\"nofollow\">http:&#x2F;&#x2F;kensho.com&#x2F;#team</a><p>[1] <a href=\"http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;features&#x2F;2015-07-28&#x2F;how-goldman-sachs-became-a-tech-investing-powerhouse\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;features&#x2F;2015-07-28&#x2F;how-goldma...</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;kensho</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822150", 
        "user": "0xa"
    }, 
    {
        "address": "Paris, France", 
        "country": "FR", 
        "freshness": true, 
        "full_html": "VideoLabs&#x2F;VLC • Paris, France • Developers • iOS, Android, Go and C&#x2F;C++ • Onsite|Remote<p>We&#x27;re a team working on open-source multimedia technologies (VLC&#x2F;FFmpeg) and new services around video consumption.<p>We&#x27;re mostly working on VLC (we did most of the mobile&#x2F;tv versions of VLC) and other multimedia technologies like FFmpeg. A large part of our activities is also on new web services around video consumption (content, recommendation, etc...).<p>We&#x27;re now a team of 13, (9 in Paris, 4 Remote) and we will probably need to hire a few (4?5?) new developers or tech team lead, starting from the middle of January. Remote is OK, if in Europe.<p>There should be a position for iOS, one for Android, one in low-level C&#x2F;C++ for VLC&#x27;s core and codecs, one as a front-end developer (ng) and one in Go.<p>Email: contact+hn@videolabs.io", 
        "h1b": false, 
        "intern": false, 
        "lat": 48.856614, 
        "location": "Paris, France", 
        "lon": 2.3522219, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822355", 
        "user": "jbk"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Sameroom | <a href=\"https:&#x2F;&#x2F;sameroom.io\" rel=\"nofollow\">https:&#x2F;&#x2F;sameroom.io</a> | full-time REMOTE<p>Sr. Emoji Engineer: <a href=\"https:&#x2F;&#x2F;sameroom.io&#x2F;blog&#x2F;wanted-sr-emoji-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sameroom.io&#x2F;blog&#x2F;wanted-sr-emoji-engineer&#x2F;</a><p>We make chat work across providers. Each provider preaches its own emoji religion. We&#x27;re looking for an emoji translation expert to help Sameroom relay as much meaning as possible.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10823011", 
        "user": "rekoros"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Cram Fighter | Boston, MA | Full-time | Onsite<p>What we do:<p>We help students become the best versions of themselves by enabling them to be more efficient and better manage their time. We do this through web and mobile apps that let students create personalized study schedules for high-stakes exams.<p>What we&#x27;re about:<p>We&#x27;re a bootstrapped, profitable company with thousands of paying customers. We&#x27;re obsessed with building great products and pushing the boundaries of learning. We focus on an open company culture (everyone gets to see revenues, targets, etc.) and strong work&#x2F;life balance.<p>What we&#x27;re looking for:<p>* A senior software developer who is interested in tackling important problems in education<p>* Looking for someone who is proficient in Django<p>* React experience is a plus<p>More info:<p><a href=\"http:&#x2F;&#x2F;cramfighter.com&#x2F;careers&#x2F;senior-software-developer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cramfighter.com&#x2F;careers&#x2F;senior-software-developer&#x2F;</a>. Send any questions my way (email is in my profile).", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822768", 
        "user": "amitmathew"
    }, 
    {
        "address": "Seattle, WA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Rover.com - Full Time - Seattle, WA - Full Stack Engineer<p>Rover.com is a place where dog owners can find and book dog sitters in their area. We help owners find quality sitters and facilitate the entire experience, so dog owners can comfortably travel without worry about the well-being of their furry family members.<p>We are a rapidly growing and well-financed startup founded and based in downtown Seattle. We&#x27;re looking for an experienced Django&#x2F;Python developer who has experience with one of the following: split testing, search algorithms and&#x2F;or machine learning.<p>Our style:<p>- Dogs in the office. Bring yours, too!<p>- Lightweight, Agile processes constantly improved with retrospectives.<p>- Fully automated testing and deployment system. Just merge your branch and it ships.<p>- Integrated teams with developers and designers work side-by-side.<p>- Data-driven decision making with A&#x2F;B testing.<p>If you’re up for all of this and ready to hang out with a bunch of dogs, give us a shout. We’re excited to hear from you!<p>This position is based at Rover HQ in Downtown Seattle. Competitive salary &amp; benefits depending on experience. Candidates must be eligible to work in the US. To join the team at Rover, check out <a href=\"http:&#x2F;&#x2F;jobs.rover.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.rover.com</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.6062095, 
        "location": "Seattle, WA", 
        "lon": -122.3320708, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822089", 
        "user": "wolfpac444"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Mozilla Research | Intern | Bay Area, Paris &amp; Toronto<p>We are looking for PhD or MS level interns to take on various projects within our Research Group: Rust, WebAssembly, Daala, Servo and more.<p>Past interns have done substantial work in Language Design, Compiler Optimizations, Garbage Collection, Static&#x2F;Dynamic Analysis, Record-and-Replay Debugging, Parallel Algorithms, Video Codecs, and Web Application Optimization.<p>Apply at:<p><a href=\"https:&#x2F;&#x2F;careers.mozilla.org&#x2F;en-US&#x2F;position&#x2F;oj092fwe\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.mozilla.org&#x2F;en-US&#x2F;position&#x2F;oj092fwe</a>", 
        "h1b": false, 
        "intern": true, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822954", 
        "user": "mbebenita"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "CryptoMove | San Francisco Bay Area | Fulltime | Onsite<p><pre><code>    === WHO WE ARE ===\n</code></pre>\nWe are taking a fundamentally different approach to data security, by intelligent distributed data concealment rather than leaving data at rest.<p>Our core technology is built in a distributed programming language, Hello, that we invented.  We&#x27;re very early -- still less than ten people.<p>We&#x27;re well-funded by angels from Cyphort, Kenna Security, Cisco, angels who seeded Palantir and Airware, and our team has 4 exits, including Twitter&#x27;s IPO, an acquisition by Twitter, and an acquisition by Cisco.<p><pre><code>    === WHO WE ARE LOOKING FOR ===\n</code></pre>\nWe&#x27;re looking for additional developers to help us build out our API, integrate our technology and build interfaces with large enterprise customers, and work on security projects.<p>Lots of fun, lots of challenging work to do, and deep tech.<p><pre><code>    === SOME JOB POSTINGS ===\n</code></pre>\nHere are our current job postings on AngelList:<p>Back-end&#x2F;platform: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1PBde18\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1PBde18</a>\nServices&#x2F;full-stack: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1R29BTs\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1R29BTs</a>\nSecurity: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1YTQwHp\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1YTQwHp</a><p><pre><code>    === HIT US UP! ===\n</code></pre>\nEmail our CEO mike at cryptomove dot com and mention Hacker News in the subject line to learn more.<p>Thanks!<p>-CryptoMovers<p>p.s. more on Hello: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;22yZ9qn\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;22yZ9qn</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822682", 
        "user": "bburshteyn"
    }, 
    {
        "address": "Toronto, ON, Canada", 
        "country": "CA", 
        "freshness": true, 
        "full_html": "Top Hat | Toronto, ON, Canada | Full-time<p>Top Hat is hiring for a couple roles: mobile dev (native iOS, Android), full-stack web developer (Python, Django, Javascript, NodeJS), and test engineer (test automation framework management). We also hire interns so please feel free to apply for that as well. Salary ranges based on experience from $70k to $100k.<p>We&#x27;re a profitable (and valley VC funded by some of the best funds in the world) education startup that helps make class more engaging. We&#x27;ve got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>If you&#x27;re not based in Canada or the US but are willing to relocate feel free to contact us, because we do cover relocation expenses and will help you manage the work permit process.<p>Send your resume&#x2F;github account to stephanie.kessler at tophat dot com.", 
        "h1b": false, 
        "intern": true, 
        "lat": 43.653226, 
        "location": "Toronto, ON", 
        "lon": -79.3831843, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822287", 
        "user": "wahnfrieden"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Uber ATC (Advanced Technology Center) | Pittsburgh, PA | Full-time | Onsite<p>Uber ATC (<a href=\"http:&#x2F;&#x2F;www.uberatc.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.uberatc.com&#x2F;</a>) is committed to work at the cutting edge in mapping, safety, and autonomy. Come help shape the future of transportation with us!<p>We are hiring across the board! Positions include Machine Learning Specialists, Data Scientists, Full Stack Engineers, Python&#x2F;C++ Engineers, Dev Tools and Infrastructure, Perception, Localization, Motion Planning, Radar, Video and Compression, Network Engineering and many more that you can find here <a href=\"https:&#x2F;&#x2F;careers-uber.icims.com&#x2F;jobs&#x2F;search?ss=1&amp;searchKeyword=atc\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-uber.icims.com&#x2F;jobs&#x2F;search?ss=1&amp;searchKeywor...</a><p>Feel free to email me at achao@uber.com with your resume, the position(s) you are interested in, and a few sentences of why you&#x27;d be #superpumped to join our team!", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Pittsburgh, PA", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822734", 
        "user": "achao"
    }, 
    {
        "address": "San Mateo, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Datanyze | San Mateo, CA | ONSITE | All roles from sales to engineering (including VP level)<p>Hi everyone! Jon from Datanyze here. We are NOT your average startup! We bootstrapped the company past $1 million in annual recurring revenue, then raised a seed round (about 18 months ago) from some great investors, including Google Ventures and Mark Cuban!<p>We take our work seriously, but not ourselves. We know when to work hard and when to play hard (we just got back from taking the whole team to Vegas for hitting a big milestone!) and we&#x27;re having a blast building amazing solutions for sales and marketing teams.<p>We have open positions for everything from entry-level sales and support to VPs of various departments (engineering, sales, marketing, etc.).<p>If you want to hear more or know someone amazing who might be interested, please email me directly at jon@datanyze.com!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.5629917, 
        "location": "San Mateo, CA", 
        "lon": -122.3255254, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822272", 
        "user": "jonhearty"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Binti | Software Engineer | SF | Onsite | Full-Time | Will transfer existing v1sa<p>By dramatically reducing the time and expense required to adopt a child, Binti aims to help more children find loving homes and make adoption a mainstream choice for people building families.<p>We are moving urgently, shipping web software our customers love (and pay for!), and having a lot of fun. I hope you will join us!<p>More info: <a href=\"https:&#x2F;&#x2F;binti.com&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;binti.com&#x2F;careers&#x2F;software-engineer&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822947", 
        "user": "gkop"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Captain401 (YC S15) | San Francisco, CA | Full Time | ONSITE<p>We&#x27;re building the perfect retirement savings plan for startups and small businesses. We’re following in the footsteps of great companies like Gusto (formerly ZenPayroll) and Zenefits in making essential HR administration a snap for businesses large and small, and like Wealthfront, in making sound investing strategy accessible to everyone.<p>We also just closed a substantial seed round from top investors, but we’re currently just six people. If you’ve been wanting to dive into an early stage startup, this is the perfect time to start talking to us.<p>We have a lot of open roles, so we&#x27;d love to hear from anyone interested to working with us. Specifically, we&#x27;re looking for Account Managers (entry level welcome!), Growth Marketers, Designers, and JavaScript engineers.<p>Reach out to careers@captain401.com, or apply at <a href=\"https:&#x2F;&#x2F;captain401.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;captain401.com&#x2F;careers</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822162", 
        "user": "roger_lee"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Periscope Data | San Francisco, ONSITE | Full Stack Engineer (Ruby, Go, CoffeeScript, Java) | <a href=\"https:&#x2F;&#x2F;www.periscopedata.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.periscopedata.com&#x2F;</a><p>Periscope is a data analysis tool for data analysts that allows them to type SQL queries and get charts really, really fast. Revenue has doubled twice in the last 6 months. We have gone from jumpstarting our car to hanging on as the car races up the hill.<p><pre><code>    - In your first day you&#x27;ll ship new code to production.\n\n    - In your first week you&#x27;ll ship at least one customer-facing feature.\n\n    - In your first month you&#x27;ll write code at every level of the stack.\n\n    - In your first 6 months you&#x27;ll rebuild a major piece of the Periscope stack.\n</code></pre>\nJoin our team of 19: hello@periscopedata.com<p>More info: <a href=\"https:&#x2F;&#x2F;www.periscopedata.com&#x2F;data-obsessed-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.periscopedata.com&#x2F;data-obsessed-engineer</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822139", 
        "user": "mopatches"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Cognii - Boston, MA | Remote OK<p>Cognii is transforming online education with AI technology. We are adding a few engineers to meet the growing demand:<p>1. NLP&#x2F;AI Research Engineer<p><pre><code>  - natural language processing\n\n  - statistical machine learning\n\n  - syntactic and semantic analysis\n\n  - information extraction\n</code></pre>\n2. Back-end Engineer<p><pre><code>  - Design and implement the web platform for interactive learning\n\n  - Data pipeline workflow optimization\n\n  - Experience with Ruby and Rails&#x2F;Sinatra\n</code></pre>\nEdTech experience is a plus. Compensation includes significant amount of equity. \nPlease send your resume and queries to jobs@cognii.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822862", 
        "user": "kanny96"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "BetterWorks | Palo Alto &#x2F; San Francisco &#x2F; New York | Multiple Positions | Onsite<p><a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4ko0ch\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4ko0ch</a><p>We are looking for a passionate engineer to help solve some of our challenges. These challenges include: balancing speed of implementation, simplicity, polish, building sophisticated features (data visualization, collaboration, etc.) to support our users.<p>Joining us at this stage means you have the opportunity to choose your own adventure and to contribute in areas beyond engineering, like customer development and success.<p>What you will work on:\n* Implementing new frontend product features using AngularJS, and backend APIs using Django\n* Iterating with our interaction and visual designers to refine user experience\n* Writing AngularJS and Django unit tests to have coverage on features\n* Hack on a wide range of interesting technical and business projects\n* Profiling server and database to identify and correct performance bottlenecks\n* Integrating with third party web services<p>What will help you be successful:\n* Ability to manage time efficiently and focus on clear goals\n* Pragmatic approach towards tackling unforeseen challenges\n* Experience with Javascript MVC frameworks such as Backbone, Angular or Ember\n* Experience with CSS, LESS and Bootstrap\n* Experience with creating visualizations using D3\n* Experience with Django, Python, Postgres, and Heroku\n* Experience with SQL\n* Infinite appetite for learning", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822460", 
        "user": "mixer"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Conversify (<a href=\"http:&#x2F;&#x2F;www.conversify.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.conversify.com</a>)<p>Where: Groningen (NL) or REMOTE<p>Looking for a fulltime Chief Intelligence Officer &#x2F; Data-scientist.<p>Conversify is helping e-commerce sites with optimizing their conversions by using persuasion. We have tons of data, big customers and a stack consisting of: MongoDB, Python, Django, JavaScript, Postgres and much more ;-).<p>You: Fluency in Python (numpy&#x2F;scipy), MongoDB, R or Matlab and Django.<p>More info?<p>E: bart[at]conversify.com<p>Skype: bkappenburg", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822529", 
        "user": "bartkappenburg"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Issuer Direct | Full Stack Engineer | Raleigh &#x2F; RTP NC | Full-Time ONSITE<p>We are a small micro-cap public company (NYSE: ISDR) and have been growing steadily since 2006.  We specialize in helping other public companies with their compliance and communication needs.  As a full stack engineer, you will be writing web applications that affect how thousands of public companies get their work done and how millions of shareholders interact with those companies.<p>Our software development team consists of 8 experienced developers working in an open, collaborative workspace.  We pride ourselves on staying on the edge of technology, constantly tinkering with new software and commonly integrating it into production (most of our sites are already served using HTTP&#x2F;2).  We have fully embraced the Docker &#x2F; containerization approach to software development and run all of our micro services through Kubernetes.<p>Motivation to work hard, learn, and share what you know are our most important values.  Our newest project involves building a real-time web application.  Experience with PHP, Python, Go, MySQL, Redis, and HTML &#x2F; JS &#x2F; CSS are a plus.  Please include links or descriptions of projects you have worked on in the past.  Send applications to me directly at caleb.lloyd@issuerdirect.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822485", 
        "user": "caleblloyd"
    }, 
    {
        "address": "Warsaw, Poland", 
        "country": "PL", 
        "freshness": true, 
        "full_html": "Full-Time Frontend Engineer | Warsaw, Poland<p>codebeat (<a href=\"https:&#x2F;&#x2F;codebeat.co\" rel=\"nofollow\">https:&#x2F;&#x2F;codebeat.co</a>) is a developer-oriented static code analysis startup. We&#x27;re primarily backend engineers and computer scientists (ex. Google &amp; Facebook) and have developed a set of state of the art algorithms for language-agnostic static code analysis. We built an MVP around it which we quietly launched (supporting Ruby and Go for now) but we badly need help with frontend magic.<p>YOU are proficient with JavaScript and are comfortable with different frontend frameworks. Our current frontend is built using Marionette and Backbone so we&#x27;d like you to be able to jump right in. In the long run however we would like you to cleanly rewrite the frontend using the technology of your choice. Our primary working language is English and so we require working proficiency.<p>We are a startup but we&#x27;re fully funded and we can ensure that the successful candidate is happy with their renumeration and benefits package. International candidates with EU work permit are more than welcome provided they&#x27;re willing to move to Poland.<p>If this sounds interesting please kindly send me your resume to marcinw[at]codebeat[dot]co.", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.2296756, 
        "location": "Warsaw, Poland", 
        "lon": 21.0122287, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822520", 
        "user": "fishnchips"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Full-Time Business Development Manager | ANY MARKET (US)<p>About the job:<p>You are an A Type personality with the ability to adapt to changing situations.\nYou love working on the next big thing in marketing.\nYou are a creative thinker who knows how to speak intelligently about technology driven engagements.\nYou work independently, but can take direction easily.\nHelps develop processes and tools that help drive inbound leads<p>About you:<p>5+ years experience in business development\nBA in Marketing or equivalent\nExcellent verbal and written skills\nProven track record of success\nUp-to-date understanding of the current emerging tech trends\nAbility to work with a team as well as independently\nLikes working in a fun environment\nAbout working @ Plunk:<p>Plunk is a group of passionate individuals who work hard and play hard. We are a growing company who is planting our flag in the marketing world. You will enjoy a great team with a passion for helping our clients change the way they interact with their customers.<p>We are located on the SE side of Portland with easy access to public transportation. Our office is small, but features great local eats, bike parking, and easy access to the east esplanade walking path. We offer great compensation as well as an equity stake in the company. Our success is your success.<p>How to apply:<p>Send us your resume\nTell us about your successes\nTell us about your failures\nSend to jobs@plunkus.com and we’ll reach out if you are a fit", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822430", 
        "user": "pla3rhat3r"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Meta | Boston, MA | full time | onsite preferred<p>Meta is building a platform that allows users to seamlessly search for, access, and share files across all cloud platforms and devices; in essence, Google for your files. We’ve closed a seed funding round and are looking for talented developers to help us scale our MVP and take our platform to the next level.<p><a href=\"https:&#x2F;&#x2F;www.meta.sc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meta.sc</a><p>We have exciting development work ahead of us in nearly every area imaginable, including responsive client-side web development, a microservices-based cloud architecture written in Go and Python, performance-critical native client applications, a lightning fast personalized search engine, and complex data science problems in semantic analysis and information retrieval.<p>We’re right in downtown Boston and looking for talented developers and computer scientists to join us. Offering competitive salaries and large equity compensation. Email us at careers@meta.sc and check out our careers page at <a href=\"https:&#x2F;&#x2F;www.meta.sc&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.meta.sc&#x2F;careers</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822530", 
        "user": "kujenga"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Potato are hiring front end web (often using AngularJS) &amp; Python (mainly Django) developers plus UX designers &amp; project managers ONSITE across our offices. VISA potentially available for working in the US for British passport holders. Freelance &amp; fulltime available.<p>We&#x27;re a 6yr old, 100 person agency based in London, UK with offices in Bristol, UK &amp; San Francisco Bay Area. Our clients include Google, PayPal, Skype, a number of startups and other agencies such as BBH &amp; Mother.<p>Our work spans (and sometimes defies) categorisation. Recent interesting projects include tracking an Antarctic expedition, organising the world&#x27;s artworks, mapping DDoS attacks and Syrian regime defections, and aiding rapid collaboration inside companies.<p><a href=\"https:&#x2F;&#x2F;p.ota.to&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;p.ota.to&#x2F;jobs&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822107", 
        "user": "jasoncartwright"
    }, 
    {
        "address": "Washington, DC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "VaxTrac | QA Software Engineer | Washington, DC | ONSITE<p>VaxTrac is looking for talented QA engineer who shares our passion for making a difference in the world. We build tools to improve the delivery of health care to those that need it most. QA Engineers at VaxTrac are the primary conduit between our users and Software Engineers. They condense many, sometimes unclear, reports into actionable bugs. Once a fix is applied, the QA engineer tests the software and generates relevant documentation about the fix for internal teams and external users.<p>QA Engineers are primarily responsible for: maintaining the bug-fix lifecycle, gathering supporting technical information from field reports, improving processes for bug reporting and features requests, testing fixed bugs for completeness, maintaining changelogs and providing technical support for the coordination of trainings.<p><i>We are looking for those who</i><p>+ Are committed to using their skills to generate real social impact.<p>+ Have an interest and passion for emerging technologies and novel use cases.<p>+ Thrive in loosely structured environments.<p>+ Share the conviction that we can make the world just a little bit better.<p><i>Skills and Requirements</i><p>+ Experience programming web, mobile or desktop applications<p>+ Extraordinary skill in distilling and communicating complex concepts<p>+ Eagerness to travel and spend time in remote corners of the globe<p><i>Bonus points</i><p>+ Experience writing or testing native Android applications<p>+ Demonstrable programming talent<p>+ Computational data analysis experience<p>+ A keen eye for visual elements and design<p>+ French language fluency<p>+ Primary or secondary technical support experience<p>+ Bachelor&#x27;s degree or higher in a technical discipline<p>Please email your updated resume and cover letter as attachments to careers@vaxtrac.com with “QA Engineer” as the subject of the message.", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.9071923, 
        "location": "Washington, DC", 
        "lon": -77.0368707, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822760", 
        "user": "vaxtrac"
    }, 
    {
        "address": "Denver Ave S, Seattle, WA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Coalfire | Denver, Seattle, Atlanta | Full-time | Onsite<p>Coalfire is a security company who is always looking for skilled penetration testers. We have positions from junior penetration tester up to senior based on experience. We absolutely hire people with no previous professional security experience as long as you prove that you have the passion for it through previous self-taught experience. Our clients include Fortune 50s and travel is maybe 20% of the deal. We do web application hacking, network hacking, even full-blown red team operations where essentially anything goes. You should see our lock picking cabinet.", 
        "h1b": false, 
        "intern": false, 
        "lat": 47.5586582, 
        "location": "Denver, Seattle,", 
        "lon": -122.3309144, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822794", 
        "user": "DanMcInerney"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Data Engineer • Assembled Brands • NYC • REMOTE • Full Time<p>Assembled Brands is seeking a data engineer to lead development of our growing data science operation. Our data warehouse and associated analytics infrastructure supports business decision making across all of our ecommerce, fashion, and lifestyle brands.<p>You will be directly responsible for working with department heads to service requests for data and will use BI tools like Looker to help setup self-service report access for analysts. You&#x27;ll be responsible for data enrichment projects along with manipulation and cleaning of data. You&#x27;ll work with the rest of the engineering team to ensure the needs of our data analysts are implemented when new software projects are architected. Above all, you&#x27;ll be responsible for ensuring enterprise-wide confidence in our data and the decisions we make using it.<p>Candidates should be SQL experts and familiar with Ruby or Python. Advanced Excel knowledge will be required simply to help transition business units off of Excel dependence. Familiarity with common ecommerce data sources such as Google Analytics MailChimp is a plus. Above all, applicants should have impeccable communication and organization skills, as they will be working with many people across the business to help them measure and meet their goals.<p>Send a resume to colin@assembledbrands.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822385", 
        "user": "colinbartlett"
    }, 
    {
        "address": "Paris, France", 
        "country": "FR", 
        "freshness": true, 
        "full_html": "Weroom (<a href=\"https:&#x2F;&#x2F;wwww.weroom.com\" rel=\"nofollow\">https:&#x2F;&#x2F;wwww.weroom.com</a>) | Front-end developer | Paris, France | ONSITE<p>Weroom is seeking a Front-end developer (Engineer or BSc with at least 2 years of professional experience). \nIn a team of 6 developers, you will build and maintain our main application and our ecosystem of apps.<p>Weroom is the first international social platform dedicated to flatsharing. We help people find a place to live but most importantly people to live with!<p>This year will be full of challenges: you will learn a lot, quickly.<p>You can find the Weroom&#x27;s stack here : <a href=\"http:&#x2F;&#x2F;stackshare.io&#x2F;weroom&#x2F;weroom\" rel=\"nofollow\">http:&#x2F;&#x2F;stackshare.io&#x2F;weroom&#x2F;weroom</a> . Other languages and frameworks will be added once needed.<p>Job details : <a href=\"https:&#x2F;&#x2F;www.weroom.com&#x2F;fr&#x2F;jobs&#x2F;front_end_developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.weroom.com&#x2F;fr&#x2F;jobs&#x2F;front_end_developer</a><p>Feel free to send me an email for further details :<p>julien@weroom.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 48.856614, 
        "location": "Paris, France", 
        "lon": 2.3522219, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822486", 
        "user": "tildedash"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Shyp | San Francisco, CA | ONSITE or REMOTE | Full Time<p>Front-End Engineer<p>Shyp is using a combination of technology, logistics, and outstanding customer service to make it easy for people and businesses to send things to each other.<p>As a core member of our front-end team, you&#x27;ll be responsible for helping take our web projects to the next level. You&#x27;ll be working closely with designers and engineers to architect, build, and maintain our suite of web products and tools, both external and internal. We&#x27;re still a small team, which means this is an opportunity to take on a big role and have huge impact.<p>If you&#x27;re interested in modern web standards, writing performant and modular code, and pushing the boundaries of the browser, we&#x27;d love to meet you.<p>Check out our job posting and apply @ <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;shyp&#x2F;b701bc7b-b920-4fd9-98d0-359f704904ca\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;shyp&#x2F;b701bc7b-b920-4fd9-98d0-359f70490...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822513", 
        "user": "dylanpyle"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Evergage | <a href=\"http:&#x2F;&#x2F;evergage.com\" rel=\"nofollow\">http:&#x2F;&#x2F;evergage.com</a> | Somerville&#x2F;Cambridge&#x2F;Boston, MA | Full Time | ONSITE<p>We power real-time personalization and recommendations through deep behavior analytics, on site and in app. Work with huge data volumes and build user friendly editing tools, machine learning and statistical analysis. Keep it all running 24&#x2F;7 and responding in &lt; 20ms.<p>Hiring: developers (web and backend), data science, solutions engineers, support lead and dev ops<p>Tech: Angular, Spark, ElasticSearch, Mongo, Java<p><a href=\"http:&#x2F;&#x2F;www.evergage.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.evergage.com&#x2F;careers&#x2F;</a><p>Thanks! (Greg - CTO)", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822706", 
        "user": "ghinkle"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Boston, MA | Sentenai | Full-time | On-site<p>Keywords: Haskell, Machine Learning, Distributed Systems<p>Sentenai a venture-backed startup hiring experienced Haskell engineers and architects who are passionate about distributed systems and applied Machine Learning. Sentenai is automating data engineering for companies building realtime, intelligent systems by building the data distribution network of the future.<p>Contact jobs@sentenai.com to learn more.", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822432", 
        "user": "ghc"
    }, 
    {
        "address": "Washington, DC, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "NotionTheory | <a href=\"http:&#x2F;&#x2F;notiontheory.com\" rel=\"nofollow\">http:&#x2F;&#x2F;notiontheory.com</a> | Washington, DC | Onsite &#x2F; Remote | Full-time &#x2F; Interns<p>We’re a team of talented engineers helping companies rapidly build and deliver their products to market in just 4 - 6 weeks. We&#x27;re looking to round out our team with someone who can continue to help elevate the quality of our work and relationships with our clients.<p>As part of the core team, you’ll be expected to help play the role of stand-in CTO to our clients.<p>In addition to being a kickass developer, you should also:<p>- Have a track record of developing and delivering products to market (while maintaining quality)<p>- Have a sense of product ownership and bring innovative ideas to the table for our company and our clients<p>- Not be afraid to say “I don’t know”. You routinely figure things out.<p>- Be seriously committed to helping build a startup, even though things won’t always be easy.<p>- Have an insatiable thirst to always be learning and experimenting<p>------<p>Fullstack Dev: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;notiontheory&#x2F;jobs&#x2F;49388-full-stack-software-developer?utm_source=profile_module_job_listing\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;notiontheory&#x2F;jobs&#x2F;49388-full-stack-software...</a><p>Mobile Dev (Hybrid): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;notiontheory&#x2F;jobs&#x2F;68285-hybrid-mobile-developer?utm_source=profile_module_job_listing\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;notiontheory&#x2F;jobs&#x2F;68285-hybrid-mobile-devel...</a><p>If you&#x27;re interested, you can apply by sending us an email to team@notiontheory.com  --  We&#x27;re happy to take interns for the positions above too.<p>Thanks,<p>Kristian (founder)", 
        "h1b": false, 
        "intern": true, 
        "lat": 38.9071923, 
        "location": "Washington, DC", 
        "lon": -77.0368707, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822490", 
        "user": "kbouw"
    }, 
    {
        "address": "00100 Helsinki, Finland", 
        "country": "FI", 
        "freshness": false, 
        "full_html": "Wolt | <a href=\"http:&#x2F;&#x2F;wolt.com\" rel=\"nofollow\">http:&#x2F;&#x2F;wolt.com</a> | Helsinki, Finland | ONSITE<p>We are working on making the food industry digital one meal at a time. Wolt helps people order restaurant food, takeaway or delivered. We are a small team of 25+ people expanding rapidly across Europe and there are already well over 300 Wolt venues. Wired chose Wolt as one of the hottest startups in Europe 2015.<p>We&#x27;re looking for full-time engineers of all sorts! Check out <a href=\"https:&#x2F;&#x2F;woltapp.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;woltapp.com&#x2F;careers&#x2F;</a>.<p>Tell them Kenneth sent you ;).", 
        "h1b": false, 
        "intern": false, 
        "lat": 60.17332440000001, 
        "location": "Helsinki, Finland", 
        "lon": 24.9410248, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822176", 
        "user": "kekeblom"
    }, 
    {
        "address": "Stockholm, Sweden", 
        "country": "SE", 
        "freshness": true, 
        "full_html": "Pilloxa | Stockholm, Sweden | ONSITE<p>Pilloxa is an eHealth IoT startup looking for app&#x2F;backend devs. We are in an early stage so a great opportunity to have a major impact on building the company and changing the eHealth industry.<p>Clojure(Script) (generally focusing on functional languages), React and possibly React Native for iOS&#x2F;Android.<p>Help us save lives!<p>recruitment (at) pilloxa.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 59.32932349999999, 
        "location": "Stockholm, Sweden", 
        "lon": 18.0685808, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822510", 
        "user": "vikeri"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "CMU Software Engineering Institute, CERT division | Pittsburgh, PA or Arlington, VA | ONSITE<p>Work with elite cybersecurity experts and university faculty to build new data mining technologies that will influence the national strategy against cyber attacks in the coming decades. Projects may include developing metrics and experimental designs for large-scale cybersecurity research programs, researching human-in-the-loop machine learning, and analyzing large corpora of cybersecurity incident data. You will co-author research proposals, execute studies, and present findings to DoD sponsors and academic conferences. Consider applying for this position if you are a proven data analyst with a firm grasp of statistical theory. Preference is given for expertise in computer science and cyber security, but it is not required.<p><a href=\"https:&#x2F;&#x2F;www.appone.com&#x2F;maininforeq.asp?R_ID=1100774\" rel=\"nofollow\">https:&#x2F;&#x2F;www.appone.com&#x2F;maininforeq.asp?R_ID=1100774</a><p>Carnegie Mellon University is an EEO&#x2F;Affirmative Action Employer – M&#x2F;F&#x2F;Disability&#x2F;Veteran.<p>Feel free to email with questions: ekanal+hn@cert.org", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Pittsburgh, PA", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822393", 
        "user": "eykanal"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Philo | SF | ONSITE | Hiring both front end and backend engineers<p>We&#x27;re a small team building the future of TV. Philo lets you watch your favorite shows on all the devices you care about with intelligent search, insightful discovery, and effortless sharing. We have access to the live content that Tim Cook can only dream of, and we have a small, dreamy product team building on top of it.<p>Our product is available to subscribers at a few small cable companies, and to hundreds of thousands of college students across the country. We&#x27;re growing fast, and will be dramatically expanding our residential offerings this year. If you want to see a demo, drop us a line.<p>Backend: We&#x27;re building a massive distributed video encoding platform that can ingest content from anywhere&#x2F;anything and spit out clean, beautiful DASH&#x2F;SS. We are a two person team that manages nearly 1000 machines in 50 datacenters, and we&#x27;re constantly adding more. If you like big infrastructure problems, we&#x27;ve got them.<p>Frontend: We&#x27;re building the cable box of the future on four different platforms (Web&#x2F;Roku&#x2F;iOS&#x2F;Android). Everybody does design&#x2F;product work, and we move very quickly.<p>We are not dogmatic, but here&#x27;s what our stack looks like right now: Lots of Ruby on the backend, some Python (Salt), and some C. We have React and its ilk on the fronted, along with plenty of native code for iOS&#x2F;Android&#x2F;Roku.<p>Reach out here: <a href=\"http:&#x2F;&#x2F;philo.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;philo.com&#x2F;careers</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822295", 
        "user": "smadison"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Linkable Networks - <a href=\"http:&#x2F;&#x2F;www.linkablenetworks.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkablenetworks.com</a> - Boston, MA (office is in Fort Point Channel neighborhood) - Local Only (Work from home 3 days a week)\n(<a href=\"http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;102673&#x2F;senior-cloud-systems-engineer-linkable-networks\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;102673&#x2F;senior-cloud-sy...</a>)<p>* Position: Senior Systems Engineer<p>* Technology Stack<p>AWS, Ubuntu, Sharded MySQL, Java, RabbitMQ, Ansible, Puppet, Nagios, Cacti, Graphite<p>* Additional Info<p>We&#x27;re looking for solid system engineers to join our team and help us build out the next level of capabilities on our platform.  This is a job where you can make a big impact and take responsibility for a managing a cloud deployed SaaS product.<p>We have a broad range of customers from grocery giant SuperValu where we&#x27;re deployed with a first of its kind card-linked SKU offer solution to eBates where we enable in-store coupon redemption.  Our business is gaining substantial momentum so we&#x27;re hoping you&#x27;re as excited about the challenges of scaling for success as we are.<p>* Company Summary<p>Linkable Networks was founded on the premise that the disconnect between digital media and physical retail was a major gap in delivering a great experience to consumers. Since 2011, we’ve been nose-down building a scalable platform that provides brands and retailers the ability to engage, reward and incent their consumers directly and across any channel – online, mobile and in-store. We pioneered the concept of card-linked-offers and have taken it to the next level – always-on loyalty. Both our self-service and SaaS-based platforms enable the creation of actionable ads, coupons, offers, promotions, rebates and more that let you reward loyalty... not just discount a purchase. This is the future of Loyalty.<p>If this sounds interesting, please shoot me an email at coolgigs@linkablenetworks.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822574", 
        "user": "fortpoint"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Future Platforms (<a href=\"http:&#x2F;&#x2F;www.futureplatforms.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.futureplatforms.com</a>) - London UK - Onsite - Permanent - Full-time<p>iOS and Android developers.<p>Future Platforms is an award-winning digital agency specialising in mobile.<p>We&#x27;re looking for talented and driven iOS and Android developers to join our fabulous team on a range of projects for AAA-list clients including Domino&#x27;s Pizza, EE and the Premier League.<p>Experience of a busy agency is desirable, but most important is the personality and technical ability required to ship and maintain gorgeous apps that hundreds of thousands of users will love.<p>More details: <a href=\"http:&#x2F;&#x2F;www.futureplatforms.com&#x2F;careers&#x2F;mobile-developer-iosandroid&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.futureplatforms.com&#x2F;careers&#x2F;mobile-developer-iosa...</a><p>CV and intro to careers@futureplatforms.com, please mention Hacker News!", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822492", 
        "user": "hoskdoug"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Openvote | San Francisco, CA | ONSITE | Product Designer<p>We are looking for a talented product designer to work with us to build Openvote, the first crowd-voting platform for elections. We aim to make politics more inclusive and transform how campaigns work.<p>You will shape experiences over web, mobile, and touch; working with engineers, fellow designers, and closely with our CEO. You will take ownership of Openvote’s interaction and visual design—laying a foundational layer for future designers to work within.<p>Must Haves: Excellent interaction and structural design ability. You turn user needs and business goals into clear and compelling experiences. You’ve seen users struggle with your solutions, learned and adapted.<p>- Foundational visual design skills.<p>- Ability to take ownership of projects from start to finish<p>- Humility, maturity, lack of ego. You want to help grow a collaborative, optimistic, and supportive culture.\nNice to Haves:<p>- Strong visual design portfolio.<p>- HTML&#x2F;CSS&#x2F;Javascript chops. Ability to code the designs you produce for Web<p>- Experience working with data to inform design decisions. You can separate signal from noise and define metrics that matter.<p>- Qualitative user research experience. You can speak to anybody and everybody to identify needs, pinpoint hurdles in an experience, and use low resolution prototypes to get quick feedback towards a final solution.<p>Email sean@openvote.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822291", 
        "user": "seanmccann"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "General Assembly (<a href=\"http:&#x2F;&#x2F;generalassemb.ly\" rel=\"nofollow\">http:&#x2F;&#x2F;generalassemb.ly</a>) | New York, NY ONSITE &amp; REMOTE | Multiple Positions | Fulltime<p>General Assembly transforms thinkers into creators through education and opportunities in technology, business, and design. We offer classes, workshops, long-form courses, and events in worldwide markets including New York where we are headquartered, Atlanta, Austin, London, Hong Kong, Sydney, San Francisco, Los Angeles, Boston, Chicago, Seattle, Melbourne, and Washington DC. We also partner with Fortune 500 companies to spur innovation through increased digital fluency and more effective approaches to collaboration.<p>We have small, cross-functional product teams that are developing innovative new solutions to online education, and currently we have various open positions across the engineering organization that we are looking to fill. If you want to be part of a diverse team, working on challenging tasks, and want to help the world expand their knowledge to better themselves and their careers via education, drop us line. If you&#x27;re in New York City, let&#x27;s grab a drink or a coffee and chat!<p>See our full list of open positions ranging from engineers to designers to even teaching opportunities at <a href=\"https:&#x2F;&#x2F;generalassemb.ly&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;generalassemb.ly&#x2F;careers</a>. Please feel free to contact me directly with your resume and any questions at elliott . carlson - at - generalassemb.ly", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822217", 
        "user": "elliottcarlson"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Litmus | ONSITE in Cambridge, MA or REMOTE | C# and Ruby Devs\n<a href=\"http:&#x2F;&#x2F;litmus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;litmus.com</a><p>Litmus helps more than 100,000 marketers make email better. Our email creation, testing, and analytics platform empowers marketers, designers, and agencies to send emails with confidence.<p>Our backend is primarily C# with a mix of other stuff, our front end is a rapidly expanding Rails application.\nWe&#x27;re originally boot strapped and just took our first round of growth equity 10 years in and have big plans in 2016.<p>Ruby on Rails Developer: <a href=\"http:&#x2F;&#x2F;salted.theresumator.com&#x2F;apply&#x2F;fbXsX5&#x2F;Ruby-On-Rails-Developer-Remote.html?source=Litmus\" rel=\"nofollow\">http:&#x2F;&#x2F;salted.theresumator.com&#x2F;apply&#x2F;fbXsX5&#x2F;Ruby-On-Rails-De...</a>\n.NET Developer: <a href=\"http:&#x2F;&#x2F;salted.theresumator.com&#x2F;apply&#x2F;ZfR9Y0&#x2F;NET-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;salted.theresumator.com&#x2F;apply&#x2F;ZfR9Y0&#x2F;NET-Developer.ht...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822399", 
        "user": "devspade"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "CLVmetrics |Full Stack Engineer - Early Employee | Philadelphia and NYC | Onsite w&#x2F; some Remote<p>CLVmetrics is revolutionizing the way brands understand their customer base and their marketing initiatives by providing every marketer with an instant, accurate prediction of the long term, lifetime value of every customer. Our technology equips marketing professionals with the predictive intelligence they need to quickly and easily discover who their highest value customers will be in the future, retain those customers for the long term, and acquire more customers like them.<p>Our approach is horizontal and we&#x27;re taking our fast, accurate, and actionable predictive intelligence engine to companies of all sizes across many verticals. We are revolutionizing how marketers interact with hundreds of millions of customers each and every day. We need you as we are building a world-class team of engineers, data scientists, statisticians, marketers and more to bring this enterprise-grade predictive technology to life.<p>We are looking for Full Stack Engineers with a passion for dreaming up efficient and scalable cloud-based technologies and then making those dreams into a reality through elegant code. In a sea of open-source technology, you know the right tool for the job and if you haven’t used that tool before, you are eager to master it and add it to your arsenal.<p>You will be working directly with our statisticians and data scientists to push the boundaries of predictive models for customer lifetime value and consumer behavior in terms of both theory and implementation. As a full stack engineer, you’ll be developing different pieces of the application from our predictive intelligence engine through the user interfaces which companies to discover who will be their most valuable users in the future.<p>Our stack includes Python, C++, and Javascript and technologies we&#x27;re currently working with include:<p>- Apache Mesos<p>- Apache Spark<p>- React.js<p>Please email careers@clvmetrics.com to apply.<p>Also check out <a href=\"http:&#x2F;&#x2F;www.clvmetrics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.clvmetrics.com</a> to see more roles we&#x27;re hiring for including frontend and backend engineers as well as data scientists.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822718", 
        "user": "jbleich89"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "SEATTLE, WA. ONSITE.<p>AREA: Supply Chain Management does not get a lot of attention from the software people, which makes it a great business to be in - less competition means more time spent on customer problems.<p>PROBLEM: Small and mid-size manufactures from all industry verticals organize their data using Excel, publish paper catalogs using lengthy old-school methods, collect hand-written orders on paper, and get burned out waiting for a simple website to be published or even updated.<p>SOLUTION: Our product helps them to get with the 21st century - a cloud-based data management platform that helps and encourages organizing data and publish it at once to Paper, iPad, E-commerce, Excel, one-click always-up-to-date Web Sites, and other publishing targets; and to collect orders or interest-data in a well-structured, electronic manner.<p>ABOUT YOU: Come join us if you already know OR want to learn many of these things:<p>- Manufacturing and Wholesaling inner workings.<p>- Having regular direct contact with normal people, and learning to make exceptional software for them.<p>- Coding for E-Commerce interoperability (Amazon, Wayfair, Magento...)<p>- Creating client-side (JavaScript &#x2F; TypeScript) Excel-like web app.<p>- Coding in C# with ASP.NET MVC for the server side. This is not your father&#x27;s ASP.NET :)<p>- Architecting and Programming for Occasionally-Connected mobile devices. Cohesive coupling between ASP.NET MVC on the server and [iOS, Android, Windows 10] on the client.<p>- Helping us understand and implement a generalized solution for EDI.<p>- Integrating with paper publishing solutions (small runs).<p>CONTACT: jobs@amptab.com", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822342", 
        "user": "DenisM"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Ivy Softworks | Atlas | Seattle, WA &amp; San Francisco, CA | Full-time, ONSITE, VISA<p>Hey all,<p>Ivy Softworks is looking for talented, motivated team members in Seattle, WA and San Francisco, CA (SF SoMa). We&#x27;re a startup that builds startups and are providing an alternative to early stage venture capital though the creation of an Innovation Studio. We are looking for entrepreneurs seeking new adventures. Check out our website for open opportunities: <a href=\"http:&#x2F;&#x2F;www.ivysoftworks.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ivysoftworks.com&#x2F;careers&#x2F;</a><p>I’m also very happy to share that just last month we unveiled our first spinout, Atlas. So if you want to get a taste of what we’re working on, check out <a href=\"http:&#x2F;&#x2F;www.atlas.co&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.atlas.co&#x2F;</a> or one of the recent press articles:<p>* <a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;11&#x2F;24&#x2F;contextual-search-platform-atlas-is-ivy-softworks-first-spinoff&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;11&#x2F;24&#x2F;contextual-search-platform-...</a><p>* <a href=\"http:&#x2F;&#x2F;www.geekwire.com&#x2F;2015&#x2F;innovation-studio-ivy-softworks-unveils-first-product-atlas-search-engine-digital-life&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.geekwire.com&#x2F;2015&#x2F;innovation-studio-ivy-softworks...</a><p>Current open positions:<p><pre><code>    Platform Development Engineer\n    Software Development Engineer – OS Internals\n    Distributed Systems Engineer – Cloud Infrastructure\n    Infrastructure Operations Engineer\n    Distributed Graph Engineer\n    Software Development Engineer – OSX\n    Software Development Engineer – Test\n    Program Manager\n</code></pre>\nIf you are experienced and looking for a specialty not listed, we&#x27;re always on the lookout for those who our model resonates with strongly, so shoot us an email or reply here. Some of the languages we’re looking for: C, C++, Ruby, Python, Javascript, and more. We’re developing on Windows, Mac, and Linux. Positions are ONSITE.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822524", 
        "user": "Flammy"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Elastic (<a href=\"http:&#x2F;&#x2F;elastic.co\" rel=\"nofollow\">http:&#x2F;&#x2F;elastic.co</a>) • ONSITE &amp; REMOTE (Anywhere) • Front-end Developer • Full-time<p>Elastic, the company behind Elasticsearch and Kibana, is hiring.<p>We&#x27;re looking for front-end developers to work on Found, our Elasticsearch-as-a-service product offering. Today, Found runs primarily in public cloud environments like AWS, allowing customers to provision and scale Elastic clusters in a turnkey fashion. We also plan to bring this same simplicity of deployment and automation to customers who want to run and manage multiple Elastic clusters on-premise (in their own data centers). You will be contributing significantly to both initiatives.<p>To get there we need more developers with strong JavaScript skills, but we definitely prefer developers who also have other strong front-end development skills. Maybe security, design, UX, CSS, functional programming, testing, or something else?<p>This is an early role on a fast-growing team, so you&#x27;ll have a lot of impact from day 1. We&#x27;re a very remote team with developers in Australia, Poland, Norway, Denmark, Panama and several locations in the US.<p>We need someone to help innovate, lead and contribute to the front-end and user experience of our Elasticsearch-as-a-Service offering. You will also be integral in shaping the products we build, not just implementing specs.<p>Check out <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;javascript-engineer-found&#x2F;dT2u9oOSar5zktdG1ZS6tF\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;engineering&#x2F;javascript-...</a> for more info.<p>Additional information<p>- Extremely competitive pay<p>- Stock options<p>- An environment in which you can balance great work with a great life<p>- Passionate people building great products<p>- Employees with a wide variety of interests<p>- Your age is only a number. It doesn&#x27;t matter if you&#x27;re just out of college or your children are; we need you for what you can do.<p>- Distributed-first company with employees in over 23 countries, spread across 18 time zones, and speaking over 30 languages! Some even fly south for the winter :)<p>We&#x27;re also hiring several other positions: <a href=\"https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elastic.co&#x2F;about&#x2F;careers&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822033", 
        "user": "kjbekkelund"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Snowplow | REMOTE UTC-6 &lt;&gt; UTC+2 | Support Engineer<p>Our Managed Service offering has grown significantly over the last year, and we now orchestrate and monitor the Snowplow open source event pipeline (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;snowplow&#x2F;snowplow\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;snowplow&#x2F;snowplow</a>) for over 50 customers, many of them processing billions of events per month.<p>We are looking for our first full-time support engineer for the Snowplow Managed Service. There’s room for coding in this position, but you don’t have to be a coder to succeed in it: instead we are looking for candidates with analytical minds, high levels of customer empathy and an enthusiasm for troubleshooting problems and improving processes and systems.<p>Find out much more on our website: <a href=\"http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;support-engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;support-engineer.htm...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822364", 
        "user": "alexatkeplar"
    }, 
    {
        "address": "San Jose, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Viv Labs | Application Engineer | San Jose, CA | onsite<p>Viv is a next-generation virtual personal assistant, brought to you by the team that developed Siri. In addition to being far more capable and intelligent, Viv will provide a truly open platform and marketplace that lets any developer extend Viv&#x27;s capabilities for new domains and services.<p>We are looking for versatile, talented full-stack engineers who can create commercial-quality software with ease. As a Viv Application Engineer, you will use our advanced AI tools to add new capabilities to Viv, teaching it about new domains and services.<p>You like working individually and in small teams and you are constantly learning from and teaching those around you and in online coding communities. You have a broad experience with server-side Javascript, integrating with third party web services, and are experienced at data and object modeling. \nREQUIREMENTS<p>BS degree required, CS major is preferred\nExperience: 3+ years of commercial software development required\nFront-end technologies required: JavaScript, CSS, and HTML\nServer-side: JavaScript, and Web Services integration experience required\nStrong data and object modeling proficiency\nStrong CSS knowledge, able to quickly build out UI from specs&#x2F;sketches\nDesired:\nExperience developing mobile interfaces is a plus (iOS, Android)\nKnowledge of UI best practices, and an eye for aesthetically pleasing user interfaces from a design perspective is a plus\nExperience and interest in artificial intelligence technologies (including natural language processing, machine learning, knowledge modeling and reasoning) is a plus, but we&#x27;ll teach you what you need to know.<p>Apply @ viv.ai", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.3382082, 
        "location": "San Jose, CA", 
        "lon": -121.8863286, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822240", 
        "user": "danielsht"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Follow Up Boss | Full-time | San Francisco or REMOTE<p>We are seeking outstanding developers to join our small productive team building software used every day by sales teams. We practice Scrum with 1-week sprint cycles for faster development and feedback, chat in Slack constantly and meet in person on regular company retreats. Our roadmap is packed with UX improvements and new features with the goal of making the best product in its class.<p>We&#x27;re profitable, customer first and growing.<p>Director of Engineering (Hands-on) <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;2qweks\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;2qweks</a><p>Senior Front-end Engineer (React, Backbone) <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ka153c\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ka153c</a><p>Senior Full Stack Engineer (PHP, MySQL, Postgres, Redis, ElasticSearch) <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;kxyj0i\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;kxyj0i</a><p>Senior iOS Engineer (iOS client for SaaS product) <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;1hkbef\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;1hkbef</a><p>Product Manager <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;followupboss&#x2F;jobs&#x2F;142368#.Voam0pMrLC4\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;followupboss&#x2F;jobs&#x2F;142368#.Voam0...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822221", 
        "user": "corkill"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "TripleLift | NYC | ONSITE | Full Time | Lots of positions (jut ask!)<p>We&#x27;re a rapidly growing company in the quickly growing advertising space so if you&#x27;re interested in working with large systems and getting an understanding of how the modern web works it&#x27;s a great place to be. I realize that adtech isn&#x27;t the most world changing industry but in terms of engineering knowledge and dealing with all elements of the tech stack it&#x27;s pretty incredible and a good place to be.<p>There was also a post here on website bloat and we do try to keep things lean and simple - our goal is to strike that perfect balance between content consumers, publishers, and advertisers and we realize the industry&#x27;s in a pretty crappy spot right now and are trying to make it better.<p>Definitely reach out if you have questions: dgoldin@triplelift.com<p>Edit: Languages are Java, Scala, Python, JavaScript, some R, some PHP.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822414", 
        "user": "dangoldin"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "FundApps - <a href=\"https:&#x2F;&#x2F;fundapps.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fundapps.workable.com&#x2F;</a> - London, UK - Onsite - Permanent - Full-time.\nFundApps was recently recognised as one of the top 50 fintech startups in Europe. We sell a web service that automates financial regulatory compliance. We&#x27;re a company of 17 right now, and somewhat unusually are a bootstrapped startup are growing rapidly through acquisition of customers rather than funding. Current openings we have in London.\n-Full Stack UI Engineer -Infrastructure &#x2F; Ops Engineer -.NET &#x2F; Backend Engineer\nemail me direct - james.peters@fundapps.co if you have questions. Thanks!", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822525", 
        "user": "classyjim"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Lola Travel Company - <a href=\"http:&#x2F;&#x2F;lolatravel.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;lolatravel.com&#x2F;</a> | Web &amp; Server Developers | Boston, MA and Westford, MA | Full-time | On-site<p>Lola Travel is a well-funded team that is looking to build the next great travel company in Boston. We hire for the person, not for the role. We look for people who have excelled on teams, including multi-year commitments to teams which have built successful mass-market consumer technology products.<p>A critical part of our success is a special web app that we have in mind. We need some real wizards at building fast, reliable HTML+CSS+JS web applications and scalable&#x2F;reliable infrastructure to support our travel apps and web sites. Sorry, we are being coy about exactly what this app will do, but it something we think other folks are not paying attention to, and we don’t want to even bring it up.<p>If you join us, we promise this will be the most fun job of your career, and that you will be more productive here than you&#x27;ve been on any prior team. You will get to invent stuff, and to try it rapidly.\nMeet the team here: <a href=\"http:&#x2F;&#x2F;lolatravel.com&#x2F;team&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;lolatravel.com&#x2F;team&#x2F;</a>, complete job descriptions here: <a href=\"http:&#x2F;&#x2F;lolatravel.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;lolatravel.com&#x2F;jobs&#x2F;</a> and send us a note at hello@blade.net. Thanks!", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822096", 
        "user": "dougzor"
    }, 
    {
        "address": "Singapore", 
        "country": "SG", 
        "freshness": true, 
        "full_html": "Singapore Aircon - <a href=\"http:&#x2F;&#x2F;www.singapore-aircon.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.singapore-aircon.com&#x2F;</a> | part-time | Singapore, REMOTE<p>Singapore Aircon, a lifestyle business providing online booking for air conditioner servicing, is looking to bring on a new partner in Singapore. This business was started in 2010 as an experiment in providing an easy-to-use, online option for booking a service required by countless households every day, which otherwise tends to require phone calls, giving directions, and the like.<p>Since the founders are presently pursuing other opportunities, an opportunity now exists for someone interested in joining, or even taking over, our business on mutually agreeable terms. Our technology stack is a Clojure + jQuery app running on Google App Engine, so any relevant web development experience would be an advantage.<p>admin@singapore-aircon.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 1.352083, 
        "location": "Singapore, REMOTE", 
        "lon": 103.819836, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822361", 
        "user": "tacostakohashi"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Percolate<p>New York, NY | onsite, fulltime. San Francisco, CA | onsite, fulltime.<p>At Percolate, our vision is to create technology that builds the world’s best brands. Our mission is to be The System of Record for Marketing. And we’re achieving both with a team of smart, passionate and caring people working to deliver inspired marketing solutions from offices around the world.<p>We&#x27;re currently looking for:<p><pre><code>   * BE (Python&#x2F;Django) Developers\n   * FE (React) Developers\n   * Android Developers\n   * iOS Developers\n   * Designers\n   * Lots more \n</code></pre>\nDetails: <a href=\"https:&#x2F;&#x2F;percolate.com&#x2F;careers&#x2F;?gh_src=c4ua8m\" rel=\"nofollow\">https:&#x2F;&#x2F;percolate.com&#x2F;careers&#x2F;?gh_src=c4ua8m</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822481", 
        "user": "brentwatson"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Hightower Inc | New York (ONSITE) | Full Stack Engineers<p>We met one of our first engineers via HackerNews on this day two years ago (hi @erikwithfriends!) and since then have grown to a 20 person product team, and are still recruiting :)<p>Hightower is a workflow and collaboration platform for commercial real estate leasing. Hightower replaces clunky Excel and email workflows with a simple, beautiful and purpose-designed tool. In the past two years, we&#x27;ve grown from 3 to 65 people, raised $21 million from BVP, Thrive and RRE, and today power leasing at many city landmarks in New York, San Francisco and other cities around the world.<p>We&#x27;re hiring full stack developers to join our development team. You&#x27;ll be working in small collaborative groups with interaction designers and product managers at our SoHo office (pictures here: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;hno0mi\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;hno0mi</a>). Our stack is RoR and AngularJS and ~50% of our engineering team hails from Pivotal Labs &amp; ThoughtWorks.<p>Drop me a line if you&#x27;re interested in learning more about how we work, and what happened when a modern technology startup met an industry still playing catch up with the Internet - niall.smart (at) gethightower.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822145", 
        "user": "niallsmart"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Papertrail (<a href=\"https:&#x2F;&#x2F;papertrailapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;papertrailapp.com</a>) • REMOTE (US, EU) • Customer success engineer • Full-time<p>Help Papertrail make developers, sysadmins, and entrepreneurs happy. Papertrail provides log management as a service. We work with clued engineers at startups like GitHub, Instacart, and DNSimple.<p>Put smiles on the faces of ops-savvy customers. Combine your fantastic written voice with your knowledge of Linux (strace, tcpdump, package management, ..), TCP fundamentals, and at least one scripting language.<p>A big part of this job is showing your passion for and knowledge of a topic in casual, freeform emails. Be comfortable and personable in email. Big plus for a public online history (blog, Stack Overflow, Twitter, TinyLetter, whatever) or prior examples of personable yet technical writing, since past actions are the clearest indicator that you&#x27;ll be great at this and love doing it.<p>Our &quot;office&quot; is a Slack text chat channel, generally during the US Pacific (UTC-8) day. Work in a coffee shop without missing office conversation.<p>Here&#x27;s more: <a href=\"http:&#x2F;&#x2F;papertrail.jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;papertrail.jobs</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822171", 
        "user": "troydavis"
    }, 
    {
        "address": "Bengaluru, Karnataka, India", 
        "country": "IN", 
        "freshness": true, 
        "full_html": "Locus | Full Time | ONSITE, VISA (Bangalore, India) | <a href=\"http:&#x2F;&#x2F;locus.sh&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;locus.sh&#x2F;</a><p>Locus is hiring Engineers and Data Scientists. At Locus we have an ambitious goal of Scheduling &amp; Tracking the World transport movement. We are aware of how audacious the goal is, but we have made our initial strong footholds and have the path to move forward. Founded by a team of ex-AWS engineers, comprising of graduates from premier Indian Tech&#x2F;Science Institutes (IIT&#x2F;BITS-Pilani&#x2F;TIFR), Locus is funded &amp; mentored by the most respected investors and ex-entrepreneurs and have product validation with actual paying customers.<p>Engineers: We have always maintained a small, but high-caliber engineering team, and we are now looking to make a couple of additions to the same. We are hiring for mobile, backend &amp; front-end. We are tech stack agnostic. We would prefer to have a look at your GitHub repo or a mobile app that you have built, over your academic&#x2F;educational qualification. We are a founding team of engineers, and understand that good engineering is part science part art, we would like to provide you the tools for the science and the time for the art. We are expanding the team to build the next version of our true multi-tenant platform with a few thousand events happening per second.<p>Data Scientists: We wish to push to edge of what is possible, and advance the field of routing problems itself. If Travelling thief, Knapsack, Capacity planning and other optimisation problem excite you, we are looking for you. We are team of PhD scientists and engineers with background in stats, working on building faster &amp; more scalable implementation of NP-hard problems, or even a combination of a few NP-Hard problems.<p>While we have pizza, beer, whisky, drones, oculus rifts, raspberry PIs on the house, the biggest perk we provide you is a remarkable team. We would love to spend our most productive years, around people with great intellect and unbridled enthusiasm. In the spirit of keeping you at your productive best, we give you free fully furnished housing with internet, food &amp; laundry taken care of, and your choice of tech gear. Read more about what we value and our work culture at <a href=\"http:&#x2F;&#x2F;locus.sh&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;locus.sh&#x2F;careers</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 12.9715987, 
        "location": "Bangalore, India)", 
        "lon": 77.5945627, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822610", 
        "user": "iglookid"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Trello has engineering jobs on nearly all of our teams (iOS, Android, Server, Web, etc.)<p><a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;</a><p>Most are REMOTE. The web position is NYC.<p>iOS and Android use standard native tools, Web is 1 page app in backbone&#x2F;CoffeeScript, Server is NodeJS&#x2F;Coffee&#x2F;Mongo.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Android, Server,", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822270", 
        "user": "loumf"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Boston, MA - Full stack engineer - SessionM<p>We are over one-hundred engineers, data scientists, business strategists, and creative technologists dedicated to creating more numerable and longer lasting connections between brands and consumers through more elegant mobile engagement.<p>We are looking for and individual with strong web backgrounds and an interest in developing the next generation mobile intelligence and engagement platform. The ideal candidate is a passionate and experienced Ruby and Rails developer, with strong JavaScript, HTML5 and CSS skills.<p>Golang engineering jobs also open.<p><a href=\"https:&#x2F;&#x2F;www.sessionm.com&#x2F;who-we-are&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sessionm.com&#x2F;who-we-are&#x2F;jobs&#x2F;</a><p>If interested email eng-jobs at sessionm.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822388", 
        "user": "mmurph211"
    }, 
    {
        "address": "Houston, TX, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Houston Astros | Houston, TX | ONSITE | Sports Science and Performance Analyst<p>The Houston Astros are seeking an Analyst to support the Sports Medicine and Performance team.  This position will work closely with the Director of Sports Medicine &amp; Performance and the Research &amp; Development team to conduct research and develop methods to advance the organization’s efforts to reduce injury and optimize performance.<p>Please apply through Teamwork Online at the link here if you&#x27;re interested:<p><a href=\"http:&#x2F;&#x2F;houstonbaseball.teamworkonline.com&#x2F;teamwork&#x2F;r.cfm?i=90521\" rel=\"nofollow\">http:&#x2F;&#x2F;houstonbaseball.teamworkonline.com&#x2F;teamwork&#x2F;r.cfm?i=9...</a><p>If you have any questions about the position, feel free to e-mail me at username at astros dot com, and I&#x27;ll answer what I can. (Please do not send resumes or applications to my e-mail, only through Teamwork.)", 
        "h1b": false, 
        "intern": false, 
        "lat": 29.7604267, 
        "location": "Houston, TX", 
        "lon": -95.3698028, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822290", 
        "user": "cwyers"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Gambit Research Ltd (<a href=\"http:&#x2F;&#x2F;gambitresearch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;gambitresearch.com</a>) | London, UK | On-site | Full time | Python&#x2F;Erlang&#x2F;DevOps | Experienced and Graduate Positions<p>At Gambit we research and manage automated sports betting algorithms on behalf of our clients. Their algorithms run on our proprietary execution platform which interfaces with a large variety of bookmakers and exchanges, enabling access to the best prices and massive liquidity.<p>Our distributed, concurrent system has a core written in Erlang, which interacts with a wide variety of Python processes across the rest of the business. There are also smaller projects written in C++, Go, Julia, and JavaScript.<p>We have a very flat hierarchy and an emphasis on developer freedom. We encourage people to work on areas of the code base that interest them, because we believe developers are happiest and most productive when intellectually stimulated.<p>We are looking for developers who have solid fundamentals in programming and maths and an ability to pick up new technologies. You don&#x27;t need to be interested in sports or betting.<p>If this appeals to you, please email info@gambitresearch.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822068", 
        "user": "superscalar"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Outbound (YC W15) - <a href=\"https:&#x2F;&#x2F;outbound.io\" rel=\"nofollow\">https:&#x2F;&#x2F;outbound.io</a>\nSan Francisco, CA | on-site only | relocation possible.<p>We are hiring multiple positions including engineering, design, marketing and sales. See all positions at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;outbound\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;outbound</a>.<p>We&#x27;re still a very small team of just 5 (2 full-time engineers). You&#x27;ll be in at the ground floor during an exciting period of growth.<p>Email Travis at travis[at]outbound[dot].io if interested or use the job listing to apply.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822453", 
        "user": "paradox95"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Citymapper. London, UK. (ONSITE VISA INTERNS)<p>Help build the world&#x27;s best urban navigation app!<p>We are recruiting for all roles: mobile and backend, data science, DevOps, design, marketing, and more. PhDs especially welcome to apply.<p>See <a href=\"https:&#x2F;&#x2F;citymapper.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;citymapper.com&#x2F;jobs&#x2F;</a>\nContact me at emil at citymapper dot com\n-----", 
        "h1b": false, 
        "intern": true, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822696", 
        "user": "EmilLondon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "INDIEGOGO - SAN FRANCISCO, CA - Software Engineers - Web &#x2F; DevOps &#x2F; iOS<p>Come join us in building out Indiegogo&#x27;s platform to democratize the way ideas get funded. We&#x27;re all full-stack engineers and build mainly on Rails, Angular, iOS, and Android.<p>Indiegogo is the type of place that empowers you to take an idea and run with it.<p>We&#x27;re hiring for:<p>- Senior Software Engineer - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1EKqgpt\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1EKqgpt</a><p>- Lead DevOps Engineer - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1EKqooW\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1EKqooW</a><p>- iOS Developer - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1QivGcU\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1QivGcU</a><p>I&#x27;m a Software Engineer here and can answer any questions. Feel free to reach out directly: w+hn@indiegogo.com (only engineers - don&#x27;t abuse it)<p>Happy New Year!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822264", 
        "user": "flysonic10"
    }, 
    {
        "address": "Phoenix, AZ, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Carvana - <a href=\"http:&#x2F;&#x2F;carvana.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;carvana.com&#x2F;</a> | Phoenix, AZ | ON-SITE | FULL-TIME | Software Engineers, Data Scientists, UI&#x2F;UX Designers<p>As part of the engineering team, I know we use the best tools to get the job done. We are backed by Azure and each developer has Pluralsight, Safari and MSDN subscriptions.<p>• Front-end Engineer (CSS3, HTML5, Javascript, AngularJs) (<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;136088\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;136088</a>)<p>• Full-stack Engineer (AngularJs, MVC, WebApi, C#, SQL, Mongo, ElasticSearch) (<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;91003\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;91003</a>)<p>• Data Scientist (SQL, R, Python) (<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;90990\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;carvana&#x2F;jobs&#x2F;90990</a>)<p>At Carvana, we are turning the most excruciating purchase (car buying) into something meaningfully better by approaching the whole experience in a completely new way. We provide a seamless, 100% online car buying solution for consumers from end-to-end. Our customers can complete their purchase in as little as 15 minutes and we deliver cars to our customers’ doors in as little as 24 hours with a 7 day money back guarantee. Our customers can even pick up their car from one of our fully-automated Car Vending Machines! <a href=\"http:&#x2F;&#x2F;www.carvana.com&#x2F;vendingmachine\" rel=\"nofollow\">http:&#x2F;&#x2F;www.carvana.com&#x2F;vendingmachine</a><p>In order to deliver, we need a diversity of perspectives and experience. If you are energized by thinking creatively and working for a company where you will be able (and expected) to make a meaningful impact from day one, then we are the spot for you.<p>We are a well-funded, fast growing company with many open positions.<p>Learn more at <a href=\"http:&#x2F;&#x2F;www.carvana.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.carvana.com&#x2F;careers</a> or contact me at nate.fuller@carvana.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 33.4483771, 
        "location": "Phoenix, AZ", 
        "lon": -112.0740373, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822426", 
        "user": "nfullerCarvana"
    }, 
    {
        "address": "Boston, MA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Brightcove (<a href=\"http:&#x2F;&#x2F;brightcove.com\" rel=\"nofollow\">http:&#x2F;&#x2F;brightcove.com</a>) | Boston &amp; Seattle | Full-Time | Onsite<p>We&#x27;re an online video platform (OVP) headquartered near Boston&#x27;s South Station (with offices around the world), and power video for many of the world&#x27;s largest media companies. We work on fun, difficult problems within a casual work environment. We have a fully stocked kitchen, ping pong&#x2F;arcade machines, frequent catering, unlimited vacation policy that employees actually use, generous work&#x2F;life balance, 401k matching, etc. etc.<p>Boston, MA:<p>* Senior Full Stack Web Developer (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3BEMHhwu\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3BEMHhwu</a>)<p>* JavaScript Developer, Video Players (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33EMHhwW\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33EMHhwW</a>)<p>* Engineering Manager, Video SDKs (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3bNMEhwa\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3bNMEhwa</a>)<p>* Developer Evangelist, Video Platform (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mNMEhwl\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mNMEhwl</a>)<p>* Senior Security Engineer (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3jEMHhwc\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3jEMHhwc</a>)<p>* Zencoder Senior Software Engineer (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3tFMHhwn\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3tFMHhwn</a>)<p>* Senior iOS Application Developer (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33nvKhwr\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33nvKhwr</a>)<p>* Principal Software Engineer (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3envKhwC\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3envKhwC</a>)<p>Seattle, WA:<p>* Principal Software Engineer, Video Analytics &amp; Billing (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3sovKhwR\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3sovKhwR</a>)<p>* Senior Software Engineer in Test (<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3zovKhwY\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3zovKhwY</a>)", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3600825, 
        "location": "Boston, MA", 
        "lon": -71.0588801, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822035", 
        "user": "evan121"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Beaker Notebook - <a href=\"http:&#x2F;&#x2F;BeakerNotebook.com\" rel=\"nofollow\">http:&#x2F;&#x2F;BeakerNotebook.com</a> - Fullstack Dev - onsite in NYC<p>The Beaker team develops a web UI and IDE for statistical modeling, data analysis, and visualization. Beaker is open source, based on a modern Angular frontend, nginx and a collection of servers, mostly JVM-based. The work is done primarily on Github (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;twosigma&#x2F;beaker-notebook\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;twosigma&#x2F;beaker-notebook</a>) outside the corporate network, making for a comfortable and high-velocity developer experience. We are looking for a fullstack engineer to take this complex application to 2.0, including performance optimization of IPC between multiple languages using shared memory, server architecture, collaborative realtime editing, and cluster integration. Contact me directly with any questions or to apply (spot at draves dot org).", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822109", 
        "user": "spot"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Spreemo | New York City | Senior Software Engineers (Rails) | Onsite<p>Spreemo, newly funded healthcare marketplace in FiDi (downtown Manhattan) in New York City (NYC). Looking for senior full-stack Ruby on Rails developers. Good pay, environment, and team. Help fix healthcare by providing transparency in both cost and quality.<p><a href=\"http:&#x2F;&#x2F;spreemo.com&#x2F;careers&#x2F;senior-rails-developer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;spreemo.com&#x2F;careers&#x2F;senior-rails-developer&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822521", 
        "user": "dankohn1"
    }, 
    {
        "address": "Philadelphia, PA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Blackfynn | Philadelphia, PA | Full Time | ONSITE<p><a href=\"http:&#x2F;&#x2F;www.blackfynn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blackfynn.com</a><p>Blackfynn is an early-stage startup looking to change how scientific researchers manage their data, starting in neuroscience. We’re looking for 2 engineers to join our early-stage team (there are currently 4 of us full-time). We’re looking to add someone who’s comfortable working across the stack and someone specifically focused on web UI development.<p>Use your software skills to make a real difference in scientific medical research.<p>For more info, drop me a note: tom at blackfynn.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 39.9525839, 
        "location": "Philadelphia, PA", 
        "lon": -75.1652215, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822420", 
        "user": "phillytom"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Parse.ly - <a href=\"http:&#x2F;&#x2F;parse.ly\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly</a> - Fully Remote - Full-Time<p>We are hiring a software engineer to work on our real-time analytics dashboard. Pythonistas and JavaScript hackers especially desired.<p>On the company: We&#x27;ve built a real-time content measurement layer for the entire web.<p>Our analytics platform helps digital storytellers at some of the web&#x27;s best sites, such as Arstechnica, New Yorker, The Atlantic, The Next Web, and many more. In total, our analytics backend system needs to handle over 50 billion monthly events from over 475 million monthly unique visitors.<p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics, building some of the best open source tools for working with modern stream processing technologies. Our UX&#x2F;design team has also built one of the best-looking dashboards on the planet, using AngularJS and d3.js. You can see some screenshots at <a href=\"http:&#x2F;&#x2F;parse.ly&#x2F;tour\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly&#x2F;tour</a>.<p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>We are currently looking for software engineers to help us build the best real-time analytics dashboard the world has ever seen. The only requirement is some experience in Python&#x2F;JavaScript. Bonus points for an interest in information visualization, Edward Tufte, and d3.js.<p>To see an example of how we work, check out the blog post, &quot;Whatever It Takes&quot;: <a href=\"http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46</a><p>Apply now by sending a CV&#x2F;website, github link (if available), and 1 paragraph intro to work@parsely.com. Let us know what part of the position interests you, or point us toward an interesting project or piece of code you wrote. Also, mention the HN Who&#x27;s Hiring thread.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822340", 
        "user": "pixelmonkey"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "415 - Amsterdam, The Netherlands - onsite - Ruby developer<p>415 is looking for a Ruby back-end developer with an interest in front-end to help us develop a new event management platform. We&#x27;re a new startup in the music and event-industry looking for a software developer who is curious, proactive and on the forefront of new technologies.<p>We work with a lot of modern tools common to Ruby, but we&#x27;re also keen to extend our knowledge in the very near future with technologies like Elixir, Rust, Docker, and anything else that sounds promising. We&#x27;re a small team now, but always growing.<p>For more information go to: <a href=\"http:&#x2F;&#x2F;jobs.keplaragency.com&#x2F;ruby.html\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.keplaragency.com&#x2F;ruby.html</a> or contact us directly at jobs@keplar.nl", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Amsterdam, The", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822197", 
        "user": "tombruijn"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Quetel - Chantilly, VA - Full Stack C# - Full Time OnSite<p>We build software for police officers around the world.  We are a small company with a big heart.  Family Oriented and a great work environment.<p>You will be pushing code live on your first few days of work.<p>Looking for a Full Stack C#, MVC Junior with 2-5 years of experience.<p>If your interested, send me your resume at scott@quetel.com", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Chantilly, VA", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822093", 
        "user": "spoiledtechie"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "VividCortex | Charlottesville, VA | INTERNS, ONSITE | <a href=\"https:&#x2F;&#x2F;www.vividcortex.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vividcortex.com&#x2F;</a><p><i>Local (Charlottesville area) candidates only, please!</i><p>VividCortex is the best way to see what production database systems are doing. Our database monitoring platform is used by major companies like King, GitHub, DigitalOcean, and Etsy to monitor their MySQL, PostgreSQL, MongoDB, and Redis servers.<p>We&#x27;re looking for interns to join our young, lean, energetic company with a great get-it-done culture.<p>Our technology stack consists of AWS, Kafka, MySQL, and Go on the backend; Symfony, AngularJS, and D3 on the frontend. Our exciting technical challenges include high-performance database protocol decoding, statistical anomaly detection, adaptive fault detection, time series storage, and stream processing.<p>Interested? Please contact me at preetam [at] vividcortex.com!", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": "Charlottesville, VA", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822080", 
        "user": "misframer"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Suade (<a href=\"https:&#x2F;&#x2F;suade.org\" rel=\"nofollow\">https:&#x2F;&#x2F;suade.org</a>) • ONSITE (London, UK) • Front-end Software Engineer • Full time • NO VISA<p>We&#x27;re bringing banks and regulators closer together with the help of technology.<p>Join us and build the UI and visualizations needed by some of the most important institutions in the world. We use AngularJS, D3 and more for this challenging task.<p>More details:\n<a href=\"https:&#x2F;&#x2F;suade.org&#x2F;jobs&#x2F;front-end-picasso&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;suade.org&#x2F;jobs&#x2F;front-end-picasso&#x2F;</a><p>Send your CV and a short intro to: jobs@suade.org", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822324", 
        "user": "jesperht"
    }, 
    {
        "address": "Philadelphia, PA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "New Start Mobile | Software Developer | Remote&#x2F;Maine&#x2F;Philadelphia<p>As a software developer with New Start Mobile you will design, develop, and maintain a variety of enterprise-level apps and services.<p>New Start Mobile has been creating industry-defining software for many of the the United States&#x27; largest sporting authorities and governing bodies since 2010. We design, build, and maintain a variety of official coaching and education products with 20+ years of industry expertise. We’re based in Philadelphia, PA, and most of our team works remotely from Maine.<p><a href=\"http:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newstartmobile.com&#x2F;careers&#x2F;dev&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 39.9525839, 
        "location": "Philadelphia, PA", 
        "lon": -75.1652215, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822186", 
        "user": "eli_oat"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "FareHarbor | ONSITE, SF, CA | FULL TIME | jobs+product@fareharbor.com<p>FareHarbor is hiring full time front-end (AngularJS), back-end (Django&#x2F;Python), and full-stack&#x2F;generalist (whatever works best) engineers at our San Francisco office. We offer market-rate salary, flexible working hours and location, and the odd trip to the Hawaii office :)<p>Check us out! <a href=\"https:&#x2F;&#x2F;fareharbor.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fareharbor.com&#x2F;jobs&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822411", 
        "user": "zachsnow"
    }, 
    {
        "address": "Austin, TX, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Main Street Hub &#x2F;&#x2F; Austin, TX - ONSITE &#x2F;&#x2F; email: brandon.beck@mainstreethub.com<p>We are looking for a few experienced software engineers to join our small but growing R&amp;D team in downtown Austin. Within engineering we are a passionate group of people who are extremely interested in building the software that helps our customers around the country thrive in their local communities. We’re a pretty small team (currently ~22 people) so you’ll have plenty of say around how we develop software going forward. We are currently in the process of modernizing our software platform to be more modular and truly data driven. Our goal is to use data to make sure that we provide the right content to the right consumer at the right time. We’re building our internal API using REST based services implemented in Java, and while our front end is currently implemented in PHP, we are migrating away from that. Some of the technologies that we’re using: Dropwizard, Flyway, React, CloudFormation, Troposphere, and Ansible. All new engineers get company provided downtown parking, flexible work hours, 100% of their health insurance premiums paid for by the company, the ability to choose their own work computer, and access to our kitchen with plenty of drinks and snacks. We’re looking for individuals only so please NO RECRUITERS OR AGENCIES (seriously, your emails will just go into the trash folder so let&#x27;s save each other&#x27;s time). In addition we’re looking for full-time employees who are already in Austin, TX or willing to relocate.<p>---<p>Founded in 2010, Main Street Hub is the CRM for Local. We offer an integrated social, web, and email marketing solution designed to help merchants get more customers and keep them coming back by spreading word of mouth, extending their customer service, managing their online reputation, and leveraging the Main Street Hub’s merchant network. Main Street Hub was recently featured for the second year in a row on the Inc. 500 list (<a href=\"http:&#x2F;&#x2F;www.inc.com&#x2F;profile&#x2F;main-street-hub\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inc.com&#x2F;profile&#x2F;main-street-hub</a>) of America’s fastest growing companies and in the top 10 fastest growing companies in Austin. Please see our website (<a href=\"http:&#x2F;&#x2F;www.mainstreethub.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mainstreethub.com</a>) for more information.", 
        "h1b": false, 
        "intern": false, 
        "lat": 30.267153, 
        "location": "Austin, TX", 
        "lon": -97.7430608, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822327", 
        "user": "bbeck"
    }, 
    {
        "address": "Cambridge, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Composable Analytics | Cambridge, MA | Multiple Positions | On-site<p>Software Engineers and Data Scientists<p>We are building a unique data and process integration platform dedicated to real-time, collaborative exploration of complex, information-based problems. We’ve recently spun out of MIT, and thriving as we create an awesome product and company.<p>We are looking for new team members with amazing technical skills and collaborative attitudes, that enjoy having the freedom to innovate and invent, while advancing new ideas and implementations, and shaping the product direction.<p>This is your chance to be a critical part of this development team.<p>Full-time positions are available immediately for:<p>Front-End UI Developers passionate about creating well-architected user interfaces and fluent in current best practices for responsive and accessible design\nJunior and Senior level Software Engineers that have the ability to work across all layers of the application, from back-end databases through to the UI\nData Scientists skilled at pattern recognition, predictive analysis, data mining and expert system concepts<p>We’re looking for developers with knowledge of software systems and design principles, that can code the entire stack, with an interest in:<p>Designing and building Web applications using HTML5, JavaScript, XML, JSON and RESTful web services<p>Building and maintaining large-scale, distributed, web-based platforms, utilizing cutting-edge technologies and delivering innovative features<p>We’re looking for data scientists with strong, hands-on development experience, with an interest in:<p>Developing novel data models, integrating diverse data types, utilizing SQL, NoSQL and other technologies<p>Building tools, workflows, and dashboards for data selection, pre-processing and enrichment<p>Creating predictive and automated machine learning algorithms<p>Visit www.ComposableAnalytics.com and e-mail info at ComposableAnalytics.com with your resume.", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3736158, 
        "location": "Cambridge, MA", 
        "lon": -71.10973349999999, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822661", 
        "user": "composable"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Sift Science | San Francisco | Full-time | Onsite<p>What we do:<p>Sift Science, YC11, is a machine learning company that detects and prevents online fraud in real time.<p>What we are looking for:<p>We are seeking a front-end engineer who is passionate about building interfaces that are simple yet powerful, and can sweat the details. The Sift Science Console is a single-page web app built on React, with Browserify and ES2015, powered by our Dropwizard API backend. We care about responsive design, we use D3, and we’re always investing in betters ways to tell a story with data.<p>Job posting: <a href=\"https:&#x2F;&#x2F;siftscience.com&#x2F;jobs#43193\" rel=\"nofollow\">https:&#x2F;&#x2F;siftscience.com&#x2F;jobs#43193</a>\nContact: Lynda[at]siftscience[dot]com<p>Happy new year and Sift on!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822699", 
        "user": "lyndaphan"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "REMOTE &#x2F; VISA &#x2F; INTERNATIONAL REMOTE &#x2F; SAN FRANCISCO: Rainforest QA (YC S12) is hiring for all sorts of engineering and sales roles. You can checkout the details, plus more about the company at <a href=\"https:&#x2F;&#x2F;www.rainforestqa.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rainforestqa.com&#x2F;jobs</a> :)", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822511", 
        "user": "ukd1"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "fedger.io - Smart Data to Grow your Business | <a href=\"https:&#x2F;&#x2F;fedger.io\" rel=\"nofollow\">https:&#x2F;&#x2F;fedger.io</a> | Cologne, Germany | ONSITE Software Engineer (Backend)<p>We use advanced algorithms and machine intelligence to collect, structure, enrich and contextualize web data on demand and make it accessible via simple to use micro APIs in near-time.<p>COME HELP US WITH PROJECTS LIKE...\n* Architect and build the next generation of data collecting &amp; processing tech\n* Improve and extend our deep learning and machine learning stack<p>REQUIREMENTS:\n* Experience with current data processing frameworks\n* Experience with Go, Python and Docker; Lua and Torch would be a plus\n* Skills in machine learning<p>If you&#x27;re excited to have a major impact on the experience of users of our APIs around the world, shoot me an email to benedikt@fedger.io", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Cologne, Germany", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822582", 
        "user": "f_io"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "[REMOTE] or [ONSITE] at either Mountain View or San Fransisco\nUserTesting.com - [SENIOR] Rails &#x2F; Ruby on Rails &#x2F; Angular<p>HR Posting -&gt; <a href=\"https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;UserTesting&#x2F;86415004-sr-soft..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;UserTesting&#x2F;86415004-sr-soft...</a>.<p>I&#x27;m not in HR, I&#x27;m an engineer that started here about a few months ago, loving it so far... if anyone has any questions, feel free to ask me! Email -&gt; jaiken at usertesting.com", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Mountain View", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822129", 
        "user": "JustinAiken"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "GigWalk | San Francisco | Onsite | Full Time<p>GigWalk is hiring Python backend devs: <a href=\"http:&#x2F;&#x2F;www.gigwalk.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gigwalk.com&#x2F;careers</a><p>Flask, Mongo, Postgres, ElasticSearch<p>I like it here.  It&#x27;s way less stressful than other places I&#x27;ve worked at.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822458", 
        "user": "JesseAldridge"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "[REMOTE] | London at AngJobs.com - Job board for angularjs devs&#x2F;frontend<p>Open source project  \n<a href=\"http:&#x2F;&#x2F;angjobs.com&#x2F;#!&#x2F;jobs&#x2F;inbox&#x2F;hn\" rel=\"nofollow\">http:&#x2F;&#x2F;angjobs.com&#x2F;#!&#x2F;jobs&#x2F;inbox&#x2F;hn</a>  \nhosted on Github<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;victorantos&#x2F;AngJobs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;victorantos&#x2F;AngJobs</a><p>Looking for contributors and help to move to angular 2.0, email: jobs@angjobs.com or via Github", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822149", 
        "user": "victorantos"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Full Time | San Francisco, CA | Onsite | Competitive Salary, benefits, and generous options.<p>Snapdocs is a early-stage, rapidly growing company looking for a battle-hardened rails engineer. The ideal candidate is someone who plans to become a lead engineer (or perhaps a product manager) in the not too distant future.<p>We&#x27;re a small team tackling the absolutely massive mortgage market. We&#x27;re bringing modern, elegant software to a field that still relies on fax machines and manilla envelopes. We bring security, efficiency and joy to a paper-based pillar of the US economy.<p>The type of problems we&#x27;re tackling involve workflow, product design, and data. Monolith vs microservice is an ongoing debate. We are working to find a good authentication pattern that allows for people to work across companies in multiple roles (which is trickier than you might think!). Domain Driven Design is our guiding light.<p>Snapdocs’ culture is one that trusts its team members to make smart decisions. This means we value both independent work as well as seeking collaboration. We&#x27;re becoming ubiquitous in one segment of the market and we&#x27;re looking to hire another core engineer to help us expand further.<p>==Job Description and Required Skills== * Rails Engineer. 3+ years experience, but more is welcome. Ideally, you&#x27;re a full stack coder. But in reality, you probably lean either towards the front or the back end. That&#x27;s fine, so long as you know (and are proud of) your strengths.<p>* Being the 5th member of on a fast-growing technical team. This means helping to form a healthy and happy culture. We strive to be respectful of each other&#x27;s time and point of view. We&#x27;re learning how to do this together. We want to create a place where it&#x27;s OK to fail, and that you know the team has your back the whole way through.<p>* Self-motivated. To us that means when you get an interesting problem, you will rip into it until you understand its nuances and perhaps have a glimpse of the solution.<p>* Empathy. We work closely with our customers, meaning phone calls, emails, and sometimes lunch. It is important in this job to listen to them so that we can build what they need and want.<p>* Knowledge of AWS would be excellent.<p>* UX experience (or interest in cultivating it) would be excellent.<p>Send an email to jobs@snapdocs.com telling us about yourself. Please include a resume and a link to github (and specific github repos) if your profile is informative.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822454", 
        "user": "evtothedev"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "thePlatform (<a href=\"https:&#x2F;&#x2F;www.theplatform.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theplatform.com</a>)<p>Seattle, WA; Denver,CO; New York, NY| onsite, fulltime&#x2F;contract<p>We provide the industry’s leading online video publishing, encoding and management solution called mpx. We are always looking for talented, energetic people to help us innovate and grow our business. Everyone here is friendly and amazingly smart. We also work with our customers (Client Integration Engineers) to help them build video media into their small business websites or even helping them build their own Netflix! We also are looking for devOps.<p>Technology Stack&#x2F;Culture:\nDevops uses Chef, Rundeck, and ruby<p>Our testing Infrastructure is written in groovy<p>Our backend services are written in java<p>Client Integration Engineers will also write groovy to integrate customers into our system<p><a href=\"https:&#x2F;&#x2F;www.theplatform.com&#x2F;about-us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theplatform.com&#x2F;about-us&#x2F;careers&#x2F;</a><p>Selected Job Opportunities:\nSDET - Test Infrastructure,\nProduct Owner,\nClient Integration Engineer,\nFull Stack Engineer,\nFront End Developer,\nSoftware Engineer - Manifest<p>Highlighted Benefits:\nCompany bonuses,\n21 days paid time off + 7 paid holidays,\nFree Cable and Internet and Home Security System, Dental, Vision, Health, Adoption Assistance<p>Contact mckendon[at]acm[dot]org\nFor more information&#x2F;questions.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822648", 
        "user": "nightvoomer"
    }, 
    {
        "address": "Paris, France", 
        "country": "FR", 
        "freshness": true, 
        "full_html": "Nanocloud Software [<a href=\"https:&#x2F;&#x2F;www.nanocloud.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nanocloud.com&#x2F;</a>] | Paris, France | ONSITE<p>Nanocloud is looking for a front-end developer.\nOur buzzwords are Angular, Node.js, REST API, HTML5, Typescript, Bower, Git, Jira, Go, Docker, Virtualization, AWS, Azure.\nIf you want to get paid to contribute to an open source project, send us a mail at job04@nanocloud.com\nFull time job, stock options.<p>About Nanocloud:\nNanocloud is one year old. Today, we are around 10 in the team working on our great project in Paris. Our goal is to enable every companies to put their applications in the cloud. We offers both community and enterprise solutions. Feel free to checkout our product at <a href=\"http:&#x2F;&#x2F;www.nanocloud.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nanocloud.org&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 48.856614, 
        "location": "Paris, France", 
        "lon": 2.3522219, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10821776", 
        "user": "costent"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Dublin, Ireland - NLP Research Engineer at AYLIEN [1] (Onsite)<p>AYLIEN is hiring an NLP Research Engineer to join the Text and Image Analysis startup in Dublin, Ireland.\nThis is a unique opportunity to work with a team of talented Scientists and Engineers at AYLIEN.<p>* Your responsibilities:<p>- Improve and extend NLP capabilities of AYLIEN’s Text Analysis engine.<p>- Research and evaluate new&#x2F;different approaches to NLP problems.<p>- Produce deliverable results and take them from development to production in collaboration with our engineers.<p>- Engage in knowledge sharing with your colleagues.<p>* You must have:<p>- Strong Machine Learning background and familiarity with modern Machine Learning paradigms and concepts, such as Deep Neural Networks and Deep Learning.<p>- Expertise in at least 3 of the following tasks: Sentiment Analysis, Entity Extraction, Text Classification, Topic Modeling, Natural Language Understanding (NLU) and Natural Language Generation (NLG).<p>- Strong understanding of text pre-processing and normalization techniques, such as tokenization, POS tagging and parsing and how they work at a low level.<p>- Strong knowledge of Java or Python, and general software development skills (source code management, debugging, testing, deployment, etc.)<p>- Expertise in producing, processing, evaluating and utilizing datasets.<p>* Would be great if you have:<p>- MSc.&#x2F;PhD in Computer Science, Computational Linguistics or related fields.<p>- Good understanding of linguistics and language as a phenomenon.<p>- Strong interest in, and knowledge of Artificial Intelligence and its subfields.<p>- Experience with non-English NLP.<p>- Experience with open-source NLP toolkits such as CoreNLP, OpenNLP, NLTK, gensim, LingPipe, Mallet, etc.<p>- Experience with open-source ML and science toolkits such as scikit-learn, MLlib, DeepLearning4J, Theano, Torch, Keras, Lasagne, NumPy, etc.<p>- Published work in academic conferences&#x2F;journals.<p>Interested? Please send a brief introduction and your CV to jobs@aylien.com and we’ll take it from there.<p>[1] <a href=\"http:&#x2F;&#x2F;aylien.com\" rel=\"nofollow\">http:&#x2F;&#x2F;aylien.com</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Dublin, Ireland", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822213", 
        "user": "parsabg"
    }, 
    {
        "address": "Palo Alto, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Robinhood | Palo Alto | ONSITE | <a href=\"https:&#x2F;&#x2F;robinhood.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;robinhood.com&#x2F;jobs</a><p>Backend Engineer (Python, Go, Distributed Systems)<p>Data Infrastructure Engineer (Hadoop, Kafka, Distributed Systems)<p>Security Engineer<p>Web Engineer (expert level JavaScript, framework agnostic)<p>Android Engineer<p>iOS Engineer", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.4418834, 
        "location": "Palo Alto", 
        "lon": -122.1430195, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822229", 
        "user": "samuelbrin"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "CloudFlare <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;</a> | San Francisco, CA; London, UK; Singapore, SG | VISA, ONSITE<p>CloudFlare is building a better Internet -- performance and security optimization at the edge. Our long term goal is to give every site the same performance, security, and reliability that major sites like Google and Facebook accomplish, without any specialized network hardware or complicated administration. We enhance over 2 million sites,\nincluding this one. We&#x27;re hiring for a variety of roles -- started 2015 at 128, ended around 220, doubling again in 2016. This is a perfect time to join -- product market fit is established, but there&#x27;s a lot of great engineering, product, sales, and support work to be done. We&#x27;ve publicly said we&#x27;re profitable and on track for long term independent success.<p>You may wish to check out our blog to see the kinds of engineering work we do. (<a href=\"https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;</a>).\n<a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> has a listing of positions.<p>We&#x27;re always hiring for operations&#x2F;SRE, sales, general systems engineering (mostly in Go, nginx, and network, as well as DNS at scale), and web development.<p>Specific roles we&#x27;re keen to hire include:<p>0) Great operations&#x2F;SRE staff: operating our system at scale (65+ datacenters around the world, 24x7 coverage, millions of sites) requires highly competent, hard-working, and communicative engineers.<p>1) Billing engineer -- someone to take the lead as we build a new billing system. Also hiring a billing PM. We&#x27;re using a great YC company&#x27;s billing product.<p>2) Great front-end engineers -- building new UI&#x2F;UX to expose controls and data to customers is an increasing portion of what we do. Our current front-end stack is Backbone + Marionette with Browserify and Sass. Our new projects are using React + Redux + Babel + css-modules, and generally adopting Higher Order Components. We&#x27;re also starting the process of re-imagining our main WWW Front-end stack with a migration to Redux.<p>3) Systems Engineer -- looking for people to help serve even more traffic, build infrastructure for security and robustness, and contribute back to open source projects. We make extensive use of nginx, lua&#x2F;luajit, and ssl-at-scale.<p>4) &quot;Prototyping engineers&quot; -- people who want to prototype things in go (backend) through js frontend. We&#x27;re adding a lot of new products in 2016, and people who love building the first prototype and pilot versions of these products make everything faster.<p>If you&#x27;re interested, please apply through the <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> link", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822182", 
        "user": "rdl"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Getpay.me - <a href=\"https:&#x2F;&#x2F;getpay.me\" rel=\"nofollow\">https:&#x2F;&#x2F;getpay.me</a> - REMOTE - Full Time - Internship<p>We are hiring web developers for our cryptocurrency payment gateway system.<p><pre><code>   - PHP, Javascript, HTML, CSS, Bootstrap\n\n   - Blockchain knowledge\n\n   - Interested in Bitcoin and other cryptocurrency technologies\n\n</code></pre>\nSend your CV and a short intro to: pay@getpay.me", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822363", 
        "user": "getpay"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "UserTesting - ONSITE (Mountain View + SF) - DATA SCIENTIST - FULL TIME - NO VISA<p>Usertesting is the leading User Experience Research platform looking for data scientists passionate about using data to understand and optimize UX research done at scale.<p>For more information, please email me directly at dpuett@usertesting.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822256", 
        "user": "dysgath"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Pivotal | ONSITE SF, NYC, Palo Alto and many, many locations worldwide | Engineers, Designers, Product Managers, Data Scientists | Visa and relocation assistance<p>First things first. We look for aptitude over APIs. It doesn&#x27;t matter whether your resumé says PHP or PhD: if you&#x27;re smart, know some stuff and have empathy, we want to work with you.<p>Pivotal&#x27;s goal is to change the way the world makes software and we kinda sorta <i>really mean it</i>. We&#x27;re broken into three basic divisions: Pivotal Labs (yes, <i>that</i> Pivotal Labs), Pivotal Cloud Foundry and Pivotal Big Data. Rotations between divisions, temporarily or permanently, are possible.<p>We have offices in San Francisco, New York City, Santa Monica, Palo Alto, Seattle, Boulder, Denver, Chicago, Boston, Washington DC, Toronto, London, Dublin, Tokyo and Sydney. We will soon be opening an office in Berlin as well, with more to come. Relocations, temporarily or permanently, are possible.<p>Each of the three divisions has a constantly evolving and deliberately cross-pollinated culture. We are constantly thinking about how we work and how we can work more sensibly, effectively and enjoyably. Right now we are particularly trying to grow in Labs and Cloud Foundry.<p>-- <i>Pivotal Labs</i>, from which the company draws its name and cultural seed, helps clients to become better at development. For engineering we are religiously lean and agile. In practice that means we pair program and TDD every line of code from the outside. Our product managers are fantastic at keeping products sharply focused, our designers are masters from users to pixels. We have a growing data science practice, and some engagements include all four roles.<p>-- <i>Cloud Foundry</i> solves application deployment and management. We&#x27;re the main contributors to the Cloud Foundry project. We&#x27;re constantly improving the leading opensource PaaS -- our distribution has the fastest-growing sales of any opensource product <i>ever</i>.<p>It&#x27;s also the only PaaS I&#x27;d personally bet a company on. Except for integrated upstream code, every line is pair programmed and TDD&#x27;d. We dogfood the cutting edge of the technology on our own commercial public cloud (Pivotal Web Services). It works because we took the XP and Lean DNA of Pivotal Labs and scaled it up to build the best cloud platform bar none.<p>-- <i>Generally</i><p>At our offices we have free breakfast, weekly tech talks, good benefits and competitive pay. Ping pong is not mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The beer fridge has more IPA than I prefer but I guess that&#x27;s life in paradise.<p>We provide visa and relocation assistance. In the NYC office we have about 15 people from overseas, including Australians like me.<p>You can apply through our website: <a href=\"http:&#x2F;&#x2F;pivotal.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;pivotal.io&#x2F;careers</a>.  You can also email me at jchester+hn@pivotal.io to answer any questions you might have and potentially help me score one of our generous referral bonuses.<p>For what it&#x27;s worth, I&#x27;m just an engineer. My replies might not be immediate, sorry.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822037", 
        "user": "jacques_chester"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Keen IO | San Francisco, CA | Full-time | Engineers | Onsite or Remote | keen.io<p>Hey HN community! We&#x27;re an analytics API that lets developers collect and study custom events at massive scale. We&#x27;re hiring Platform Engineers and DevOps engineers to help build and support our analytics infrastructure.<p>keen.io - <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio#.VobL9pMrLVr\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio#.VobL9pMrLVr</a><p>First, here a few things we believe in: • Honesty &amp; empathy, introspection, Distributed innovation, the importance of laughter &amp; relationships, play to your strengths; patch your weaknesses with diverse collaborators. You can learn more about the humans behind Keen IO here -&gt; keen.io&#x2F;team.<p>A little bit more about the roles we&#x27;re hiring for:<p>1. Platform Engineer<p>By centralizing a data pipeline for thousands of companies, we operate at a scale that none of them have to worry about. Looking to the horizon, we need to look at every piece of our infrastructure with a critical eye. We need to stay ahead of the curve. You will help us be thoughtful and deliberate about tackling the right bottlenecks at the right time. You’ll help make working on the platform easier and easier. You’ll have the opportunity to gain deep understanding of distributed systems and teach others! Most importantly, you’ll collaborate with some pretty amazing humans.<p><pre><code>  Skills: Cassandra, Scala, Python, Java, Tornado, Go, Zookeeper, Storm, Kafka, Mesos\n</code></pre>\n<a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;98480#.VobNRpMrLVo\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;98480#.VobNRpMrLVo</a> OR email humans@keen.io<p>2. DevOps Engineer<p>By centralizing a data pipeline for thousands of companies, we operate at a scale that none of them have to worry about. That means we have to stay on top of the operational work implied by that scale, and we have to stay ahead of the curve as we continue to grow. To be successful we have to invest heavily in smart operational choices that reduce or eliminate manual interaction.<p>You’ll help make those choices, implement them, monitor what’s working well and what isn’t, and continually iterate. You’ll collaborate closely with architects and developers to ensure new features and new systems integrate seamlessly with deployment and operations. Most importantly, you’ll be an integral member of a team of pretty great humans who emphasize trust, respect, humility, and self-improvement.<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;124948#.VobMSZMrLVo\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;keenio&#x2F;jobs&#x2F;124948#.VobMSZMrLVo</a> OR email humans@keen.io<p>Thanks for reading!", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822914", 
        "user": "lexicography"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Cloudera | Location: Budapest, Hungary | Full-time | Onsite | Software Developers in Test (Platform Distribution), Software Developers (Platform Distribution), Solutions Architect, Customer Operations Engineers and more | www.cloudera.com<p>Picture yourself at Cloudera in 2016! Our Budapest office is growing exponentially and we are looking for super-smart tech people to help us grow.<p>Our mission: Founded by leading experts on big data from Facebook, Google, Oracle and Yahoo, Cloudera&#x27;s mission is to bring the power of Hadoop, MapReduce, and distributed storage to companies of all sizes in the enterprise, Internet and government sectors.<p>Over the past few years, Cloudera has experienced tremendous growth, making us the leading contributor to the Hadoop ecosystem and a leading provider of enterprise solutions for Big Data.<p>Cloudera is revolutionizing enterprise data management by offering the first unified Platform for Big Data, an enterprise data hub built on Apache Hadoop™. Cloudera offers enterprises one place to store, process and analyze all their data, empowering them to extend the value of existing investments while enabling fundamental new ways to derive value from their data.<p>Only Cloudera offers everything needed on a journey to an enterprise data hub, including software for business critical data challenges such as storage, access, management, analysis, security and search.Over the past few years, Cloudera has experienced tremendous growth, making us the leading contributor to the Hadoop ecosystem and a leading provider of enterprise solutions for Big Data.<p>Check out all our Budapest roles and apply here <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1Na6EvI\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1Na6EvI</a> or here <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2016EngCareers\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2016EngCareers</a><p>Glassdoor&#x27;s Employees&#x27; Choice Awards 2016 <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1ORttqv\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ORttqv</a><p>The Best Startup CEOs To Work For <a href=\"http:&#x2F;&#x2F;read.bi&#x2F;1KR6zvN\" rel=\"nofollow\">http:&#x2F;&#x2F;read.bi&#x2F;1KR6zvN</a><p>20 Big Data Companies Leading the Way <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1lQgc5Y\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1lQgc5Y</a><p>50 enterprise startups to bet your career on in 2016 <a href=\"http:&#x2F;&#x2F;read.bi&#x2F;1IybdM8\" rel=\"nofollow\">http:&#x2F;&#x2F;read.bi&#x2F;1IybdM8</a><p>Top 10 Private Tech Companies to Work For <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1ZF7vdD\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ZF7vdD</a><p>Cloudera Engineering Blog <a href=\"http:&#x2F;&#x2F;blog.cloudera.com&#x2F;blog&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.cloudera.com&#x2F;blog&#x2F;</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Location: Budapest, Hungary", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=10822864", 
        "user": "Infosourcer"
    }, 
    {
        "address": "Dallas, TX, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "IBM Watson Health | Multiple positions | Dallas, TX, other locations below | Onsite | Full-time | Citizen; Visa for well-qualified candidates (I think) | Ruby on Rails, React, .Net, Mongo<p>I’m currently a Rails Developer for IBM Watson Health out of Dallas. My team is working on tools to allow healthcare providers to holistically manage their patient populations. IBM has thousands of job postings, so I’m going to give direct links, feel free to search around further!<p>For the Rails roles, we&#x27;re also looking for experience in React.<p>####<p>In Dallas:<p>• Ruby on Rails (Possible REMOTE, we just hired a guy out of Ohio)- <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEVRU1ect\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEVRU1ect</a><p>• Senior Ruby on Rails (Possible REMOTE)- <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBETt_1ecv\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBETt_1ecv</a><p>• Release Engineer - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEeho1eci\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEeho1eci</a><p>• Test Automation Engineer - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEu0K1qd4\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEu0K1qd4</a><p>• Software Engineer (Microsoft toolset *C#, ASP.Net, Mongo) - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBE7S_1ecn\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBE7S_1ecn</a><p>• Database Administrator - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBE-hX1ed3\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBE-hX1ed3</a><p>• Senior Database Administrator - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEFl71ed6\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEFl71ed6</a><p>• Software Engineer - Voice over Internet Protocol (VOIP) - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBE13w1ed7\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBE13w1ed7</a><p>####<p>Non Development Roles:<p>• Client Relationship Manager - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEK821ecq\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEK821ecq</a><p>• Clinical Sales Consultant - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEeVE1ecy\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEeVE1ecy</a><p>• Clinical Informatics Analyst - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBE38-1ed0\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBE38-1ed0</a><p>####<p>Other Watson Health teams are also hiring multiple positions in:<p>• Denver, CO (AlchemyAPI&#x27;s&#x2F; Watson office) - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEW211erl\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEW211erl</a><p>• Cambridge, MA - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEDMB1edN\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEDMB1edN</a><p>• Bay Area (not Watson Specific) - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEDyB1qd6\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEDyB1qd6</a><p>• Watson across the country! - <a href=\"http:&#x2F;&#x2F;rfer.us&#x2F;IBEDyB1qd6\" rel=\"nofollow\">http:&#x2F;&#x2F;rfer.us&#x2F;IBEDyB1qd6</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 32.7766642, 
        "location": "Dallas, TX", 
        "lon": -96.79698789999999, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822095", 
        "user": "masonhensley"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Nylas | <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;</a> | San Francisco, CA (Mission) | Frontend (JS), Backend (Systems+Ops)<p>Hi! We&#x27;re Nylas. We build N1, the extensible, open source email client, and the infrastructure powering it. We&#x27;re looking for fronted application engineers (React, Electron, JS), designers, backend systems engineers, &amp; infrastructure&#x2F;operations engineers.<p>We recently launched N1, have accumulated 14K stars on GitHub, and are looking for core application engineers to design an extensible platform around email, calendar, and contacts. You&#x27;ll not only use modern web tech to build a better email experience, you&#x27;ll design the developer platform to power the next generation of email apps. See more about N1 here: <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;N1\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;N1</a> &amp; code: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;N1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;N1</a><p>We have more data for a single user than in most startups&#x27; entire database. We&#x27;re scaling heavily and if you have experience with automated deployments, debugging running systems, release engineering, and on-call schedules, but are still comfortable writing code, we&#x27;re for you. :)<p>We take pride in the diverse culture we&#x27;ve built and are looking for more than raw technical talent: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=z7sHc4P4zPg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=z7sHc4P4zPg</a><p>== We&#x27;re particularly looking for folks who ==<p>* Take personal pride in their work and value autonomy and ownership<p>* Want the chance to step up and lead a team<p>* Put the work before ego. We&#x27;ve got each others&#x27; backs, and we want you to be with us on that<p>== A bit more about us ==<p>* Our backend is built on Python, Flask, gevent, nginx, MySQL, AWS, and Debian. We&#x27;ve been careful to keep our architecture componentized.<p>* N1 uses javascript (ES6), React, Flux, SQL for offline caching, Electron, and no jQuery<p>* Tons of our code is open source. Check it out: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas</a><p>* We&#x27;re a team of 15 (12 engineers)<p>* We have a paid vacation policy &amp; value personal responsibility and ownership. Benefits include free Lyft to &amp; from the office, full health, dental, vision, and lunch every day. Some remote work &#x2F; work-from-home is OK too<p>Apply at <a href=\"https:&#x2F;&#x2F;nylas.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com&#x2F;jobs</a> or ping me directly (spang@nylas). I&#x27;m Christine, one of our co-founders. We&#x27;re a diverse team, and encourage applications from all backgrounds.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822527", 
        "user": "e0m"
    }, 
    {
        "address": "Calgary, AB, Canada", 
        "country": "CA", 
        "freshness": true, 
        "full_html": "MethodExists | Calgary, AB | Full-time | REMOTE | Backend developer with great SQL &#x2F; Postgres experience<p>We are a Canadian company based in Calgary, but completely Remote, with developers all over the world. We are developing a universal web-based platform that can be customized for any industry. It is structured to allow non-technical people to edit everything from data model to forms and workflows and visualizations.<p>Some of the problems we&#x27;re tackling: \n- universal and safe formula language that&#x27;s easier than Excel&#x27;s.\n- spinning up new sites instantly and allowing them to be hosted behind corporate firewalls\n- visual form and report editors \n- allowing business analysts to change data model live with zero downtime migrations<p>Some technologies we are using to achieve this:\n- Javascript, node.js, React, D3.js, Leaflet\n- Docker, Rancher\n- Postgres, Redis, RabbitMQ<p>We are using Phabricator for project management, planning and code reviews.  Communication happens through Slack and Google Hangouts. You should have an adequate intersection with UTC-7 and remote work experience!  English is the language of communication, and quality communication is highly important. We write unit tests, lint, and continuously integrate with TeamCity. We are using all the best tools and philosophies to write high-quality code and automate and monitor delivery.<p>As we are Remote we do meet up from time to time, last time we met up to surf and hack in the Dominican Republic.  Hired candidates will need to travel to meet teammates.<p>Your job will be writing backend APIs and coming up with the best SQL queries. You should know your database inside out, we are talking about automated migrations and deep schema analysis.  You should also have a good idea about proper configuration, security and monitoring of the db cluster.<p>We offer a paid trial to prospective candidates, which are about deep immersion with the team, working completely integrated in the process. Your code will be reviewed by team-mates just like everyone else&#x27;s does every time. This is about ensuring a good fit with team members and good productivity and understanding of our philosophy.<p>Please write to us and sell us on why you’re the right candidate.  We don’t enforce a certain way of applying like CVs, so communicate in the way that best describes your value.<p>jobs@methodexists.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.0486151, 
        "location": "Calgary, AB", 
        "lon": -114.0708459, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822829", 
        "user": "mkrn"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "SEEKING WORK-  Located in Houston, Austin, Dallas, and New York. Remote preferred.<p>We are team of four full stack engineers solving challenging problems in the medical, financial, and engineering space. We are independent thinkers and enjoy conquering new technical challenges in high pressure and time sensitive environments.<p>Website: <a href=\"http:&#x2F;&#x2F;innolitics.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;innolitics.com&#x2F;</a><p>Portfolio: <a href=\"http:&#x2F;&#x2F;innolitics.com&#x2F;portfolio&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;innolitics.com&#x2F;portfolio&#x2F;</a><p>Contact: partners@innolitics.com<p>Capabilities: Full Stack Web (Python), Scientific (Matlab&#x2F;Python), Mobile (Phonegap&#x2F;Ionic), Desktop (Java), and anything else the job requires.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127837, 
        "location": "New York", 
        "lon": -74.0059413, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=10822767", 
        "user": "yshrestha"
    }
]