[
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Spydermix | <a href=\"https:&#x2F;&#x2F;www.spydermix.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.spydermix.org&#x2F;</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and&#x2F;or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.<p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.<p># Scale of initial deployment<p>Servers : 100K+ Traffic : Exabytes Users : Millions<p># Things you probably already know in and out<p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.<p># Things you’ll wonder when you read the prototype Apache module for fun<p>- Why don’t most HTTP proxies support keep-alives?<p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?<p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?<p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16048009", 
        "user": "bitxbitxbitcoin"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Fame | Full-Stack Software Engineer | San Francisco, CA or New York City, NY | Onsite | Full-time | $100K+ and equity with full benefits\nI’m the founder and CEO at Fame (fame.co). We built the first ecommerce platform for famous people (celebrities and influencers) and have been turning hundreds of influential people into retailers over the past year.<p>We build shopping websites, full-embeddable stores for blogs, a shopping cart that works perfectly within Instagram and Snapchat, and iOS apps for our clients so their followers and fans can buy every product they recommend all from their own storefront with a universal cart.<p>Our platform is impeccably engineered and customers love us for it — we have hundreds of famous clients and hundreds of satisfied brand partners (Nordstom, Nike, Amazon, etc.). We have amazing investors, plenty of funding, an incredible office in SF (in SOMA), and a low burn rate.<p>We have 3 software engineers and are looking for a few more. Our software stack: * Backend - Ruby on Rails (v5.1), PostgreSQL, Digital Ocean * Online Stores - CoffeeScript, Haml, Rails * Embeddable Storefronts - React * Apps - Swift * Scraping experience is a plus (using Ruby, Python, or other structures)<p>Our team is all full-stack. We generally distribute software tasks based on individual interest and skill. As our 4th software engineer, you will have tons of project ownership. Your ideas will influence the company’s direction. You will do interdisciplinary work across our platform and learn from best-of-the-best engineers.<p>To succeed here, you need to be a quick learner, have a passion for software engineering, and be excited to work at a growing seed stage company.<p>If interested, please email me at cole[at]fame.co.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047773", 
        "user": "colefame"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "TapFwd | San Francisco, CA | Full-Time, Onsite | <a href=\"https:&#x2F;&#x2F;tapfwd.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tapfwd.com</a><p>TapFwd empowers leading marketers to access and share data with complete control. With TapFwd, marketers form private data sharing alliances with complementary brands to unlock entirely new, mutually beneficial ways to acquire customers.<p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;tapfwd\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;tapfwd</a><p>Here are our open roles:<p>- Back-End Engineer: <a href=\"https:&#x2F;&#x2F;tapfwd.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tapfwd.com&#x2F;careers</a><p>- Full-Stack Engineer: <a href=\"https:&#x2F;&#x2F;tapfwd.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tapfwd.com&#x2F;careers</a><p>Tech Stack: React\nRuby on Rails\nJava\nAWS", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047772", 
        "user": "atomon"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Sensor Tower | San Francisco, CA | Full-Time, Onsite | Comp depends on role | <a href=\"https:&#x2F;&#x2F;sensortower.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sensortower.com</a><p>Sensor Tower provides key metrics for mobile app developers so that they can focus on growing their user base, downloads, and revenue (and leave the numbers to us). If you have a mobile app, think of us as being your compass. We&#x27;re hiring for all roles!<p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;sensor-tower\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;sensor-tower</a><p>Here are our open roles:<p>- Data Scientist: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;7eb5e065-4107-4bc9-85b5-99dc9009180b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;7eb5e065-4107-4bc9-85b5-99...</a><p>- Senior Data Algorithm Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;7442e664-c7ff-4221-8ac7-6e99bca8b0b8\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;7442e664-c7ff-4221-8ac7-6e...</a><p>- Senior Full Stack Engineer: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;c171234a-4906-46c3-b609-7d7c8e86963f\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;sensortower&#x2F;c171234a-4906-46c3-b609-7d...</a><p>Tech Stack: Rails | MongoDB | Knockout<p>If you&#x27;re interested or have questions, email: jobs [at] sensortower [dot] com", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047271", 
        "user": "makeshifthoop"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Parabol | Brooklyn, NY | Full-Time, Onsite or Remote | <a href=\"https:&#x2F;&#x2F;www.parabol.co\" rel=\"nofollow\">https:&#x2F;&#x2F;www.parabol.co</a><p>Parabol makes software for distributed organizations. We enable cross-functional collaboration and clarity by syncing teams in a single daily dashboard with a weekly ritual. Our embedded prioritization process improves team transparency, efficiency, and operational growth.<p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;parabol\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;parabol</a><p>Here are our open roles:<p>- 2018 Spring Engineering Intern: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlNXVzMlBfU3ZsNXc&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlNXVzMlBfU3ZsNXc...</a><p>- 2018 Spring Design Intern: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlNmYtWGIteUxhXzA&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlNmYtWGIteUxhXzA...</a><p>- Senior Designer: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlYkNjZkFxbm1IS3c&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlYkNjZkFxbm1IS3c...</a><p>- Senior Full-Stack Engineer: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlellPZ3Z2N0dSNzA&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;0B08vOIWAskFlellPZ3Z2N0dSNzA...</a><p>Tech Stack: Our tech stack is very future-forward and designed to enable Google Docs-like realtime collaboration. From back-to-front: rethinkdb, redis, NodeJS, GraphQL, Relay Modern, React using ES2015+", 
        "h1b": false, 
        "intern": true, 
        "lat": 40.7127753, 
        "location": "New York", 
        "lon": -74.0059728, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16047377", 
        "user": "jrhusney"
    }, 
    {
        "address": "Berlin, Germany", 
        "country": "DE", 
        "freshness": true, 
        "full_html": "HERE | Berlin, Germany | Full-Time | Onsite<p>HERE is looking for a Data Scientist in our IoT (fleet, telematics, positioning, tracking) department.<p>This role will be responsible for Data Science for the IoT business group which includes services with focus on large enterprises, fleet, telematics, positioning, tracking, infrastructure, public sector horizontal and vertical solutions.<p>* Tap into internal existing data sources, start data collection for new data not yet materialized or not yet defined. Moreover, extending company’s data with third party sources of information when needed\n* Build and test analytic and statistical models to support improvement of a wide variety of data-driven processes for our existing and new IoT solutions \n* Capability to effectively interact with both internal and external customer executives, technical and non-technical to explain uses and value of data sciences.\n* Train other teams within the organization on statistical thinking and ML methods.<p>Qualifications<p>* 5+ years relevant experience \n* Bachelor degree in a relevant field required, Master degree is a plus\n* Knowledge and experience in tool such as R, Matlab, Python or SAS, for statistical analysis and modeling\n* Experience with machine learning solutions\n* Proven ability to quickly prototype in languages like Python, C++, Java, and Scala\n* Ability to design efficient algorithms for accessing and analyzing large amounts of data\n* Excellent oral and written communication skills in English<p>If you have any questions, feel free to contact me.<p>More infos at: <a href=\"https:&#x2F;&#x2F;datasciencejobs.de&#x2F;post&#x2F;sr-data-scientist-iot-fleet-telematics-here&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;datasciencejobs.de&#x2F;post&#x2F;sr-data-scientist-iot-fleet-...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 52.52000659999999, 
        "location": "Berlin", 
        "lon": 13.404954, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047590", 
        "user": "stadeschuldt"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Snowplow Analytics | ONSITE&#x2F;REMOTE (UTC+0 - UTC+1) | Full-time | <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;</a><p>Our mission is to empower people and companies to use data to do transformative things. We provide technology and services that enables our users to collect the data that they want, use that data to surprise and delight their customers, and transform their business.<p>We have an office in Shoreditch but over half of our employees also currently work remotely, which is something we&#x27;re passionate about continuing. We&#x27;re set to grow rapidly this year and are looking for:<p>1. Site Reliability Engineer - <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=955625\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=955625</a><p>2. Support Engineer - <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=972752\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=972752</a><p>3. Customer Success Manager - <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=969721\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;?gh_jid=969721</a><p>We currently monitor the Snowplow event pipeline across more than 100 AWS accounts and are working towards managing 1,000 and then 10,000 AWS, GCP and Azure accounts.<p>Our on-house stack includes Docker, Ansible, Consul, CloudFormation, Bash and Golang. For our next level of automation, we are now exploring tools such as Terraform, Kubernetes and Vault.<p>For more information or to apply, please email me at miriam@snowplowanalytics.com.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16047493", 
        "user": "miriameva"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "CityMunch | London, UK | ONSITE | salary + equity | <a href=\"http:&#x2F;&#x2F;citymun.ch&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;citymun.ch&#x2F;</a><p>CityMunch allows independent restaurants and food trucks to attract new customers, by offering discounts in real-time to users near them through our app, reducing food waste and keeping kitchens busy. In our short history, we have launched in 3 cities (London, Bristol and Manchester) with hundreds of partner restaurants, and 35,000 app downloads.<p>The next step is going national, and building tech that allows predictive dynamic pricing -- for example, tell restaurants &#x27;based on your location, cuisine type, users nearby and the weather, a 30% discount will attract 5 new customers in the next 2 hours.&#x27;<p>We are hiring a mid-to-senior full-stack developer, ideally with experience in Javascript (mainly Angular&#x2F;Ionic) or Java (Spring Boot). You would be developer number 2 in a small startup, so there are lots of opportunities to make a meaningful difference to the future of the CityMunch tech.<p>We are currently based in Google Campus in Shoreditch, with plans to move elsewhere in Shoreditch in early 2018. Having raised a seed round already, and with additional investment from Just Eat, we are set to continue our fast growth in 2018.<p>To apply, email me at amy@citymunchapp.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047341", 
        "user": "amyboyd"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Entelo | San Francisco, CA | Full-time | Onsite<p>Entelo uses huge amounts of data and predictive analytics to help companies build great teams. Our ~30-person engineering team uses technologies like Ruby, JavaScript, Go, React, Kubernetes, Docker, Kafka, Spark, and Redshift, and we already have customers like Facebook, Netflix, Slack, and Paypal. We ingest and parse up to 2 TB of social profile data per day, predict when people will change jobs, match people to jobs, and more. We&#x27;ve recently had some great additions to our team, including Gaurav Kataria, former Head of Data Science and Growth at Google Cloud:\n<a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;from-google-entelo-gaurav-kataria\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;from-google-entelo-gaurav-kat...</a><p>We care deeply about promoting diversity in tech and being pleasant, collaborative folks. Join us as we continue to grow very quickly and discover new ways to merge machine learning, big data, and full-stack engineering to provide value to our customers!<p>We&#x27;re hiring for many roles including:<p>* Data Scientist<p>* Senior Data Engineer<p>* Senior Data Scientist<p>* Senior Frontend Engineer<p>* Senior Fullstack Engineer<p>* Senior Infrastructure Engineer<p>* Senior Software Engineer<p>* Software Engineer<p>If you&#x27;re interested, check out our open positions at <a href=\"https:&#x2F;&#x2F;www.entelo.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.entelo.com&#x2F;careers</a>, or feel free to email me directly at tom at entelo dot com.", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047330", 
        "user": "tombenner"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Lazada eLogistics | Regional Head of Data | Singapore | Onsite | Full-time<p>See the full JD here: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;516423939&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;516423939&#x2F;</a><p>Apply by emailing your solution to the below screener to irene.ling@lazada.com. Please have “[your name] - Regional Head of Data - HN” as the subject line.<p>Here (<a href=\"http:&#x2F;&#x2F;i.imgur.com&#x2F;ImdVZBI.png\" rel=\"nofollow\">http:&#x2F;&#x2F;i.imgur.com&#x2F;ImdVZBI.png</a>) is a simplified model of the systems used by a fictional online retailer. Their three systems track the flow of an order placed on their website, through their warehouse, and to the point of delivery. Each system uses its own database (MySQL for the shop, PostgreSQL for the warehouse, etc.). The systems communicate to each other via API calls (that are not shown here).<p>Please review the model and be prepared to discuss it with us. When we talk, we&#x27;ll ask you how you would answer queries about this fictional business. These will be high-level questions and not deeply technical. We&#x27;ll also want to hear your opinion of the model, its limitations, and how it could be improved.<p>1. Write a query to count the number of products across all orders received by the warehouse system today (the PostgreSQL database).<p>2. Given an order_id, how would you find its last GPS coordinates?<p>3. What do you think is the most serious problem among these systems, and why? (We are not looking for a specific answer, we want to know what you think is a problem.)<p>4. Why do you think this fictional company chose Redis for their delivery system, and is it a good choice?", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047737", 
        "user": "irene_ling"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "BMC Group | Full-time, REMOTE (worldwide) | Senior C# full stack (emphasis on backend) web developer | $ Hourly (full time) - Highly Competitive - funded<p>We&#x27;re a small distributed team of 2 core developers, 2 support service configuration specialists &#x2F; BAs, and a PM, looking a 3rd core developer to help us build an insurance application, and improve our existing technical products and services.<p>We need a self-reliant developer with extensive .NET experience (5+ years) who is comfortable building robust and well-tested products end-to-end. As a member of our small team, you will serve a critical role and have a large impact on what we produce.<p>Insurance software may not sound sexy on the surface, but we are tackling some unique and challenging problems related to groundbreaking Japanese language services on the backend, along with producing modern, high quality, differentiating, and rich user experience features.<p>We enjoy a friendly and collaborative work environment.\nWe all have families and understand the value of life outside of work. Although we expect you to work full-time, we have an accommodating and flexible schedule.<p>.NET technologies used:\nC# 7, Core MVC 2, Entity Framework Core 2.0, MS SQL Server, Azure App Service, PowerShell, Visual Studio<p>Experience with unit testing and integration testing is required.<p>Strong English communication skills are required.<p>Experience working remotely is a plus but not required.<p>Knowledge of Japanese is helpful but not required.<p>Other technologies we utilize:<p>Webpack, Babel, ES6, React, Mobx\nElasticsearch, MySQL\nAWS: EC2, S3, Elastic Beanstalk\nLinux, NodeJS, Terraform, TeamCity, Docker, Ansible, Git<p>Please contact eric.lesch@bmc-group.co.jp with the subject title &quot;.NET Developer&quot;, your resume, and any links to side projects, github, etc. Thank you for reading!", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Full-time, REMOTE", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16046560", 
        "user": "santoriv"
    }, 
    {
        "address": "Toronto St, Ottawa, ON K1S, Canada", 
        "country": "CA", 
        "freshness": false, 
        "full_html": "Shopify | Developer | Toronto, Ottawa, Montreal, Waterloo | FULL-TIME ONSITE VISA| <a href=\"http:&#x2F;&#x2F;shopify.com\" rel=\"nofollow\">http:&#x2F;&#x2F;shopify.com</a><p>Shopify is a platform that allows entrepreneurs to easily setup an online store. Our products help merchants who are just starting as well as established brands that need a solution that can scale with their traffic.<p>We&#x27;re always working on products that make it easier for entrepreneurs to reach their audience and help them make data driven decisions.<p>Shopify is built in Ruby on Rails running on a stack composed of Docker, Golang, Mysql and Redis. Our data infrastructure uses Kafka, HDFS, Zookeeper and we use PySpark and Sklearn for our data modeling and machine learning tasks. If you&#x27;re interested in building tools that empower Entrepreneurs come take a look at who we are and what we&#x27;re doing<p>- blog: <a href=\"https:&#x2F;&#x2F;engineering.shopify.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.shopify.com&#x2F;</a><p>- github: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Shopify\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Shopify</a><p>- job postings: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;shopify?lever-via=XBuWsYM_Q2\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;shopify?lever-via=XBuWsYM_Q2</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 45.4010283, 
        "location": "Toronto, Ottawa,", 
        "lon": -75.6732997, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047054", 
        "user": "quadrature"
    }, 
    {
        "address": "Washington, DC, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "United States Digital Service | Senior Software Engineers, Senior Site Reliability Engineers, Senior Designers, and more! | Washington, DC | ONSITE<p><a href=\"https:&#x2F;&#x2F;www.usds.gov&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.usds.gov&#x2F;</a><p>The best of technology. The best of government. And we want you.<p>We&#x27;re looking for the most tenacious designers, software engineers, product managers, and more, who are committed to untangling, rewiring and redesigning critical government services. You&#x27;ll join a team of the most talented technologists from across the private sector and government. No government resume required! We work on some of the biggest issues affecting the American people there are, immigration, veterans service, students, health care, and more. We&#x27;re especially looking for talented senior engineers to join us to help shift move government tech in the right direction. See our most recent Report to Congress for examples of what you could be working on:<p><a href=\"https:&#x2F;&#x2F;www.usds.gov&#x2F;report-to-congress&#x2F;2017&#x2F;07&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.usds.gov&#x2F;report-to-congress&#x2F;2017&#x2F;07&#x2F;</a><p>Apply here:<p><a href=\"https:&#x2F;&#x2F;www.usds.gov&#x2F;join\" rel=\"nofollow\">https:&#x2F;&#x2F;www.usds.gov&#x2F;join</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 38.9071923, 
        "location": "Washington, DC", 
        "lon": -77.0368707, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047023", 
        "user": "usdsgov"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "Gambit Research Ltd (<a href=\"http:&#x2F;&#x2F;gambitresearch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;gambitresearch.com</a>) | London, UK | ONSITE | Full time<p>At Gambit we research and manage automated sports betting algorithms on behalf of our clients. Their algorithms run on our proprietary execution platform which interfaces with a large variety of bookmakers and exchanges, enabling access to the best prices and massive liquidity.<p>Our distributed, concurrent system has a core written in Erlang, which interacts with a wide variety of Python processes across the rest of the business. Some of the other technologies we use are: Linux, Docker, Kubernetes, Ansible, C, C++, Java, Haskell, Julia, Go, JavaScript, AngularJS, ReactJS, Django, PostgreSQL, Redis, Apache Spark, Apache Kafka, RabbitMQ, Celery, Elasticsearch, Logstash, Kibana, Graphite, Sentry, Git, GitLab.<p>We have a very flat hierarchy and an emphasis on employee freedom. We encourage our team to work on projects that interest them, as we believe people are happiest and most productive when intellectually stimulated. You don&#x27;t need to be interested in sports or betting.<p>We&#x27;re actively hiring for the following positions:<p><pre><code>  - Software developer\n  - Linux infrastructure engineer &#x2F; Sysadmin &#x2F; SRE &#x2F; DevOps engineer\n</code></pre>\nApproximate salary range: £30-80k.<p>More information can be found at <a href=\"http:&#x2F;&#x2F;gambitresearch.com&#x2F;jobs.html\" rel=\"nofollow\">http:&#x2F;&#x2F;gambitresearch.com&#x2F;jobs.html</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046917", 
        "user": "superscalar"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "New York Stock Exchange | <a href=\"https:&#x2F;&#x2F;www.nyse.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nyse.com</a> | New York, NY | Lead and senior engineers | ONSITE | Full-time<p>We are looking for quick learners who enjoy working with modern software development tools in the financial and capital markets space.<p>Knowledge of specific frameworks or libraries is less important than a broad knowledge of software development practices, and an ability to learn.<p>At the NYSE, we are building customer-facing web applications with tons of referential data and many downstream systems.<p>Must haves:<p>1. Significant experience developing web applications and web sites.<p>2. Very good grasp of Python 3.5+ or TypeScript. Both are a plus.<p>3. Some knowledge of the other language listed above.\n4. Willingness to work with both ecosystems.<p>5. Relational database experience, ideally PostgreSQL.<p>6. An understanding of automated testing and when it’s an asset and when it’s a liability.<p>7. Clear, concise coding skills. Your code is more often described as &quot;clean and elegant&quot; than &quot;clever.&quot;<p>8. A healthy amount of patience for firewall&#x2F;infrastructure navigation. We use modern stacks and have access to most tools, but still operate in a regulated environment.<p>Nice to haves:<p>1. Understanding of formal methods<p>2. Bash and vi fu.<p>3. Mypy and static typing experience in Python<p>4. React experience.<p>5. Django experience.<p>6. Static typing experience in other languages: Java, C++<p>7. API design<p>8. Rust experience<p>Interested? Email me at silvio.gutierrez@nyse.com. Please put Hacker News in the subject line. Maybe even take a look at the shibboleths in the sub-comment below and try answering a few.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127753, 
        "location": "New York", 
        "lon": -74.0059728, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047171", 
        "user": "silviogutierrez"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Conductor Technologies | Oakland, CA &#x2F; San Francisco Bay Area &#x2F; REMOTE OK | Full-time | $100k-$130k + equity | Team of 7 engineers in the SF bay area and on the East coast<p>Back-end software engineer (proficiency in Python required)<p><a href=\"https:&#x2F;&#x2F;www.conductortech.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.conductortech.com</a><p><a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;rgjRfW\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;rgjRfW</a> (full job description)<p>Our mission is to lead the transition from on-premises infrastructure to cloud-based, infinitely scalable and on-demand resources for VFX and Animation rendering, simulation and beyond.<p>What to expect:<p>- In your first 90 days: you’ll contribute to existing microservices in Python and help maintain our legacy Python AppEngine codebase. You’ll contribute to architectural discussions, participate in code reviews, and you’ll deploy your services automatically through our CI&#x2F;CD pipeline.<p>- In your first 6 months: you’ll design, write and own microservices written in Python and&#x2F;or Go, and help migrate our existing services to AWS.<p>- By the end of your first year: you’ll write lambda functions on AWS, and own several services written in Python and&#x2F;or Go.<p>If any of this sounds interesting, we&#x27;d love to hear from you! Feel free to reach out to me directly, using the subject “Back-end SWE: HN 1&#x2F;18”: francois {at} conductortech.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16046829", 
        "user": "flebel"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": false, 
        "full_html": "Primate Labs | <a href=\"http:&#x2F;&#x2F;www.primatelabs.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.primatelabs.com&#x2F;</a> | Full-Time, Interns Onsite | Toronto, Ontario, Canada<p>Primate Labs develops Geekbench, the popular cross-platform benchmark, and we&#x27;re looking for enthusiastic software developers to work on it.  You will help develop and characterize benchmarks for future versions of Geekbench. This is a great position for developers interested in computer performance, high-level and low-level software optimization, and cross-platform development.<p>The ideal candidate has experience with C++ and experience working on a small team.  It would be nice if you had experience with any of the following technologies (but by all means these are not mandatory): C++11, GPGPU APIs (OpenCL, CUDA, Metal, or Vulkan), and code optimization and profiling tools.<p>Benefits include competitive salary and vacation time, medical and dental benefits, flexible work hours, and a lack of bureaucracy.<p>These positions are onsite in our Toronto, Ontario office. Interested? Send me email at john@primatelabs.com to apply or for more information.", 
        "h1b": false, 
        "intern": true, 
        "lat": null, 
        "location": "Full-Time, Interns", 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046960", 
        "user": "jfpoole"
    }, 
    {
        "address": "Chicago, IL, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Kin.com | Ruby Developer | Chicago, IL | ONSITE<p>We&#x27;re an insurance startup fixing the $100B home insurance industry with modern technology and big data techniques. We are looking for experienced Ruby developers to join our team who are:<p>* Fast learners.<p>* Comfortable in a Startup environment. Either having worked for a startup directly, or other comparable experience.<p>* Professional developers with a minimum of 5 years of experience.<p>* Experienced with Rails.<p>* Have FinTech experience (a plus but not required)<p>We offers competitive salaries including health insurance and stock options. If you&#x27;re interested contact us at dev-jobs@kin.com", 
        "h1b": false, 
        "intern": false, 
        "lat": 41.8781136, 
        "location": "Chicago, IL", 
        "lon": -87.6297982, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046605", 
        "user": "dennyabraham"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": true, 
        "full_html": "Koru Kids | London | Full-time Onsite | Full Stack Ruby Engineer #2 | <a href=\"https:&#x2F;&#x2F;www.korukids.co.uk&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.korukids.co.uk&#x2F;</a><p>Koru Kids is growing quickly. We’re on a mission to improve childcare in London, and looking for someone experienced, creative &amp; friendly to join the team as our second full stack engineer.<p>We’re building a marketplace that enables families to find and share great quality nannies. To do this, we’re building great software for our families, supporting our matching team with critical tools that make complex matching problems a breeze, and using technology to supercharge our nanny recruitment and training processes.<p>We’re continuously improving our product, building key features that will move the needle in a big way. Instead of an endless product roadmap, we run short development cycles to test assumptions and make smart decisions quickly. This isn’t a sprint and there’s no project managers, we work closely with the rest of the business to make sure we deliver the most value to our customers.<p>Our stack uses Ruby for most of the backend, with Rails, PostgreSQL and Redis making up the majority of our core product. We use modern front end tooling, with ES6, React and Tachyons. When it comes to shipping code, we love GitHub code reviews and making CircleCI happy before anything gets into production. We mostly deploy to Heroku, with some heavy lifting on AWS. We favour feature flags over staging environments and deploy to production as often as we need to; deployment cycles shouldn’t get in the way of delivering value.<p>We’re looking for an experienced Ruby developer who thrives in small, fast-moving engineering teams.<p>If this sounds interesting, you can read more &amp; apply at <a href=\"https:&#x2F;&#x2F;korukids.workable.com&#x2F;jobs&#x2F;622008\" rel=\"nofollow\">https:&#x2F;&#x2F;korukids.workable.com&#x2F;jobs&#x2F;622008</a> or email me directly at michael [at] korukids.co.uk", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047013", 
        "user": "mbaird"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "DIVE Networks | Toronto | ONSITE | Full-time | Dev Manager &#x2F; Full-stack developer<p>DIVE builds personalized news networks for all kinds of businesses. We are hiring a full stack developer to manage and grow our development team and product lineup. This is a full-time position at our Toronto location. We have a great stack built on Clojure, ClojureScript and Python.<p>DIVE&#x27;s UX looks amazing on TVs and personal computing devices. We are also extending our platform to digital billboards (think Times Square). If you have experience in the advertising space, especially Out-of-Home, this may be particularly appealing to you.<p>Check out the full job listing here <a href=\"https:&#x2F;&#x2F;www.dive-networks.com&#x2F;jobs&#x2F;2017&#x2F;12&#x2F;31&#x2F;dev-manager-full-stack-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dive-networks.com&#x2F;jobs&#x2F;2017&#x2F;12&#x2F;31&#x2F;dev-manager-fu...</a>.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046945", 
        "user": "oshoma"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "Qualys Inc. (qualys.com, NASDAQ: QLYS) | Foster City CA | Full-time, ONSITE&#x2F;REMOTE | $110k-$125k, RSUs, 401(k) matching, bonuses, health benefits<p>Qualys is a provider of cloud security, compliance and related services for small and medium-sized businesses and large corporations.<p>We are looking for a capable, motivated engineer to help us update and maintain our backend infrastructure.  The ideal candidate has good knowledge of Ceph.  A demonstrable ability to learn new and complex technologies is a substitute for this requirement.  Must have a good knowledge of Linux, VM infrastructure, databases, and preferably some experience with an S3-compatible object storage system.  Solid programming experience in a language such as Java, C, Go, or Python is required as is experience with networking, logging, and monitoring.<p>For consideration for a remote position, the applicant should provide references that will verify he&#x2F;she is capable of working remotely efficiently and reliably.  Remote applicants must be willing to meet off-hours occasionally, as we have offices in several countries that we sometimes need to sync with.<p>Please send a short cover letter and a resume to jdavis@(our domain).  Interview process will include a short coding exercise.  No recruiters.", 
        "h1b": false, 
        "intern": false, 
        "lat": null, 
        "location": "Full-time, ONSITE&#x2F;REMOTE", 
        "lon": null, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16047332", 
        "user": "jdqhire"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Achieve | Founding Product &amp; Frontend Engineer | New York City | Onsite<p>We an early stage startup making homeownership more achievable in the US, starting with leveling the playing field between the average homebuyer who needs a mortgage and wealthy individuals and investors who buy homes with all-cash. We’re doing this with a unique product that combines technology, finance and real estate operations.<p>We are looking for a founding product &amp; frontend engineer to join our team. You’ll be a great fit if you love to craft product as well as engineering, bring strong frontend skills to the table, and care about working on a meaningful mission. We use Python + React on GCP but believe the best engineers can learn a new stack extremely quickly.<p>We’re a team of ex-Twitter, Lending Club, Managed by Q folks (current at 6 people) with real estate, machine learning, and consumer apps experience. We’re well funded by founders of Trulia&#x2F;Zillow, and investors of Coinbase, Redfin, Blend, and separately, have raised enough initial real estate capital to purchase many, many homes for people.<p>Ping me (co-founder&#x2F;CTO) wei at achieveliving.com if you’re interested.", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127753, 
        "location": "New York", 
        "lon": -74.0059728, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046695", 
        "user": "ganjianwei"
    }, 
    {
        "address": "Ann Arbor, MI, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "Atomic Object | Software Consultancy | Ann Arbor, MI | Onsite&#x2F;Fulltime<p><a href=\"https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-job\" rel=\"nofollow\">https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-j...</a><p>--- Work with smart, passionate people. Make cool stuff. Learn every day. ---<p>Atomic is growing a diverse and inclusive team of curious, creative people who love creating great software for our clients.<p>THE POSITION\nAtomic Object is a consultancy that creates custom software products. We work across web, mobile, desktop, and embedded product development—helping our clients innovate and grow by doing what they do better.<p>Atomic makers work on self-managed teams of 2-10 designers, developers, and testers—collaborating to create products for our clients, from the idea phase through launch and beyond.<p>WHY ATOMIC?\nAtomic is a great place to do awesome work. As an Atom, you&#x27;ll: Join a tight-knit group of makers working in an atmosphere of friendship, exploration, and respect.<p>Work on a variety of projects and help make pipelines safer, cities greener, healthcare smarter, and old products new again. Be part of a transparent, employee-owned company that&#x27;s active in making the software community stronger, smarter, and more diverse.<p>Receive great benefits, including support for professional development, schedule flexibility, employee ownership, 401(k) contributions, and generous vacation time.<p>INTERESTED?\nIf you&#x27;d like to find out more about Atomic or this position, don&#x27;t hesitate to check out our current open position:\nSenior Software Developer &amp; Consultant: <a href=\"https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-job\" rel=\"nofollow\">https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-j...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.2808256, 
        "location": "Ann Arbor, MI", 
        "lon": -83.7430378, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046766", 
        "user": "jonahbailey"
    }, 
    {
        "address": "San Francisco, CA, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "PlanGrid (YCW12) | San Francisco | Full-time, On-Site | Visa<p>We’re building software that is changing the construction process (think GitHub for construction). Our users love our app because it helps them build real things more efficiently. By joining our team you can influence product decisions and work on interesting technical challenges (our client apps work with GBs of blueprints and metadata). Our engineering teams are small; whatever team you work on, you&#x27;ll have a chance to have a big impact.<p>We’re hiring across all of our engineering teams: Android, Web, iOS, Windows, Backend (Python).<p>You can see our job postings and apply here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;plangrid?lever-via=SzsN-_Jgq1\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;plangrid?lever-via=SzsN-_Jgq1</a><p>As an example, here&#x27;s a detailed post about what working on the iOS team looks like: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;plangrid-technology&#x2F;working-on-the-plangrid-ios-team-1d1757c76be9\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;plangrid-technology&#x2F;working-on-the-plangr...</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 37.7749295, 
        "location": "San Francisco", 
        "lon": -122.4194155, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046569", 
        "user": "Ben-G"
    }, 
    {
        "address": "Somerville, MA, USA", 
        "country": "US", 
        "freshness": true, 
        "full_html": "Formlabs|Somerville, MA|ONSITE|Full-time|Software Engineer<p>Formlabs is establishing the industry benchmark in 3D printing for professionals across a variety of industries. We&#x27;re committed to bringing powerful and accessible fabrication tools into the creative hands of professionals around the world.<p>Are you passionate about systems, with a knack for complex algorithms and a desire to have a big impact on the backend side of a complex product? Join the Formlabs team as a Software Engineer and take an active role in developing our intuitive, high-caliber product.<p>Interested? Learn more here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;74rlca1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;74rlca1</a>", 
        "h1b": false, 
        "intern": false, 
        "lat": 42.3875968, 
        "location": "Somerville, MA", 
        "lon": -71.0994968, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16046957", 
        "user": "Formlabs"
    }, 
    {
        "address": "London, UK", 
        "country": "GB", 
        "freshness": false, 
        "full_html": "ReallyCare | London&#x2F;Brighton | REMOTE | Full-time | Full-Stack Engineer<p>ReallyCare is a not-for-profit micro-company driving adoption of open source software in the adult social care space. We are seeking a senior engineer to join the founder to work on and help shape the future of our MEAN stack product for providers of domiciliary care.<p>Job Responsibilities:<p>- Continue the development of existing product<p>- Build new products from the ground up<p>Qualifications:<p>- Excellent Node JS<p>- Excellent web development skills, which must include experience of AngularJS and Angular<p>- Strong MongoDB<p>- Previous startup and product experience<p>- Ability to work independently and efficiently on projects<p>Some exposure to Ionic would be an advantage.<p>Apply by email including CV to mark [at] reallycare [dot] org", 
        "h1b": false, 
        "intern": false, 
        "lat": 51.5073509, 
        "location": "London", 
        "lon": -0.1277583, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16046866", 
        "user": "reallycare_mark"
    }, 
    {
        "address": "New York, NY, USA", 
        "country": "US", 
        "freshness": false, 
        "full_html": "eBay | www.ebay.com | New York | NYC | Full Time | ONSITE | jobs@ebaynyc.com | VISA ok<p>We are hiring experienced data scientists to change the way eBay does advertising. eBay&#x27;s old advertising strategy was 3rd party focused (Ads that sent people off eBay). Our CEO said that strategy has changed. We need ads that keep people on eBay and offer better choices for our buyers. We are the team blowing up the old strategy and doing something better. You can move the needle when it comes to eBay&#x27;s profit. We are a small team in a growing remote office. This is a unique opportunity to learn search engine and recommendation technology which rank eBay&#x27;s 1+ billion active items. We apply cutting edge machine learning techniques on petabytes of data and thousands of Spark&#x2F;YARN nodes. This includes deep learning, XGBoost and online learning. Our interview consists of two phone screens. Then you come onsite to meet the team and do a code test. The role will be 50% production coding and 50% research.<p>jobs@ebaynyc.com | Ask for Adam", 
        "h1b": false, 
        "intern": false, 
        "lat": 40.7127753, 
        "location": "New York", 
        "lon": -74.0059728, 
        "remote": true, 
        "url": "https://news.ycombinator.com/item?id=16046915", 
        "user": "adamilardi"
    }, 
    {
        "address": null, 
        "country": null, 
        "freshness": true, 
        "full_html": "BOOKING.COM ONSITE Full-time, relocation to Amsterdam&#x2F; or our Tel Aviv office, (H1B or its dutch equivalent anyway) is taken care of by the company.\nGeneral Interview Process -&gt; Hackerrank test, call with the recruiter, phone interview, onsite interviews<p>I work at Booking.com, which is a world leader in travel accommodations, as a backend developer. I have only positive things to say about working here. The people are intelligent and helpful, interesting problems to solve and the work hours are unbelievably sane. The company is strongly data driven and very dynamic, which was one of its biggest charms for me. Amsterdam is not a bad place to be either :) The Dutch government also gives a tax break through the 30% ruling to non-dutch people.<p>The work environment is very international and everybody speaks fluent English. The relocation process is also very finely tuned through years of experience of doing this. If you have any other questions about the company or the hiring process or you would like me to refer you, please feel free to send me an email at siddharthsarda01 at gmail.com (Email also in my profile at Hacker news).<p>To have an idea of the kind of problems being solved here, you can also look at our dev blog:<a href=\"http:&#x2F;&#x2F;blog.booking.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.booking.com&#x2F;</a><p>We are hiring for our headquarters office in Amsterdam:<p>- Backend developers - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;g5n6oe\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;g5n6oe</a><p>- Software Developer and Team Lead - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;1pc5ot1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;1pc5ot1</a><p>- Senior Software Developer - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;a7xd1v1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;a7xd1v1</a><p>- Senior Java Developer - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;r26qig1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;r26qig1</a><p>- Senior Software Developer(Technical lead) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;qin6c01\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;qin6c01</a><p>- Client Side Developers and Team Lead - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;r64fyd1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;r64fyd1</a><p>- Full stack developer and Team lead - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;367plc1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;367plc1</a><p>- Full Stack developer, Tel Aviv - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;hymg7n1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;hymg7n1</a><p>- Data analysts - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;al15kt\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;al15kt</a><p>- Data Scientist(Machine Learning) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;5uxtdv\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;5uxtdv</a><p>- UX Designer - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;e23axu\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;e23axu</a>", 
        "h1b": true, 
        "intern": false, 
        "lat": null, 
        "location": null, 
        "lon": null, 
        "remote": false, 
        "url": "https://news.ycombinator.com/item?id=16047643", 
        "user": "sid6376"
    }
]